Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: es

source: Click and drag the separator collapsed to the window border toward the window center to display again the preview area.
es: Arrastrar el separador colapsado hacia el centro del panel para volver a mostrar el área de previsualización.

source: The A/R of the preview area depends on the A/R of the current camera.
es: La proporción del área de previsualización de cámara, dependerá de la Proporción de la cámara activa.

source: **To change the background color of the preview area:**
es: **Para cambiar el color de fondo del área de previsualización:**

source: Use the buttons in the bottom bar of the FX Settings window to choose a **White** (|preview_white|), **Black** (|preview_black|) or **Transparent** (|preview_checkbox|) background.
es: Usar los botones disponibles en la barra inferior del área de previsualización para elegir un fondo **Blanco** (|preview_white|), **Negro** (|preview_black|) o **Transparente** (|preview_checkbox|).

source: **To navigate the preview area:**
es: **Para navegar el área de previsualización:**

source: Use the Reset View shortcut (by default the **Alt + 0** key) to display preview at its actual size.
es: Usar el atajo del comando Restablecer vista (de forma predefinida **Alt + 0**) para mostrar la previsualización a su tamaño real.

source: Using Effects Gadgets
es: Uso de los Manipuladores de efectos

source: Some effects parameters related to positions or dimensions have some gadgets available in the Viewer in order to be set by using the camera box and the scene elements as a reference. For example the Radial Gradient effect has two circular gadgets that can be edited to set the inner size and the outer size of the gradient.
es: Algunos parámetros de efectos, relativos a posiciones o dimensiones, presentan algunos controles para poder ser manipulados directamente en el Visor, usando en el cuadre de la cámara activa y los otros elementos de la escena como referencia. Por ejemplo, el efecto Radial Gradient presenta dos manipuladores circulares que pueden ser editados para permitir definir los tamaños mínimo y máximo del gradiente.

source: As soon as an effect node is selected in the schematic, the **Animate** tool becomes the current tool and the related effect gadgets, if available, are shown. The Animate tool settings will refer to the column the effect is applied to, but in case the effect creates a computer generated image (e.g. a radial gradient or a light spot) the settings will refer to the effect column itself (see :ref:`Animating Objects <animating_objects>` ).
es: Tan pronto como se seleccione el nodo de un efecto en el Diagrama, se activará la herramienta **Animar** y se mostrarán los manipuladores correspondientes a dicho efecto, si los hubiera. Las opciones de la herramienta Animar harán referencia a la columna a la que se encuentre aplicado el mismo, pero en caso de que el efecto creara su propia imagen desde cero (p.ej: los efectos Radial Gradient o Light Spot) las opciones se referirán a la columna del efecto en sí misma (ver :ref:`Animación de efectos <animating_objects>` ).

source: **To visualize effects gadgets in the Viewer:**
es: **Para visualizar los manipuladores de los efectos en el Visor:**

source: Select the effect node in the FX Schematic.
es: Seleccionar el nodo del efecto en el Diagrama de efectos.

source: **To edit effects gadgets:**
es: **Para usar los manipuladores de los efectos:**

source: Click and drag the effects gadgets visible in the Viewer. As you roll over the gadget and the related handles, the cursor changes shape to indicate you are editing an effect gadget.
es: Arrastrar los manipuladores mostrados en el Visor. A medida que se posa el puntero del ratón sobre un manipulador, su forma cambiará para indicar el parámetro que podrá ser modificado.

source: Some gadgets have a handle for reference; however any point along the gadget shape can be clicked and dragged.
es: Algunos manipuladores contienen un asa de control como referencia; sin embargo cualquier punto a lo largo del manipulador podrá ser usado para arrastrar.

source: Defining Colors and Color Spectrums
es: Definición de colores y espectros de colores

source: Some effects may require the definition of a color, or a color spectrum.
es: Es posible que algunos efectos requieran de la definición de un color o un espectro de colores.

source: Colors can be defined by editing the related Red, Green, Blue and Alpha values, or by using the Style Editor.
es: Los colores podrán ser definidos mediante la edición de sus valores Rojo, Verde, Azul y Alfa correspondientes, o mediante el Editor de estilos.

source: |Defining_Colors_Example|
es: |Defining_Colors_Example_es|

source: Color spectrums, i.e. a series of colors defining a continuous gradient, can be defined by adding any color you need, and editing each color separately. The color in the spectrum can be moved to set the distance between two colors and the related gradient.
es: Será posible definir espectros de color (una serie de colores que definan un gradiente continuo) agregando cualquier color que sea necesario, así como editando cada uno de los colores existentes de forma independiente. Un color del espectro podrá ser movido para definir la distancia entre dos colores, así como el gradiente intermedio generado por ese color y los adyacentes.

source: **To define a color:**
es: **Para definir un color:**

source: Set the Red, Green, Blue and Alpha values.
es: Definir los valores de Rojo, Verde, Azul y Alfa.

source: Click the color thumbnail and use the Style Editor to edit it (see :ref:`Plain Colors <plain_colors>` ).
es: Hacer clic en la miniatura de color y usar el Editor de estilos para editarlo (ver :ref:`Colores <plain_colors>` ).

source: **To set a color of the spectrum:**
es: **Para definir un color del espectro:**

source: Select the arrow below the spectrum identifying the color, and edit the related color.
es: Seleccionar la flecha debajo del espectro que identifica a cada color y editar el color deseado.

source: **To add a color to the spectrum:**
es: **Para agregar un color al espectro:**

source: Click the spectrum where you want to add the new color.
es: Hacer clic en el espectro, donde se desee agregar el nuevo color.

source: **To move a color in the spectrum:**
es: **Para mover un color en el espectro:**

source: Click and drag the arrow identifying the color to a new position.
es: Hacer clic y arrastrar la flecha que identifica al color deseado a una nueva posición.

source: **To remove a color from the spectrum:**
es: **Para eliminar un color del espectro:**

source: Click and drag the arrow identifying the color *down*.
es: Hacer clic y arrastrar la flecha que identifica al color que se desee eliminar hacia *abajo*.

source: Creating Presets
es: Creación de ajustes prestablecidos

source: A particular configuration and animation of an effect parameters can be saved as a **Preset** to be available later on, both in the FX Browser and the drop-down menus that open when right-clicking nodes or in the Schematic area.
es: Es posible guardar la configuración y animación de los parámetros de un efecto como un **Ajuste** prestablecido, para poder volver a cargarlo en otra ocasión, tanto mediante el Explorador de efectos, como del menú contextual del Diagrama de efectos.

source: When a preset for a particular effect is saved, in the FX Browser the effect icon turns into a folder containing the saved preset, with the folder icon still selectable to insert the effect with its default values; in the drop-down menus the effect has an additional drop down menu where the first item can be selected to insert the effect with its default values.
es: Cuando se guarda un ajuste prestablecido para un efecto en particular, en el Explorador de efectos el ícono del efecto se transformará en un ícono de carpeta, la carpeta contendrá el ajuste guardado, permaneciendo aún disponible el ícono de carpeta como forma de insertar el efecto en la escena, con sus parámetros predefinidos (no usando ningún ajuste guardado por el usuario); en el menú contextual del Diagrama de efectos el efecto contendrá un menú extra desde donde será posible elegir, tanto el efecto usando sus valores predefinidos, como el ajuste guardado por el usuario.

source: |Creating_Presets_Example|
es: |Creating_Presets_Example_es|

source: Presets are saved in the ``<projectroot>\fxs\preset`` folder. This allow the presets to be available on all the computers sharing the same *Projectroot* (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
es: Los ajustes prestablecidos serán guardados en la carpeta ``<principal_de_proyectos>\fxs\preset``. Esto permite eque los ajustes se encuentren disponibles en todas las computadoras que compartan la misma *carpeta principal de proyectos* (ver :ref:`Definición de la carpeta principal de proyectos <setting_the_projectroot>` ).

source: Currently the statement above if not true, as by default presets are being saved in ``OpenToonz stuff\fxs\presets``. On Windows it can be changed to any other path by going to the registry and changing the ``System\HKEY_LOCAL_MACHINE\SOFTWARE\OpenToonz\OpenToonz\TOONZFXPRESETS`` key to the desired location.
es: Actualmente la afirmación de arriba no se cumple, ya que de forma predefinida los ajustes son almacenados en la carpeta ``OpenToonz stuff\fxs\presets``. En Windows esta ruta podrá ser cambiada por cualquier otra, mediante el editor del registro del sistema, cambiando la ruta asignada a la clave ``Equipo\HKEY_LOCAL_MACHINE\SOFTWARE\OpenToonz\OpenToonz\TOONZFXPRESETS``.

source: Once a preset is applied there is no link between the *saved preset* and the *applied preset*: the applied preset can be edited without affecting the saved one.
es: Una vez que un ajuste haya sido aplicado no existirá ningún vínculo entre el *ajuste guardado* y el *ajuste aplicado*: el ajuste aplicado podrá ser editado sin afectar al guardado.

source: When you save a preset with a name already used, a confirmation dialog will open, asking you whether you want to overwrite the previously saved preset.
es: Cuando se intente guardar un ajuste prestablecido con un nombre ya utilizado, emergerá un diálogo de confirmación consultando si se deberá sobrescribir el ya existente o no.

source: **To save a preset:**
es: **Para guardar un ajuste prestablecido:**

source: Right-click the effect node you want to save as a preset and choose **Save As Preset** from the menu that opens.
es: Hacer clic derecho sobre el nodo del efecto que contenga los parámetros que se desee guardar como un ajuste y elegir **Guardar como ajuste...** en el menú.

source: Assign a name to the preset and click the **Save** button.
es: Asignar un nombre al ajuste y hacer clic en el botón **Guardar**.

source: **To retrieve a saved preset:**
es: **Para cargar un ajuste guardado:**

source: Open the **FX Browser** and open the folder related to the effect for which you saved the preset.
es: Abrir el **Explorador de efectos** y abrir la carpeta relativa al efecto para el cual se hubiera guardado un ajuste.

source: In the right-click menus **Insert FX**, **Add FX** or **Replace FX**, choose the sub-menu related to the effect for which you saved the preset.
es: Hacer clic derecho y en los submenúes **Insertar efecto**, **Agregar efecto** o **Reemplazar efecto**, elegir el submenú correspondiente al efecto para el cual se hubiera guardado un ajuste.

source: **To remove a preset from the FX Browser:**
es: **Para eliminar un ajuste del Explorador de efectos:**

source: Right-click the preset in the FX Browser and choose **Remove Preset** from the menu that opens.
es: Hacer clic derecho sobre el ajuste prestablecido en el Explorador de efectos y elegir **Eliminar ajuste**.

source: Creating Macro FX
es: Creación de Macro efectos

source: Effects can be combined to create a *macro effect* that can be saved and retrieved when needed.
es: Será posible combinar varios efectos para crear un *macro efecto*, que podrá ser guardado y cargado cuando fuera necesario.

source: When a macro effect is defined, you can edit its settings either in the standard way with the FX Settings window that contains a tab for each effect combined to define the macro, or by opening it and editing one effect at a time.
es: Cuando se define un macro efecto, será posible editar sus opciones, tanto en la manera tradicional mediante el panel Opciones de efecto, que en ese caso contendrá una solapa por cada uno de los efectos que compongan al macro efecto, o abriendo el macro efecto para poder editar cada uno de los efectos de forma separada.

source: A macro effect can be opened also to check how the effect nodes are connected, and can be exploded to dissolve it and put its effect nodes back in the Schematic.
es: Un macro efecto también podrá ser abierto para revisar cómo se encuentran conectados los nodos de efecto entre sí, así como también podrá ser disuelto para colocar los efectos que lo componen de vuelva en la escena.

source: When saved, the macro effect will be available in the FX Browser and in the drop-down menus that open when right-clicking nodes or in the Schematic area, inside the **Macro** folder, at the bottom of the list.
es: Al ser guardado, un macro efecto quedará disponible en el Explorador de efectos y en el menú contextual emergente al hacer clic derecho sobre un nodo o en el Diagrama de efectos, dentro de la carpeta **Macro**, al final de la lista de efectos.

source: **To create a macro effect:**
es: **Para crear un macro efecto:**

source: Select the effect nodes you want to combine to create the macro effect.
es: Seleccionar los nodos de efecto que se desee combinar para crear el macro efecto.

source: Right-click the selection and select **Make Macro FX** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Crear un macro efecto** en el menú.

source: **To open a macro effect:**
es: **Para abrir un macro efecto:**

source: Right-click the macro node and choose **Open Macro FX** from the menu that opens: the macro nodes are displayed in a box, with the right links to the rest of the schematic.
es: Hacer clic derecho sobre el nodo de un macro efecto y elegir **Abrir macro efecto** en el menú: los nodos del macro efecto serán mostrados dentro de un marco rectangular, incluyendo los vínculos correspondientes con el resto de los nodos del Diagrama.

source: When the content of a macro is displayed *it is not* possible to edit the links between macro nodes and links with nodes outside the macro.
es: Cuando el contenido de un macro efecto sea mostrado *no será* posible editar los vínculos entre los propios nodos del macro efecto o de éstos con el exterior.

source: **To close a macro effect:**
es: **Para cerrar un macro efecto:**

source: Click the **Close** button on the right of the macro box bar.
es: Hacer clic en el botón **Cerrar** en la esquina superior derecha del marco del macro efecto.

source: **To release a macro effect:**
es: **Para disolver un macro efecto:**

source: Right-click the macro node and choose **Explode Macro FX** from the menu that opens.
es: Hacer clic derecho sobre el nodo de un macro efecto y elegir **Disolver macro efecto** en el menú.

source: **To edit a macro effect:**
es: **Para editar un macro efecto:**

source: Right-click the macro node and choose **Edit FX...** from the menu that opens.
es: Hacer clic derecho sobre el nodo de un macro efecto y elegir **Editar efecto...** en el menú.

source: Right-click the macro node and choose **Open Macro FX** from the menu that opens, then edit the macro effect nodes.
es: Hacer clic derecho sobre el nodo de un macro efecto y elegir **Abrir macro efecto** en el menú, luego editar los nodos que compongan el macro efecto.

source: **To save a macro effect:**
es: **Para guardar un macro efecto:**

source: Right click the macro effect node you want to save and choose **Save As Preset** from the menu that opens.
es: Hacer clic derecho sobre el nodo del macro efecto que se desee guardar y elegir **Guardar como ajuste...** en el menú.

source: Assign a name to the macro effect and click the **Save** button.
es: Asignar un nombre al macro efecto y hacer clic en el botón **Guardar**.

source: **To remove a macro effect from the FX Browser:**
es: **Para eliminar un macro efecto del Explorador de efectos:**

source: Right-click the macro effect in the FX Browser and choose **Remove Macro FX** from the menu that opens.
es: En el Explorador de efectos, hacer clic derecho sobre el macro efecto que se desee eliminar y elegir **Eliminar macro efecto** en el menú.

source: Effects List
es: Lista de efectos

source: Background
es: Background (Fondos)

source: Checkerboard
es: Checkerboard (Damero)

source: Creates a new column/layer containing a checkerboard defined by two Colors, and a grid Size.
es: Permite crear una nueva columna/capa con un damero, definido por los colores **Color 1** y **Color 2**, y el tamaño de la cuadrícula mediante el parámetro **Size** (Tamaño).

source: The grid size can also be set by using a square gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: El tamaño de la cuadrícula también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Color Card
es: Color Card (Placa de color)

source: Creates a new column/layer containing the set Color. It can be used, for example, as a background color or to create a colorize effect by applying it combined with a multiply effect.
es: Permite crear una nueva columna/capa con una placa sólida del Color elegido. Podrá ser usada, por ejemplo, como color de fondo o para crear un efecto de colorización aplicándola en combinación con un efecto de **Multiply** (Multiplicar) sobre otra columna/capa.

source: Kaleido
es: Kaleido (Caleidoscopio)

source: Repeats the Source generating a kaleidoscopic effect.
es: Permite repetir el contenido del nodo conectado a *Source*, generando un efecto caleidoscópico.

source: The center of the effect can be defined interactively, moving the small red cross widget in the preview area, or writing the desired values in the X and Y text fields.
es: Será posible posicionar interactivamente el centro del efecto, moviendo la pequeña cruz *roja* que aparece en el área de previsualización del panel Opciones de efecto, o también ingresando manualmente los valores X e Y en los campos del parámetro **Center** (Centro).

source: The angle of reflection, and the number of iterations can be set in the appropriate input text fields (Angle and Count).
es: El ángulo de reflexión y la cantidad de repeticiones podrán ser definidas controlando los parámetros **Angle** (Ángulo) y **Count** (Cantidad) respectivamente.

source: Tile
es: Tile (Mosaico)

source: Repeats the Source content in order to define a larger image: the Tile mode forms a pattern that completely fills the camera shot, the Tile Horizontally repeats the source content horizontally; the Tile Vertically repeats the source content vertically.
es: Permite repetir el contenido del nodo conectado a *Source* para crear una imagen de mayor tamaño: cuando el parámetro **Mode** (Modo) se encuentra en **Tile** (Mosaico) se formará un patrón de repeticiones que llenará completamente el encuadre de la cámara; **Tile Horizontally** (Mosaico horizontal) y **Tile Vertically** (Mosaico vertical) repetirán el contenido sólo horizontal o verticalmente.

source: The Mirror Horizontally and Mirror Vertically options repeat the tiles by flipping them respectively in the horizontal and vertical directions; If both the options are activated, tiles will be mirrored in both directions.
es: Las opciones **Mirror Horizontally** (Simetrizar horizontalmente) y **Mirror Vertically** (Simetrizar verticalmente) permiten que las repeticiones vayan simetrizando en el sentido horizontal o vertical. Si ambas estuvieran activadas, la simetrización ocurrirá en ambos sentidos.

source: The Margin value sets the size of a margin around each tile, with positive values adding some space around the tiles, and negative values collapsing them.
es: El parámetro **Margin** (Margen) permite definir un margen alrededor de cada repetición del mosaico, con valores positivos insertando espacio entre ellas y negativos permitiendo juntarlas.

source: Blur
es: Blur (Desenfoque)

source: Softens the Source content, creating an out of focus effect, according to a specific Intensity.
es: Permite desenfocar el contenido conectado a *Source*, creando un efecto de fuera de foco, de acuerdo a una intensidad elegida mediante el parámetro **Intensity**.

source: Directional Blur
es: Directional Blur (Desenfoque direccional)

source: Blurs the Source content according to a specific Intensity along a specific direction defined by the Angle.
es: Permite desenfocar el contenido conectado a *Source* de acuerdo a la intensidad definida por el valor **Intensity** (Intensidad), a lo largo de la dirección especificada por el parámetro **Angle** (Ángulo).

source: The Bidirectional option applies the blur also on the other side of the direction.
es: La opción **Bidirectional** (Bidireccional) permitirá aplicar el desenfoque también en la otra dirección.

source: The intensity and the angle can also be set by using an arrow gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: El tamaño de la cuadrícula también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: The directional blur does not depend on the movement and the speed of the column to which it is applied.
es: El desenfoque direccional no dependerá del movimiento y velocidad de la columna/capa a la cual fuera aplicado.

source: Local Blur
es: Local Blur (Desenfoque local)

source: Blurs the Source content according to the brightness value of the node content connected to the Reference input handle. The Intensity value amplifies uniformly the blur given by the Reference node content.
es: Permite desenfocar el contenido conectado a *Source*, de acuerdo al valor de brillo del contenido conectado a *Reference*. El valor **Intensity** (Intensidad) amplificará uniformemente el desenfoque definido por el contenido conectado a *Reference*.

source: Motion Blur
es: Motion Blur (Desenfoque por movimiento)

source: Creates a motion-blur effect, according to the movement of the Source content in the previous and current frame. The movement has to be defined by an animated column, pegbar or table: the higher the speed, the more visible the effect.
es: Crea un efecto de desenfoque por movimiento, de acuerdo al movimiento del contenido conectado a *Source* en los fotogramas anterior y siguiente. El movimiento deberá estar definido por una columna/capa, barra de sujeción o la mesa: cuanto más alta la velocidad, más notable será el efecto.

source: If the movement is constant between consecutive frames, you can increase or decrease the Intensity to have a more or less visible effect. If there is no movement between the previous and the current frame, no motion blur will be visible even though you may have set a high Intensity.
es: En caso de que el movimiento fuera constante entre dos fotogramas consecutivos, será posible aumentar o disminuir el parámetro **Intensity** (Intensidad) para hacerlo más o menos visible. Si no existiera movimiento entre los fotogramas anterior y siguiente, el efecto no provocará ningún desenfoque, aunque la intensidad fuera alta.
