Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: es

source: Turns the Source content in a series of tiles according to the specified Size and Distance. The color and transparency of the tiles are sampled from the source content.
es: Permite convertir el contenido conectado a *Source* en un mosaico dividido de acuerdo a los parámetros **Size** (Tamaño) y **Distance** (Distancia). El color y transparencia de las celdas del mosaico será tomado directamente del contenido original.

source: A Background Color can be set, and will be visible around the tiles. The tile shape can be chosen between Square and Round.
es: Será posible definir un color de fondo, mediante el parámetro **BG Color**, que podrá ser visible entre las celdas del mosaico. El parámetro **Shape** (Forma) permitirá definir la forma de las celdas del mosaico.

source: Posterize
es: Posterize (Posterizar)

source: Converts the Source content into a number of shades according to the set number of Levels. The shades depends on the brightness values of the source content and the levels are intended for each channel; for example, two levels produces six colors: two for the red, two for the green, and two for the blue.
es: Permite convertir el contenido conectado a *Source* en una cierta cantidad de tonos, de acuerdo a lo especificado en el parámetro **Levels** (Niveles). Los niveles dependerán de los valores de luminosidad del contenido original y su número se especifica como un número entero para cada uno de los canales de color; por ejemplo, dos niveles producirá seis colores: dos para el rojo, dos para el verde y dos para el azul.

source: Solarize
es: Solarize (Solarizar)

source: Blends a negative and a positive version of the Source content, as if exposing a photographic print briefly to light during development. You can set the Intensity of the effect and control the Peak Edge, that is the amount of positive and negative image that is used in the blend.
es: Permite fundir una versión positiva y una negativa del contenido conectado a *Source*, como si se expusiera un negativo fotográfico brevemente a la luz, durante el proceso de revelado. Será posible definir la intensidad mediante el parámetro **Intensity**, así como controlar con el parámetro **Peak Edge** (Borde tope) la cantidad de imagen positiva y negativa usada en la mezcla.

source: Toonz Level
es: Toonz Level (Niveles Toonz)

source: Toonz Level type of effects can be applied only to Toonz Vector and Toonz Raster (PLI and TLV files). They usually affect the drawings they are applied to according to Style indexes. Style indexes can be retrieved in the Palette after the # symbol in the Style tooltip, or in the *bottom right corner* of the style in any of the **Thumbnails View** modes.
es: Los efectos de tipo **Toonz Level (Nivel de Toonz)** podrán ser aplicados únicamente a niveles de tipo Vectorial de Toonz (PLI) y de Imagen de Toonz (TLV). Usualmente afectan a los dibujos a los cuales son aplicados, de acuerdo al índice de sus Estilos. Los índices de sus estilos podrán ser consultados en el editor de Paleta, a la derecha del símbolo # en la descripción del Estilo, o en la *esquina inferior derecha* del estilo, en cualquiera de los modos de **Vistas de miniaturas**.

source: Index numbers can be specified in the related text field, separated by a comma. To define a range of indexes, you should type the first and last separated by a dash (e.g. 4-7 will refer to indexes 4, 5, 6 and 7). To select all indexes, type ``all`` ; to select no index, type ``none`` .
es: Los números de los índices podrán ser especificados en el campo numérico correspondiente, separados por una coma. Para definir un rango de índices, se deberá ingresar el primero y último, separado por un guion (p.ej: 4-7 se referirá a los índices 4, 5, 6 y 7). Para seleccionar todos los índices, ingresar ``all`` ; para no seleccionar ninguno, ingresar ``none`` .

source: Toonz Level type of effects have to be always applied first when a series of effects are applied to an animation level, as they work only on Toonz Vector or Toonz Raster levels that have not been transformed by other type of effects. However two or more Toonz Level type of effects can be applied to the same animation level.
es: Los efectos de tipo Toonz Level siempre deberán ser aplicados en primer lugar, cuando además haya aplicados otros efectos en un nivel de animación, debido a que funcionarán únicamente con niveles Vectorial de Toonz o Imagen de Toonz que no hayan sido transformados previamente por otros tipos de efectos. Sin embargo, sí será posible aplicar dos o más efectos de tipo Toonz Level al mismo nivel de animación.

source: Art Contour
es: Art Contour (Contorno artístico)

source: Creates in the Source content a pattern, by repeating the Controller node content, along lines painted with styles whose indexes are specified in the Color Indexes text field. It can be used for example to create scattered brush, or hair and fur effects along drawing lines.
es: Creará, en el contenido del nodo conectado a *Source*, un patrón repitiendo el contenido del nodo conectado a *Controller*, a lo largo de las líneas pintadas con los índices de los estilos especificados en el campo **Color Indexes**. Podrá ser usado, por ejemplo, para crear un pincel disperso o efectos de pelos a lo largo de las líneas de un dibujo.

source: The Keep Color option assigns the color of the line to the applied pattern; while the Keep Contour option retains the drawing line that will be visible beneath the pattern.
es: **Keep Color** (Mantener color) permite asignar el color original de la línea al patrón aplicado; mientras que **Keep Contour** (Mantener contornos) permitirá mantener la línea original del dibujo por debajo del patrón.

source: The way the contents of the Controller node create the pattern depends on the Pattern settings.
es: La forma en que el contenido del nodo conectado a *Controller* creará el patrón, dependerá de las opciones de la sección **Pattern** (Patrón).

source: The Density sets the amount of pattern to be applied along the line. By setting the Density to 0, you can specify a Minimum and Maximum Distance between two subsequent images applied as pattern on the line.
es: **Density** (Densidad) permite definir la densidad del patrón a ser aplicado a lo largo de la línea. Cuando la densidad sea 0, será posible especificar con la opción **Distance** (Distancia) una distancia mínima y máxima entre las imágenes del patrón.

source: The Size sets the Minimum and Maximum resizing percentage applied to the images used as the pattern; the value 100 is the original size of the images.
es: **Size** (Tamaño) permite definir los valores mínimo y máximo de tamaño aplicado a las imágenes usadas como patrón; 100 representará al valor original de las imágenes.

source: The Orientation sets the Minimum and Maximum rotation angle for the images used as the pattern, according to the line direction; the value 0 display the images perpendicular to the line direction. If the Absolute Orientation option is used, the orientation values do not depend on the direction of the lines: the value 0 is the original images orientation.
es: **Orientation** (Orientación) permite definir el ángulo de rotación mínimo y máximo para las imágenes usadas como patrón, de acuerdo a la dirección de la línea; el valor 0 mostrará las imágenes de forma perpendicular a la dirección de la línea. Si la opción **Absolute Orientation** (Orientación absoluta) fuera activada, los valores de orientación no dependerán de la dirección de la línea: en ese caso el valor 0 representará la orientación original de las imágenes.

source: Calligraphic Line
es: Calligraphic Line (Línea caligráfica)

source: Changes in the Source content the thickness of the drawing lines painted with styles whose indexes are specified in the Color Indexes text field.
es: Permite cambiar, en el contenido del nodo conectado a *Source*, el grosor de las líneas que usen los estilos cuyos índices se especifiquen en el campo **Color Indexes**.

source: You can specify the Thickness increase and how it is applied, as a percentage, to the different line directions Horizontal, Vertical, Up Diagonal, Down Diagonal.
es: Será posible especificar un aumento del grosor mediante el parámetro **Thickness** (Grosor), y cómo éste será aplicado, en forma de porcentaje, a las distintas direcciones de las líneas: **Horizontal**, **Vertical**, **Up Diagonal** (Diagonal ascendente), **Down Diagonal** (Diagonal descendente).

source: The Smoothness sets the smoothness of the passage between sections of the lines affected by the effect, and those not affected; while the Noise sets the regularity of the edge of the line.
es: **Smoothness** (Suavidad) permite definir la suavidad de la transición entre las distintas secciones de línea modificadas por el efecto y aquellas que no lo sean; mientras que **Noise** (Ruido) permite definir la regularidad del borde de la línea.

source: Color Blending
es: Color Blending (Fundir color)

source: Blends in the Source content lines and areas painted with styles whose indexes are specified in the Color Indexes text field. It can be used for example to blend shadow and highlight areas with the plain colored area, or to create gradients of colors.
es: Permite fundir las líneas y áreas, del contenido del nodo conectado a *Source*, pintadas con estilos cuyos índices se hayan especificado en el campo **Color Indexes**. Podrá ser usado, por ejemplo, para fundir las áreas de sombras e iluminaciones con el área de color normal de un dibujo, o simplemente para crear gradientes de colores.

source: The Intensity sets how wide the blended area between the selected colors will be; while the Smoothness sets how smooth the dithering between blended colors is.
es: **Intensity** (Intensidad) permite definir qué tan ancha será el área entre los colores seleccionados; mientras que **Smoothness* (Suavizado) permite definir qué tan suave será el difuminado entre los colores fundidos.

source: The No Blending over Other Colors option stops the blending as soon as a line, or an area, whose index is not included in the selection, is detected; if deactivated, the blending between selected colors continues under excluded lines and areas.
es: Cuando la opción **No Blending over Other Colors** (No fundir a través de otros colores) se encuentre activa se detendrá el fundido cuando se detecte una línea o área cuyo índice no esté incluido en la selección; en caso contrario, la fusión continuará a través de líneas y áreas cuyos índices no estén incluidos en la selección realizada en el campo **Color Indexes**.

source: External Palette
es: External Palette (Paleta externa)

source: Applies to the Source content the palette node connected to the Palette input port; if a column node is connected to the Palette input port, the palette related to its content will be considered.
es: Permite aplicar al contenido del nodo conectado a *Source*, la paleta del nodo conectado a *Palette*; si se conectara el nodo de una columna, la paleta de su contenido será usada.

source: The original styles of the Toonz levels contained in the source node are replaced with those of the levels contained in the palette node according to their style indexes.
es: Los estilos originales de los niveles Toonz contenidos en el nodo conectado a *Source*, serán reemplazados con aquellos de los niveles contenidos en el nodo de paleta, de acuerdo a sus números de índice respectivos.

source: Outline
es: Outline (Contorno exterior)

source: Changes in the Source content the thickness of the drawing external outline.
es: Permite cambiar el grosor del contorno exterior del contenido del nodo conectado a *Source*.

source: The Smoothness sets the smoothness of the passage between sections of the lines affected by the effect, and those not affected; while the Noise sets the regularity of the edge of the outline.
es: **Smoothness** (Suavidad) permite definir la suavidad del pasaje entre las secciones de las líneas afectadas por el efecto y aquellas que no se encuentren afectadas; mientras que **Noise** (Ruido) permite definir la regularidad del borde del contorno.

source: Palette Filter
es: Palette Filter (Filtrar por paleta)

source: Filters the styles of the Source content palette according to the indexes specified in the Color Indexes text field.
es: Permite filtrar el contenido de la paleta del nodo conectado a *Source*, de acuerdo a los números de índice especificados en el campo **Color Indexes**.

source: The Apply To option menu lets you choose if you want to affect Lines & Area, only Lines or only Areas, even if painted with the same styles; the Action option menu lets you choose if you want to keep or remove the specified styles.
es: **Apply To** (Aplicar a) permite escoger si se desea afectar **Lines and Areas** (líneas y áreas), **Lines** (sólo líneas) o **Areas** (sólo áreas), aunque estuvieran pintadas con los mismos estilos; **Action** (Acción) permite escoger si se desea mantener (**Keep**) o eliminar (**Delete**) los estilos especificados en el campo **Color Indexes**.

source: Pinned Texture
es: Pinned Texture (Textura fija)

source: Distorts the Texture node content and applies it to the Source content areas that are painted with styles whose indexes are specified in the Color Indexes text field.
es: Permite distorsionar el contenido del nodo conectado a *Texture* y aplicarlo a las áreas del contenido del nodo conectado a *Source*, pintadas con los estilos cuyos índices se especifiquen en el campo **Color Indexes**.

source: The distortion can be done like in the Free Distort effect (see :ref:`Free Distort <free_distort>` ) and the texture can be applied like in the Texture effect (see below).
es: La distorsión puede ser producida de igual modo que en el efecto **Free Distort** (ver :ref:`Free Distort (Distorsión libre) <free_distort>` ) y la textura se aplicará de igual modo que al usar el efecto **Texture** (ver más abajo).

source: Texture
es: Texture (Textura)

source: Applies the Texture node content to the Source content lines and areas that are painted with styles whose indexes are specified in the Color Indexes text field.
es: Permite aplicar el contenido del nodo conectado a *Texture* a las líneas y áreas del contenido del nodo conectado a *Source*, pintadas con los estilos especificados en el campo **Color Indexes**.

source: As the texture node content can be animated as you like, this effect allows you to generate animated texture as well.
es: Dado que el contenido del nodo conectado a *Texture* podrá ser animado como se desee, este efecto también permitirá generar texturas animadas.

source: The Action option menu lets you choose if you want to apply the texture to the specified styles (Keep) or to apply it to all styles except for the specified ones (Delete).
es: La opción **Action** (Acción) permite elegir lo siguiente: (**Keep**) aplicar la textura a los estilos especificados; (**Delete**) aplicar la textura a todos los estilos, salvo los especificados.

source: The Mode option menu lets you set how the texture node content will be applied: Texture uses the texture to replace selected styles; Pattern preserves the original colors but varies them according to the texture brightness; Add, Subtract, Multiply, Lighten and Darken defines the way the texture is applied to the original colors (see :ref:`Layer Blending <layer_blending>` ). In case the Add, Subtract or Multiply mode are selected, you can also set the Value of the effect.
es: **Mode** (Modo) permite definir cómo será aplicado el contenido del nodo de la textura: **Texture** (Textura) usará la textura para reemplazar a los estilos seleccionados; **Pattern** (Patrón) conservará los colores originales, pero variará su luminosidad de acuerdo a la luminosidad de la textura; **Add** (Sumar), **Subtract** (Sustraer), **Multiply** (Multiplicar), **Lighten** (Aclarar) y **Darken** (Oscurecer) definirán cómo se aplicará la textura sobre los colores originales (ver :ref:`Layer Blending (Mezcla de capas)<layer_blending>` ). En caso de que los modos Add, Subtract o Multiply estuvieran seleccionados, también será posible definir el parámetro **Value** (Valor) de dichos efectos.

source: To repeat the texture image and tile it to create a larger texture, you can apply the Tile effect to the texture column before linking it to the Texture node (see :ref:`Tile <tile>` ).
es: Para repetir la imagen de textura y hacer un mosaico con ella (para crear así una textura más grande), será posible aplicar el efecto **Tile** a la columna de la textura, *antes de conectarla* al nodo del efecto Texture (ver :ref:`Tile (Mosaico) <tile>` ).

source: Shaders
es: Shaders (Sombreadores)

source: OpenToonz enables support for effects rendered through hardware-accelereted pixelshaders. Shaders are simple programs compiled by a graphics processing unit that harness the massively parallel architecture of modern graphics devices, to execute with extreme speed. OpenToonz's shader effects are written in the OpenGL Shading Language (GLSL), and are located in ``OpenToonz stuff/library/shaders``. Refer to the readme.txt file there for further details on editing or creating new shader effects.
es: OpenToonz tiene soporte para el procesamiento de efectos acelerados por hardware. Estos sombreadores son pequeños programas compilados para una unidad de procesamiento gráfico (GPU) que permiten sacar provecho de arquitecturas de un muy alto nivel de paralelismo como las de las placas gráficas modernas, para ejecutarlos con extrema rapidez. Los efectos de sombreado de OpenToonz se encuentran escritos en el lenguaje OpenGL Shading Language (GLSL), y se encuentran ubicados en la carpeta ``OpenToonz stuff/library/shaders`` . Consultar el archivo ``readme.txt`` ubicado allí para obtener más detalles (en inglés) acerca de cómo editar o crear nuevos efectos de sombreado.

source: Caustic
es: Caustic (Cáusticas)

source: Creates a new column/layer containing a simulation of the reflection of light on a water surface. Sets the color of the water defining the RGBA values of the Water Color parameter.
es: Crea en la columna/capa seleccionada una simulación de reflexión de luz sobre la superficie del agua. Permite definir el color del agua, mediante los valores RVAα del parámetro **Water Color** (Color del agua).

source: Fireball
es: Fireball (Bola de fuego)

source: Creates a new column/layer containing a ball of flames erupting from a point.
es: Permite crear en la columna/capa seleccionada una bola de fuego, haciendo erupción desde un punto.

source: A range of colors can be defined setting the RGBA values of color 1 and color 2. The stage of the displacement map image can be controlled by using the Evolution value; by setting the variation of this value between two keys, you set how much the displacement map image changes during the animation.
es: Es posible definir un rango de colores mediante los valores RVAα de los parámetros **Color 1** y **Color 2**. Se podrá controlar el estado de evolución de la imagen del mapa de desplazamiento mediante el parámetro **Evolution** (Evolución); definiendo la variación de este valor entre dos fotogramas clave, será posible definir qué tanto cambiará la imagen del mapa de desplazamiento durante el transcurso de la animación.

source: Glitter
es: Glitter (Destellos)

source: Adds cross-shaped light rays extending from the brightest part of an image.
es: Permite incorporar rayos de luz en forma de cruz, a partir de las áreas más brillantes de la imagen.

source: Use Threshold to specify the cut-out on the input image's brightest part. Higher values will make the fx add lights also to darker image parts, producing more lights. The Brightness specifies the brightness of added light rays; the Radius specify how much the light rays will extend from bright input pixels; the Angle specify the angle of light crosses. A value 0 means that produced light crosses will be axis-aligned. Halo is the amount of light disperion orthogonal to the direction of light rays. Higher values will produce broader rays.
es: **Threshold** (Umbral) permite especificar el valor de corte superior en el brillo de la imagen original. Valores más altos harán que se agregue brillo a las partes más oscuras de la imagen. **Britness** (Brillo) permite especificar el brillo de los rayos de luz superpuestos; **Radius** (Radio) permite especificar qué tanto se extenderán los rayos de luz a partir de los píxeles brillantes originales; **Angle** (Ángulo) permite especificar el ángulo de las cruces de luz. Un valor de 0 significará que las cruces de luz generadas estarán alineadas a los ejes principales. **Halo** es la cantidad de dispersión de luz perpendicular a los rayos de luz. Valores mayores producirán rayos más anchos.

source: Star Sky
es: Star Sky (Cielo de estrellas)

source: Creates a new column/layer containing a simple star field with variable brightness with overlayed clouds. Sets the color of the overlayed clouds defining the RGBA values of the Cloud Color parameter.
es: Permite crear una nueva columna/capa con un cielo estrellado sencillo, con brillo variable y nubes superpuestas. **Cloud Color** (Color de las nubes) permite definir el color de las nubes a través de sus valores RVAα.

source: The stage of the stars displacement can be controlled by using the Evolution value; by setting the variation of this value between two keys, you set how much the displacement map image changes during the animation.
es: Es posible controlar el estado del desplazamiento de las nubes mediante el parámetro **Evolution** (Evolución); definiendo la variación de este valor entre dos fotogramas clave, se podrá controlar el cambio del mapa de desplazamiento durante el transcurso de la animación.

source: Use the Brightness parameters to define the brightness of the stars.
es: Usar el parámetro **Brightness** (Brillo) para definir el brillo de las estrellas.

source: Sun Flare
es: Sun Flare (Resplandor solar)

source: Creates a new column/layer containing rays of colored light extending from a radial gradient at the center. Sets the color of the sun rays defining the RGBA values of the Color parameter. The number of rays is defined by the Rays parameter while their brightness is set by the Intensity one. The angle parameter sets the direction of the rays and the Bias parameter define the size of the rays. Use the Sharpness parameter to make the rays sharper or smoother.
es: Permite crear una nueva columna/capa con rayos de luz de color que se extenderán desde un gradiente radial en su centro. Será posible definir el color de los rayos solares por medio de los valores RVAα del parámetro **Color**. La cantidad de rayos estará definida por el parámetro **Rays** (Rayos), mientras que su brillo estará definido por el parámetro **Intensity** (Intensidad). **Angle** (Ángulo) permitirá definir la dirección de los rayos y **Bias** (Desviación) el tamaño de los mismos. El parámetro **Sharpness** (Nitidez) podrá ser usado para hacer que los rayos luzcan más definidos o suaves.

source: Wavy
es: Wavy (Ondulado)
