Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: es

source: Applying Effects
es: Aplicación de efectos

source: Effects can be applied to animation levels, images and clips exposed in Xsheet columns (or Timeline layers) in the **FX Schematic**, where each element is represented as a node.
es: Es posible aplicar efectos a los niveles de animación, imágenes y clips de video expuestos en las columnas de la Planilla (o capas de la Línea de tiempo), mediante el uso del **Diagrama de efectos**, donde cada elemento será representado como un nodo.

source: The relationship between the contents of columns/layers and effects can be managed by connecting or disconnecting links between nodes.
es: La relación entre el contenido de las columnas/capas y los efectos podrá ser administrado mediante la conexión o desconexión entre los respectivos nodos.

source: Using the FX Schematic
es: Uso del Diagrama de efectos

source: In the FX schematic all columns/layers are displayed as nodes having an output port connected to the Xsheet node: this means that their content is part of the scene and is rendered as it is.
es: En el Diagrama de efectos todas las columnas/capas serán mostradas como nodos conectados a un nodo de **Salida**, conectado a su vez al nodo de la **Planilla**: esto significa que su contenido será parte de la escena y será parte del procesamiento final, según este diagrama.

source: When effects are added, they are displayed as nodes as well, with ports to create links that let you set the way the effect modify the scene contents.
es: Cuando se agreguen efectos, éstos se mostrarán como nodos, con conectores para crear vínculos que ayuden a definir la manera en que el efecto afectará al contenido de la escena.

source: Column/layer nodes have the **Camera Stand** (|camera_stand|) and the **Render** (|preview|) toggles on the top right: these toggles are the same as the toggles available in the Xsheet column (or Timeline layer) headers (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>` ). Effects nodes only have the **Render** toggle (|preview|) allowing you to include or exclude temporarily the effect in the rendering.
es: Los nodos de columnas/capas contendrán los interruptores **Visibilidad en mesa de trabajo** (|camera_stand|) y **Visibilidad durante el procesamiento** (|preview|) en su esquina superior derecha: estos interruptores estarán vinculados a los presentes en los encabezados de las columnas de la Planilla (o capas de la Línea de tiempo) (ver :ref:`Trabajo con columnas/capas <working_with_xsheet_columns>` ). Los nodos de los efectos sólo contendrán el interruptor de **Visibilidad durante el procesamiento** (|preview|), que permitirá excluir temporalmente sus efectos del procesamiento de la escena.

source: Nodes can be easily selected and arranged. When selected, nodes are highlighted in *white*; the *current* node has its label in *yellow*.
es: Los nodos podrán ser fácilmente seleccionados o deseleccionados. Los nodos seleccionados, serán resaltados en *blanco*; el nodo *activo* mostrará su nombre en *amarillo*.

source: **To access the FX Schematic:**
es: **Para acceder al Diagrama de efectos:**

source: Click the Schematic toggle button (|schematic|) at the right of the bottom bar of the Schematic window until the title bar displays **FX Schematic**.
es: Hacer clic en el botón **Diagrama de efectos/escenario** (|schematic|) en la esquina inferior derecha del panel Diagrama, hasta que en la barra de título del panel se lea **Diagrama de efectos**.

source: **To navigate the FX Schematic:**
es: **Para navegar en el Diagrama de efectos:**

source: Do one of the following:
es: Realizar una de las siguientes acciones:

source: Use the mouse wheel, or the zoom shortcut keys (by default **+** and **-** keys) to zoom in and zoom out.
es: Usar la rueda del ratón o los atajos (de forma predefinida las teclas **+** y **-**) para usar el zoom.

source: Middle-click and drag to scroll in any direction.
es: Hacer clic central y arrastrar para desplazar la vista en cualquier dirección.

source: Use the **Fit to Window** button (|fit_to_window|) in the bottom bar of the Schematic window to display all of the nodes in the current window.
es: Usar el botón **Ajustar a ventana** (|fit_to_window|) en la esquina inferior izquierda del Diagrama, para mostrar todos los objetos en la ventana.

source: Use the **Focus on Current** button (|focus_on_current|) in the bottom bar of the Schematic window to center the Schematic on the current node.
es: Usar el botón **Enfocar en nodo actual** (|focus_on_current|) en la esquina inferior izquierda del Diagrama, para centrar la vista en el nodo actual.

source: Use the **Reorder Nodes** button (|reorder_nodes|) in the bottom bar of the Schematic window to reorder all the nodes.
es: Usar el botón **Reordenar nodos** (|reorder_nodes|) en la esquina inferior izquierda del Diagrama, para reorganizar automáticamente los nodos en el Diagrama.

source: Use the **Reset Size** button (|reset|) in the bottom bar of the Schematic window, or use the **Reset View** shortcut (by default the **Alt + 0** key) to display all of the nodes at the default size.
es: Usar el botón **Restablecer tamaño** (|reset|) en la esquina inferior izquierda del Diagrama (o su atajo predefinido **Alt + 0**), para visualizar todos los nodos a su tamaño predefinido.

source: **To rename a node:**
es: **Para renombrar un nodo:**

source: Ctrl + double-click the node name and type a new name.
es: Hacer Ctrl + doble clic sobre el nombre del nodo que se desee renombrar.

source: **To minimize or maximize the column/layer and effect nodes:**
es: **Para minimizar o maximizar los nodos de una columna/capa o un efecto:**

source: Click the arrowhead to the left of the node name to minimize/maximize columns selectively.
es: Hacer clic sobre el botón con forma de flecha, en la esquina superior izquierda del nodo, para minimizarlo o maximizarlo selectivamente.

source: Click the **Minimize/Maximize** (|minimize|/|maximize|) button in the bottom bar of the Schematic window to minimize/maximize all the column nodes.
es: Hacer clic en el botón **Maximizar nodos** (|maximize|) en la esquina inferior izquierda del Diagrama, para maximizar/minimizar todos los nodos.

source: **To select nodes:**
es: **Para seleccionar nodos:**

source: Click to select a node.
es: Hacer clic en un nodo para seleccionarlo.

source: Click and drag to select a group of nodes.
es: Hacer clic y arrastrar para seleccionar un grupo de nodos.

source: Ctrl-click (PC) or Cmd-click (macOS) to add a node to, or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o quitar un nodo de la selección.

source: *Links* can be selected together with nodes (see :ref:`Editing the FX Schematic <editing_the_fx_schematic>` ).
es: Es posible seleccionar líneas de vínculo conjuntamente con nodos (ver :ref:`Edición del diagrama de efectos <editing_the_fx_schematic>` ).

source: **To move the selection:**
es: **Para mover los nodos de una selección:**

source: Click and drag any node of the selection.
es: Hacer clic y arrastrar cualquier nodo de la selección.

source: **To include or exclude temporally an effect from the rendering:**
es: **Para excluir (o volver a incluir) un nodo temporalmente del procesamiento:**

source: Click the **Render** toggle (|preview|) on the upper right corner of the effect node.
es: Hacer clic en el botón **Visibilidad durante el procesamiento** (|preview|) en la esquina superior derecha del nodo de efecto.

source: Grouping Nodes
es: Agrupación de nodos

source: It's possible to group several nodes into one single node, in order to better manage the whole FX Schematic. Groups can be opened to be examined and edited, and its components can be selected for further operations, like editing effect settings, or creating new groups.
es: Es posible agrupar varios nodos para conformar un único nodo, con el propósito de administrar más eficientemente el Diagrama de efectos. Los grupos podrán ser abiertos para ser examinados y editados, y sus componentes podrán ser seleccionados para posteriores operaciones, como la edición de las opciones de los efectos o la creación de nuevos grupos.

source: **To Group selected nodes:**
es: **Para Agrupar los nodos seleccionados:**

source: Right-click any selected node and choose **Group** from the menu that opens.
es: Hacer clic derecho sobre uno de los nodos seleccionados y elegir **Agrupar** en el menú.

source: Press the **Ctrl-G** (PC) or **Cmd-G** (macOS) shortcut.
es: Presionar los atajos **Ctrl-G** (PC) o **Cmd-G** (macOS).

source: **To open a Group:**
es: **Para abrir un Grupo:**

source: Right-click the group and choose **Open Group** from the menu that opens: the group nodes are displayed in a box, showing links between group nodes, and links with nodes outside of the group.
es: Hacer clic derecho sobre el grupo y elegir la opción **Abrir grupo** en el menú: el grupo de nodos será mostrará dentro de un marco, pudiendo verse tanto los vínculos entre los nodos del grupo, como los vínculos con nodos externos al mismo.

source: In the FX Schematic, when the content of a group is displayed, it's possible to edit the links between Group nodes and links with nodes outside of the group.
es: En el Diagrama, mientras se esté visualizando el contenido de un grupo, no será posible editar los vínculos entre los nodos del grupo, ni los vínculos con otros nodos, externos al mismo.

source: **To close a Group:**
es: **Para cerrar un Grupo:**

source: Click the **Close** button on the right of the group box title bar.
es: Hacer clic sobre el botón de **Cerrar grupo** en la esquina superior derecha del marco del grupo.

source: **To release a Group:**
es: **Para disolver un Grupo:**

source: Right-click the Group and choose **Ungroup** from the menu that opens, or press the shortcut **Ctrl-Shift-G** (PC) or **Cmd-Shift-G** (macOS).
es: Hacer clic derecho sobre el nodo del grupo y elegir **Desagrupar** en el menú o presionar el atajo **Ctrl-Shift-G** (PC) o **Cmd-Shift-G** (macOS).

source: Inserting Effects
es: Inserción de efectos

source: You can **Insert** effects to selected nodes, **Add** effects to the Schematic, or **Replace** previously added effect nodes. This can be done from the **FX Browser** window or by using the drop-down menu that opens when right-clicking nodes or an empty area of the FX Schematic. Both are organized in folders/submenus containing sets of effects; if some *Presets* are defined for an effect, an additional folder/submenu is available (see :ref:`Creating Presets <creating_presets>` ).
es: Es posible **Insertar** nodos de efectos, **Agregar** efectos al Diagrama de efectos, o **Reemplazar** nodos de efectos previamente agregados. Esto podrá ser realizado desde la ventana del **Explorador de efectos** o usando el menú contextual emergente al hacer clic derecho sobre los nodos o un área vacía del Diagrama de efectos. En ambos casos se desplegará una lista organizada en carpetas/submenúes conteniendo conjuntos de efectos relacionados; en caso de haber sido definidos *Ajustes prestablecidos* para un efecto, se desplegará una carpeta/sebmenú adicional con el mismo nombre de dicho efecto, conteniéndolos (ver :ref:`Creación de ajustes prestablecidos <creating_presets>` ).

source: |FX_Browser|
es: |FX_Browser_es|

source: When *inserting* effects, they will be placed along the link that starts from the selected node output port; when *adding* effects, they will be placed at the end of a new link that will start from the selected node output port.
es: Al *insertar* efectos, éstos serán ubicados a lo largo del vínculo que comienza en el conector de salida del nodo seleccionado; al *agregar* efectos, éstos serán ubicados al final de un nuevo vínculo que comenzará en el conector de salida del nodo seleccionado.

source: In case several nodes are selected, the effect will be added/inserted for *each* selected node, but all the added/inserted effects will be *Linked*, and connected visually by a *green* line. This means that every time the effect is edited, all the linked nodes will be edited as well, unless you break the link to start editing them separately.
es: En caso de que hubiera varios nodos seleccionados, el efecto será agregado/insertado en *cada uno* de los nodos seleccionados, y todos los efectos agregados/insertados estarán *Vinculados* y conectados entre sí por medio de una línea de color *verde*. Esto significará que cada vez que un efecto sea editado, todos los nodos vinculados al mismo cambiarán también, a menos que se decida deshacer el vínculo para comenzar a editarlos de forma independiente.

source: To globally apply effects it's possible to use the **Xsheet** node as if it were a standard column node (representing the whole content of the scene) and inserting effects from there.
es: Para aplicar efectos de forma global también será posible usar el nodo **Planilla* como si se tratara del nodo de una columna/capa (pero representando a todo el contenido de la escena) e insertar efectos a partir de allí.

source: Three different types of effects can be used in the Schematic, each with a different type of node:
es: Es posible usar tres tipos distintos de efectos en el Diagrama, cada uno de ellos utilizará una variedad distinta de nodo:

source: **Basic effects**, such as the Blur effect, that simply modify the contents of a column; they are displayed as a yellow node with an input port on the left, labelled *Source*, and an output port on the right.
es: **Efectos básicos**, como el efecto Blur, que permiten modificar el contenido de una columna/capa; se presentarán como nodos de color *amarillo* con un conector de entrada a la izquierda, etiquetado como *Source*, y un conector de salida del lado izquierdo.

source: |Basic_FX_Example|
es: |Basic_FX_Example_es|

source: To affect a column/layer, they have to be inserted in the link from the column/layer node to the Xsheet node, so that the column/layer node is connected to the effect input port, and the effect node output port is connected to the Xsheet node.
es: Para afectar a una columna/capa, deberán ser insertados en el vínculo que une a dicho nodo con el nodo de la Planilla, de manera que el nodo de la columna/capa quede conectado al conector de entrada del efecto y el conector de salida del efecto quede conectado al nodo de la Planilla.

source: If several effects are applied in a chain, they will be applied one after the other, following the order from the column/layer node to the Xsheet node.
es: En caso de que se hubieran aplicado varios efectos encadena, serán aplicados uno después del otro, siguiendo el orden desde el nodo de la columna/capa hacia el de la Planilla.

source: **Combined effects**, such as the Matte In effect, that modify the column/layer contents according to the contents other columns/layers; they are displayed with a yellow node with two or more input ports on the left, and one output port on the right.
es: **Efectos combinados**, como el efecto Matte In, que permiten modificar el contenido de una columna/capa de acuerdo al contenido de otras columnas/capas; se presentarán como nodos de color *amarillo* con dos o más conectores de entrada a la izquierda y un conector de salida del lado izquierdo.

source: To affect a column/layer, they have to be inserted into the link from the column/layer node to the Xsheet node, so that the column/layer node is connected to the first effect input port labelled *Source*, while the other columns/layers are connected to the other input ports, whose labels depend on the effect; the effect node output port has to be connected to the Xsheet node.
es: Para afectar a una columna/capa, deberán ser insertados en el vínculo que une a dicho nodo con el nodo de la Planilla, de manera que el nodo de la columna/capa quede conectado al conector de entrada *Source* del efecto, a la vez que otras columnas/capas estarán conectadas a los otros conectores de entrada, cuyos nombres dependerán de cada efecto; el conector de salida del efecto deberá estar conectado al nodo de la Planilla.

source: |Combined_FX_Example|
es: |Combined_FX_Example_es|

source: For example in case of a Matte In effect, the column to be matted has to be linked to the *Source* input port, the matte column has to be linked to the *Matte* input port, and the output port has to be connected to the Xsheet node.
es: Por ejemplo, en el caso del efecto Matte In, la columna/capa a la que se le controlará su opacidad deberá estar conectada al conector de entrada *Source*, la columna que contenga la información de opacidad deberá estar conectada al puerto de entrada llamado *Matte*, y el conector de salida del efecto deberá estar conectado al nodo de la Planilla.

source: **Effects that create computer generated images**, such as the Radial Gradient, that are exposed in Xsheet columns (and Timeline layers) and therefore are similar to columns; they are displayed with an orange node with only an output port on the right. These effect nodes have to be connected to the Xsheet node to be rendered, or can be connected to other effect nodes.
es: **Efectos que crean nuevas imágenes**, como el efecto Radial Gradient, que serán expuestos en columnas de la Planilla (capas de la Línea de tiempo) y por lo tanto se comportarán de manera similar a éstas; se presentarán como nodos de color *naranja* conteniendo únicamente un conector de salida del lado izquierdo. Estos nodos de efectos deberán ser conectados al nodo de la Planilla para ser incluidos en el procesamiento de la escena, o estar conectados a alguno de los conectores de entrada de otros nodos de efectos.

source: |Generated_FX_Example|
es: |Generated_FX_Example_es|

source: **To open the FX Browser:**
es: **Para abrir el Explorador de efectos:**

source: Choose Xsheet → **New FX...**
es: Elegir Planilla → **Nuevo efecto...**

source: Click the **New FX** button (|fx|) in the bottom bar of the FX Schematic window.
es: Hacer clic en el botón **Nuevo efecto** (|fx|) en la barra inferior del panel Diagrama de efectos.

source: **To Insert an effect:**
es: **Para insertar un efecto:**

source: Select the nodes for which you want to insert a new effect, select the effect you want to insert in the **FX Browser** and click the **Insert** button.
es: Seleccionar los nodos a partir de los cuales se desee insertar un nuevo efecto, seleccionar el efecto que se desee insertar en el **Explorador de efectos** y hacer clic en el botón **Insertar**.

source: Select the nodes for which you want to insert a new effect, right-click any of them and choose **Insert FX** from the menu that opens, then select the effect you want to insert from the available submenus.
es: Seleccionar los nodos a partir de los cuales se desee insertar un nuevo efecto, hacer clic derecho sobre cualquiera de ellos y elegir **Insertar efecto** en el menú, luego seleccionar el efecto deseado en los submenúes disponibles.

source: Select the *links* where you want to insert a new effect, right-click any of them and choose **Insert FX** from the menu that opens, then select the effect you want to insert from the available submenus (see :ref:`Editing the FX Schematic <editing_the_fx_schematic>` ).
es: Seleccionar las *líneas de vínculo* donde se desee insertar un nuevo efecto, hacer clic derecho sobre cualquiera de ellas y elegir **Insertar efecto** en el menú, luego seleccionar el efecto deseado en los submenúes disponibles (ver :ref:`Edición del Diagrama de efectos <editing_the_fx_schematic>` ).

source: **To Add an effect:**
es: **Para agregar un efecto:**

source: Select the nodes for which you want to add a new effect at the end of a new link.
es: Seleccionar los nodos a partir de los cuales se desee agregar un nuevo efecto.

source: Select the effect you want to add in the **FX Browser** and click the **Add** button.
es: Seleccionar el efecto que se desee agregar en el **Explorador de efectos** y hacer clic en el botón **Agregar**.

source: Right-click any of the selected nodes and choose **Add FX** from the menu that opens, then select the effect you want to add from the available submenus.
es: Hacer clic derecho sobre cualquiera de los nodos seleccionados y elegir **Agregar efecto** en el menú, luego seleccionar el efecto deseado en los submenúes disponibles.

source: **To Replace an effect:**
es: **Para reemplazar un efecto:**

source: Select the effect nodes you want to replace with a new effect.
es: Seleccionar los nodos de efectos que se desee reemplazar con un nuevo efecto.

source: Select the effect you want to add in the **FX Browser** and click the **Replace** button.
es: Seleccionar el efecto que se desee agregar en el **Explorador de efectos** y hacer clic en el botón **Reemplazar**.

source: Right-click any of the selected nodes and choose **Replace FX** from the menu that opens, then select the new effect from the available submenus.
es: Hacer clic derecho sobre cualquiera de los nodos seleccionados y elegir **Reemplazar efecto** en el menú, luego seleccionar el efecto deseado en los submenúes disponibles.

source: **To Insert/Add effects globally:**
es: **Para insertar/agregar efectos a toda la escena:**

source: Select the **Xsheet** node.
es: Seleccionar el nodo **Planilla**.

source: Select the effect you want to insert/add in the **FX Browser** and click the **Insert** or **Add** buttons.
es: Seleccionar el efecto que se desee insertar/agregar en el **Explorador de efectos** y hacer clic en el botón **Insertar** o **Agregar**.

source: Right-click any of the selected nodes and choose **Insert FX** or **Add FX** from the menu that opens, then select the effect you want to a insert/add from the available submenus.
es: Hacer clic derecho sobre el nodo **Planilla** y elegir **Insertar efecto** o **Agregar efecto** en el menú, luego seleccionar el efecto deseado en los submenúes disponibles.

source: **Ctrl + double-click** (PC) or **Cmd + double-click** (macOS) the node name and type a new name.
es: **Ctrl + doble clic** (PC) o **Cmd + doble clic** (macOS) sobre el nombre del nodo e ingresar un nuevo nombre.

source: Editing the FX Schematic
es: Edición del Diagrama de efectos

source: Links between nodes have to be considered like flows going to the right, from the column/layer nodes to the *Output* node, via the Xsheet node. If along the way there is one or several effects, the column content will be consequently processed before becoming part of the output.
es: El flujo de los vínculos entre nodos tiene que ser considerado de izquierda a derecha, desde los nodos de columnas/capas hasta el nodo de **Salida**, atravesando en nodo **Planilla**. Si a lo largo del trayecto hubiera uno o varios efectos, el contenido de las columnas/capas será consecuentemente procesado antes de llegar a la salida.

source: From the nodes output port several links can start at the same time, thus allowing, for example, a column/layer to be rendered as it is, and to be also used as a mask for another column/layer. It is also possible to determine permanently whether columns/layers will be rendered or not, by leaving or deleting the link to the Xsheet node.
es: Desde los conectores de salida de los nodos, podrán partir varias líneas de conexión al mismo tiempo permitiendo, por ejemplo, que una columna/capa sea procesada sin modificaciones, así como ser usada para enmascarar otra columna/capa. También será posible definir permanentemente si ciertas columnas/capas serán procesadas o no, preservando o borrando su vínculo con el nodo **Planilla**.
