Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: es

source: Swaps the channels of the Source content. For each channel you can set if it remains as it is, or if you want it to have another channel mixed. For example to leave the red channel as it is, Red to Red is 1, the other channels to Red are 0; by setting Green to Red to 0.5 adds half intensity of the green channel to the red one.
es: Permite reutilizar los canales del contenido conectado a *Source*. Para cada canal será posible definir si permanece tal como es, o si por el contrario se le mezcla la información de algún otro canal. Por ejemplo, para dejar el canal rojo tal como es: **Red to Red** (Rojo al rojo) debe ser 1, los otros canales **...to Red** (...al rojo) deben ser 0; si se definiera **Green to Red** (Verde al rojo) en 0.5 se estaría agregando la mitad de la intensidad del canal verde al canal rojo.

source: It can be used for example to create a black and white key for an image with the alpha channel, by setting all the values to 0 but the Alpha to Red, Green, Blue and Alpha to 1.
es: Podrá ser usado, por ejemplo, para crear un recorte en blanco y negro para una imagen, usando el canal alfa, definiendo todos los valores en 0, excepto por los valores **Alpha to Red** (Alfa al rojo), **Alpha to Green** (Alfa al verde), **Alpha to Blue** (Alfa al azul), **Alpha to Alpha** (Alfa al alfa) que deberán estar en 1.

source: Curves
es: Curves (Curvas)

source: Adjusts the tonal range of the *Source* content by remapping pixels intensity according to a tonal curve for the RGB, Red, Green, Blue and Alpha channels.
es: Permite ajustar el rango tonal del contenido conectado a *Source*, remapeando la intensidad de los píxeles de acuerdo a las curvas de los canales RGB (RVA), Red (Rojo), Green (Verde), Blue (Azul), Alpha (Alfa).

source: The horizontal axis of the graph represents the original brightness levels of the pixels (*Input* levels); the vertical axis represents the new brightness levels (*Output* levels).
es: El eje horizontal de la gráfica representa la intensidad original de los píxeles: sus Niveles de *entrada*; el eje vertical representa los niveles de intensidad, una vez modificados: sus Niveles de *salida*.

source: The default diagonal line indicates that no pixels are mapped to new values, so all pixels have the same Input and Output values.
es: La curva diagonal predefinida indica que los valores no han sido modificados, por lo tanto todos los píxeles tendrán los mismos valores de entrada que de salida.

source: It is possible to use many adjustment points to correct the curve: to *add* a point, click the curve; to change the curvature, use the point tangent handles; to *delete* a point, select it and use the delete shortcut (by default the Delete key).
es: Será posible usar varios puntos de ajuste para corregir la curva: para *agregar* un punto, bastará con hacer clic sobre la curva; para modificar su curvatura, arrastrar los puntos o sus tangentes; para *borrar* un punto, seleccionarlo y usar el atajo del comando Borrar (de forma predefinida, la tecla Supr).

source: The **Linear** option constrains the curve to a series of straight segments.
es: La opción **Linear** (Lineal) restringe la curva a una sucesión de segmentos de recta.

source: Despeckle
es: Despeckle (Desmanchar)

source: Elimantes small imperfections (dirt, scratches, stains and similar) of the drawing. The size in pixels of the details that will be retouched can be defined in the Size input text field. The background of the images can be Transparent or White, the choice is available in the Detect On menu.
es: Permite eliminar pequeñas imperfecciones (polvo, marcas, manchas y similares) de un dibujo. El tamaño de los detalles que serán retocados, en píxeles, podrá ser definido usando el parámetro **Size** (Tamaño). En el menú **Detect On** (Detectar en) será posible elegir si los detalles deberán ser detectados sobre un **Transparent Bg** (Fondo transparente) o **White Bg** (Fondo Blanco).

source: In the preview area is possible to check the results to avoid erasing details relevant for the drawing.
es: En el área de previsualización será posible revisar los resultados para evitar la eliminación de detalles relevantes del dibujo.

source: Gamma
es: Gamma (Gama)

source: Changes the gamma value of the Source content.
es: Permite cambiar el valor de gama del contenido conectado a *Source*.

source: HSV Scale
es: HSV Scale (Escalar TSV)

source: Shifts the Hue, Saturation and Value values of the Source content. Hue ranges from -180 to 180; Saturation and Value from -100 to 100. All the three settings preserve their original value at 0.
es: Permite desplazar los valores de tono, saturación y valor del contenido conectado a *Source*. **Hue** (Tono) va de -180 a 180 grados; **Saturation** (Saturación) y **Value** (Valor) van de -100 a 100. Todos los parámetros preservarán sus valores originales cuando estén en 0.

source: Invert
es: Invert (Invertir)

source: Inverts the color values of the Source content, e.g. makes a positive black and white image negative, or a positive one from a scanned black and white negative.
es: Permite invertir los valores de color del contenido conectado a *Source*, p.ej: transforma a una imagen normal en negativa, o en positiva a una imagen obtenida a partir de un negativo de película escaneado.

source: Multitone
es: Multitone (Multitono)

source: Applies to the Source content the colors defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ) according to the image brightness. The original image is turned into black and white and the color on the far left of the spectrum will be use for black pixels, the color on the far right for white pixels, and in-between colors for in-between grey pixels.
es: Permite aplicar al contenido conectado a *Source* los colores definidos por un gradiente de colores (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ) de acuerdo a la luminosidad de la imagen. La imagen original será transformada a escala de grises, el color de la izquierda del gradiente será utilizado para los píxeles negros, mientras que el de la derecha será usado para los blancos, y los intermedios del gradiente para los tonos intermedios de gris.

source: RGBA Cut
es: RGBA Cut (Cortar RVAα)

source: Delimits the Minimum and the Maximum values of the Red, Green, Blue and Alpha components of the Source content. The maximum can be decreased from 255, the original value, to 0, when no red, green, blue or alpha component will be visible. The minimum can be increased from 0, the original value, to 255, when the red, green, blue components will be saturated, and alpha will be fully opaque.
es: Permite delimitar los valores Mínimo y Máximo de los componentes Rojo, Verde, Azul y Alfa del contenido conectado a *Source*. El valor máximo podrá ser disminuido desde su valor original de 255 hasta 0, cuando ya no será visible el canal correspondiente. El mínimo podrá ser aumentado desde su valor original de 0 hasta 255, cuando el canal correspondiente se saturará completamente y el alfa será completamente opaco.

source: RGB Fade
es: RGB Fade (Fundir RVA)

source: Fades the Source content toward a color defined by Red, Green and Blue values. The Intensity, expressed as a percentage, ranges from 0 (no fade) to 100 (fade to full color).
es: Permite fundir el contenido conectado a *Source* hacia un color definido por sus valores Rojo, Verde y Azul. El parámetro **Intensity** (Intensidad), expresado como un porcentaje, podrá ir de 0 (fundido nulo) a 100 (fundido completo).

source: RGBA Scale
es: RGBA Scale (Escalar RVAα)

source: Changes the percentage of the Red, Green, Blue and Alpha components of the Source content. At 0 there is no red, green, blue or alpha component; at 100 the components have their original value.
es: Permite modificar el porcentaje de los componentes Rojo, Verde, Azul y Alfa del contenido conectado a *Source*. En 0 se anularán los componentes rojo, verde, azul o alfa.; en 100 éstos mantendrán sus valores originales.

source: Sharpen
es: Sharpen (Definir)

source: Increases the sharpness of the Source content according to a specific Intensity.
es: Permite aumentar la definición o nitidez del contenido conectado a *Source*, de acuerdo a la intensidad expresada en el parámetro **Intensity**.

source: Layer Blending
es: Layer Blending (Mezcla de capas)

source: Add
es: Add (Adicionar)

source: Adds the red, green and blue values of the Up node content to the Down one, pixel by pixel.
es: Permite sumar los valores de rojo, verde y azul del contenido conectado a *Source1* al contenido conectado a *Source2*, *Source3*, etc., píxel a píxel.

source: If no Down node is defined, the adding operation is applied to all the images underlaying the Up node content according to the Xsheet/Timeline layering order.
es: Si hubiera conectado un solo nodo, la operación de adición se aplicará con respecto a todas las imágenes que quedaran por debajo del contenido conectado a *Source1*, de acuerdo al orden natural de composición de las columnas en la Planilla (o capas en la Línea de tiempo).

source: The Intensity value expresses the percentage of values used in the addition; a negative value defines a subtraction instead of an addition.
es: El valor **Intensity** (Intensidad) expresa el porcentaje de los valores usados en la adición; un valor negativo definirá una sustracción en vez de una adición.

source: Color Burn
es: Color Burn (Subexponer color)

source: Darkens the pixel colors of the Down node content in order to reflect the color of the Up node content. The white in the Up node content does not affect the result.
es: Permite oscurecer el color de los píxeles del contenido conectado a *Source2* para reflejar el color del contenido conectado a *Source1*. Un color blanco en el nodo conectado a *Source1* no afectará al resultado final.

source: If no Down node is defined, the color burning operation is applied to all the images underlaying the Up node content according to the Xsheet/Timeline layering order.
es: Si hubiera conectado un solo nodo, la operación de subexposición de color se aplicará con respecto a todas las imágenes que quedaran por debajo del contenido conectado a *Source1*, de acuerdo al orden natural de composición de las columnas en la Planilla (o capas en la Línea de tiempo).

source: Color Dodge
es: Color Dodge (Sobreexponer color)

source: Brightens the pixel colors of the Down node content in order to reflect the color of the Up node content. The black in the up node content does not affect the result.
es: Permite aclarar el color de los píxeles del contenido conectado a *Source2* para reflejar el color del contenido conectado a *Source1*. Un color negro en el nodo conectado a *Source1* no afectará al resultado final.

source: If no Down node is defined, the color dodging operation is applied to all the images underlaying the Up node content according to the Xsheet/Timeline layering order.
es: Si hubiera conectado un solo nodo, la operación de sobrexposición de color se aplicará con respecto a todas las imágenes que quedaran por debajo del contenido conectado a *Source1*, de acuerdo al orden natural de composición de las columnas en la Planilla (o capas en la Línea de tiempo).

source: Cross Dissolve
es: Cross Dissolve (Fundido cruzado)

source: Creates a cross-dissolve between the Up and Down node content. When the Intensity value is 0, only the Down node content is visible; when it is 100, only the Up one.
es: Permite crear un fundido cruzado entre los contenidos conectados a *Source1* y *Source2*. Cuando el valor del parámetro **Intensity** (Intensidad) sea 0, sólo será visible el contenido conectado a *Source2*; cuando sea 100, sólo será visible el contenido conectado a *Source1*.

source: Darken
es: Darken (Oscurecer)

source: Compares the pixels color of the Up and Down node content and selects the darker one as the result color. The white in the Up node content does not affect the result; the black gives a black result.
es: Permite comparar el color de los píxeles del contenido conectado a *Source1* y *Source2*, y seleccionar al más oscuro de ellos como color resultante. Un color blanco en el nodo conectado a *Source1* no afectará al resultado final.; un color negro producirá negro como resultado.

source: If only one node is defined, the darkening operation is applied to all the images underlaying its content according to the Xsheet/Timeline layering order.
es: Si hubiera conectado un solo nodo, la operación de oscurecimiento se aplicará con respecto a todas las imágenes que quedaran por debajo de su contenido, de acuerdo al orden natural de composición de las columnas en la Planilla (o capas en la Línea de tiempo).

source: Lighten
es: Lighten (Aclarar)

source: Compares the pixels color of the Up and Down node content and selects the lighter one as the result color. The black in the Up node content does not affect the result; the white gives a white result.
es: Permite comparar el color de los píxeles del contenido conectado a *Source1* y *Source2*, y seleccionar al más claro de ellos como color resultante. Un color negro en el nodo conectado a *Source1* no afectará al resultado final.; un color blanco producirá blanco como resultado.

source: If only one node is defined, the lightening operation is applied to all the images underlaying the connected node according to the Xsheet/Timeline layering order.
es: Si hubiera conectado un solo nodo, la operación de aclaramiento se aplicará con respecto a todas las imágenes que quedaran por debajo de su contenido, de acuerdo al orden natural de composición de las columnas en la Planilla (o capas en la Línea de tiempo).

source: Local Transparency
es: Local Transparency (Transparencia local)

source: Applies a transparency to the Source content according to the brightness value of the node content connected to the Reference input port.
es: Permite aplicar una transparencia al contenido conectado a *Source*, de acuerdo a la luminosidad del contenido conectado a *Reference*.

source: The Intensity value amplifies uniformly the transparency given by the Reference node content.
es: El valor **Intensity** (Intensidad) permite amplificar uniformemente la transparencia proporcionada en el conector *Reference*.

source: Multiply
es: Multiply (Multiplicar)

source: Multiplies the red, green, blue and alpha values of the connected noded content.
es: Permite multiplicar los valores de rojo, verde y azul del contenido conectado a *Source1* por el contenido conectado a *Source2*, *Source3*, etc., píxel a píxel.

source: The Intensity value expresses the percentage of values used in the multiplication. By activating the Alpha option, also the alpha information is considered.
es: El valor **Intensity** (Intensidad) expresa el porcentaje de los valores usados en la multiplicación. Al activar la opción **Alpha** (Alfa), también se considerará la información de opacidad en los cálculos.

source: If only one node is defined, the multiplying operation is applied to all the images underlaying theupper node content according to the Xsheet/Timeline layering order.
es: Si hubiera conectado un solo nodo, la operación de multiplicación se aplicará con respecto a todas las imágenes que quedaran por debajo de su contenido, de acuerdo al orden natural de composición de las columnas en la Planilla (o capas en la Línea de tiempo).

source: Over
es: Over (Superponer)

source: Puts the connected nodes one over the other. Each time a node is connected a new port will be added, this way the overlap of columns can be defined regardless from the Xsheet columns (or Timeline layers) order. The contents order is up to bottom, where the node connected on the upper port will be over the other ones. This can be used when you need to combine several nodes in a single one, for example to mask several columns with the same mask.
es: Permite componer los nodos conectados, superponiéndolos uno sobre el otro. Cada vez que un nodo sea conectado se agregará un nuevo conector, de esta manera podrá realizarse la superposición de varias columnas/capas, alterando su orden natural de la Planilla/Línea de tiempo. El orden de composición será de arriba hacia abajo, donde los nodos conectados arriba se compondrán sobre los de abajo. Esto podrá ser usado cuando fuera necesario combinar varios nodos, por ejemplo para enmascarar varias columnas distintas usando la misma máscara.

source: Premultiply
es: Premultiply (Premultiplicar)

source: Premultiplies the alpha channel of the Source node content.
es: Permite premultiplicar el canal alfa del contenido conectado a *Source*.

source: Full-color images which have a meaningful alpha channel come in two types: premultiplied or not. A non-premultiplied image can be recognized when it is loaded in OpenToonz because its edge, where there is a complete transparence on one side and opacity on the other, is not smooth, but displays a solid halo. With the premultiply effect it is possible to transform the image alpha-channel so that it is correctly read by OpenToonz.
es: La información de canal alfa contenida en las imágenes en color puede venir en dos tipos: premultiplicado o directo. Es posible reconocer una imagen con alfa directo al ser cargada en OpenToonz, debido a la apariencia de los bordes entre las áreas opacas y transparentes, que estarán completamente definidos, sin áreas suaves intermedias y con un halo sólido. Mediante este efecto será posible transformar el canal alfa de la imagen para premultiplicarlo y que pueda ser correctamente visualizado en OpenToonz.

source: Full-color images can also be premultiplied by using a Level Settings option, or processed permanently in the browser, so that there is no need to apply the effect in the schematic (see :ref:`Editing Level Settings <editing_level_settings>` and :ref:`Using the File Browser <using_the_file_browser>` ).
es: También será posible premultiplicar imágenes usando la opción presente en el panel Opciones de nivel, donde podrá ser activado o desactivado en cualquier momento, o convertirlas de forma permanente, mediante el comando Premultiplicar del Explorador de archivos, para que no haya necesidad de aplicar este efecto en el Diagrama de efectos cada vez que la imagen sea cargada (ver :ref:`Edición de Opciones de nivel <editing_level_settings>` y :ref:`Uso del Explorador de archivos <using_the_file_browser>` ).

source: Screen
es: Screen (Trama)

source: Combines by multiplying the inverse of the pixels color of the Up and Down node content, giving a result color that is lighter than both Up and Down node pixels, except when one of them equals 0. The black in the Up node content does not affect the result; the white gives a white result.
es: Permite combinar el contenido conectado a *Source1* y *Source2*, multiplicando el inverso del color de sus píxeles y produciendo un resultado que será más claro que los píxeles de ambos, excepto en caso de que uno de ellos fuera 0. Un color negro conectado a *Source1* no afectará el resultado, mientras que un color blanco producirá un resultado blanco.

source: If no Down node is defined, the screening operation is applied to all the images underlaying the Up node content according to the Xsheet/Timeline layering order.
es: Si hubiera conectado un solo nodo, la operación de sustracción se aplicará con respecto a todas las imágenes que quedaran por debajo de su contenido, de acuerdo al orden natural de composición de las columnas en la Planilla (o capas en la Línea de tiempo).

source: Subtract
es: Subtract (Sustraer)

source: Subtracts the red, green and blue values of the Up node content from the Down one, pixel by pixel. By activating the Alpha option, also the alpha information is considered.
es: Permite sustraer los valores de rojo, verde y azul del contenido conectado a *Source1* al contenido conectado a *Source2*, etc., píxel a píxel.

source: If only one node is defined, the subtraction operation is applied to all the images underlaying connected node content according to the Xsheet/Timeline layering order.
es: Si hubiera conectado un solo nodo, la operación de sustracción se aplicará con respecto a todas las imágenes que quedaran por debajo de su contenido, de acuerdo al orden natural de composición de las columnas en la Planilla (o capas en la Línea de tiempo).

source: Transparency
es: Transparency (Transparencia)

source: Sets the transparency of the Source content. The Intensity, expressed as a percentage, ranges from 0, fully opaque, to 100, fully transparent.
es: Permite definir la transparencia del contenido conectado a *Source*. **Intensity** (Intensidad), expresada como porcentaje, podrá tomar valores entre 0 (opacidad completa) y 100 (transparencia completa).

source: Light
es: Light (Iluminación)

source: Backlit
es: Backlit (Resplandor trasero)

source: Creates a backlit effect, using the Light node content as a light source affecting the Source node content by the set Intensity. The light node content can be also faded to a Color defined by Red, Green and Blue values, according to the set Fade.
es: Permite crear un efecto de resplandor que aparecerá por detrás del contenido conectado a *Source*, utilizando el contenido conectado a *Light* como fuente de luz. La intensidad del efecto estará definida por el parámetro **Intensity**. El contenido del nodo conectado a *Light* podrá ser fundido a un **Color**, definido por sus valores Rojo, Verde, Azul y Alfa, y de acuerdo a la intensidad definida en el parámetro **Fade** (Fundir).

source: Body Highlight
es: Body Highlight (Iluminar cuerpo)

source: Creates a highlighted area for the Source node content, according to its alpha channel. You can set the Color of the highlight, as well as a Transparency and a Blur value to be applied.
es: Permite crear un área de iluminación en el contenido conectado a *Source*, de acuerdo a los bordes definidos por su propio canal alfa. Será posible definir el **Color** para las áreas iluminadas, el parámetro **Transparency** (Transparencia) define la transparencia del efecto y **Blur** (Desenfoque) un desenfoque para los bordes de la misma.

source: The shifting of the highlighted area is defined by horizontal (X) and vertical (Y) Offset values, that can also be interactively set in the preview of the FX Settings window, where the offset center is displayed with a cross.
es: **Offset** (Desplazamiento) permite definir un desplazamiento para el área iluminada, mediante sus valores horizontal (X) y vertical (Y), los cuales también podrán ser definidos de forma interactiva usando la pequeña cruz roja presente en el área de previsualización del panel Opciones de efecto.

source: Enabling the Invert option the effected areas will be toggled.
es: La opción **Invert** (Invertir) permite intercambiar las áreas consideradas normales e iluminadas.

source: The effect can be used to create a body shadow as well, by defining a black color for the highlight.
es: El efecto también podrá ser usado para crear sombras, definiendo un **Color** negro o cambiando el parámetro **Mode** (Modo) a **Subtract** (Sustracción).

source: Cast Shadow
es: Cast Shadow (Proyectar sombra)

source: Turns the Source content into a shadow that can be distorted and faded to a color with a variable transparency and blur.
es: Permite transformar el contenido conectado a *Source* en una sombra, que podrá ser distorsionada y fundida a un color, con un grado variable de transparencia y desenfoque.
