Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: es

source: By editing the links between nodes, or by creating new ones, you can control how column/layer nodes will interact with each other and with effects before being rendered.
es: Será posible controlar la forma en que los nodos de las columnas/capas y de efectos interactuarán entre ellos, editando los vínculos entre ellos o creando nuevos vínculos, antes de ser procesados.

source: In the effects that accept multiple input nodes it is possible to change the stacking order of the input nodes by clicking and dragging in the *ports* area.
es: En los efectos que acepten varias conexiones de entrada, será posible cambiar el orden de las mismas haciendo clic y arrastrando sobre dichas conexiones.

source: Effect nodes and links can be selected in order to be cut, copied, pasted or deleted. When selected, nodes and links are highlighted in white; the current node has its label in yellow; when at least one object is selected, the related links are displayed in blue.
es: Es posible seleccionar nodos de efectos y sus vínculos para poder cortarlos, copiarlos, pegarlos o borrarlos. Al estar seleccionados, los nodos y vínculos aparecerán resaltados en color *blanco*; el nodo actual tendrá su etiqueta en color *amarillo*; cuando al menos un objeto se encuentre seleccionado, sus vínculos correspondientes se mostrarán en color *azul*.

source: When pasting a copied/cut selection, several options are available:
es: Al pegar una selección copiada/cortada, varias opciones se encontrarán disponibles:

source: Use **Paste** to paste the copied/cut selection into the FX Schematic.
es: Usar **Pegar** para pegar la selección copiada/cortada en el Diagrama de efectos.

source: Use **Paste Insert** to insert the pasted selection into the *selected links*.
es: Usar **Pegar (insertar)** para insertar la selección copiada/cortada en los *vínculos seleccionados*.

source: Use **Paste Add** to add the pasted selection from the *selected nodes* at the end of new links.
es: Usar **Pegar (agregar)** para agregar la selección copiada/cortada al final de nuevos vínculos que partirán de los nodos seleccionados.

source: Use **Paste Replace** to replace *selected effects nodes* with the pasted selection.
es: Usar **Pegar (reemplazar)** para reemplazar los nodos de efecto seleccionados con los almacenados en memoria.

source: Links have to be selected together with nodes when copying/cutting a selection if you want to preserve the links among them when pasting.
es: Los vínculos también deberán estar seleccionados, conjuntamente con los nodos, al copiar/cortar una selección, si se desea preservar sus vínculos al pegar luego.

source: **To create links between nodes:**
es: **Para crear vínculos entre nodos:**

source: Click and drag the output port of the node to the input port of the effect node.
es: Hacer clic y arrastrar desde el conector de salida de un nodo al conector de entrada de un nodo de efecto.

source: **To select nodes and links:**
es: **Para seleccionar nodos y vínculos:**

source: Click to select a node or a link.
es: Hacer clic para seleccionar un nodo o un vínculo.

source: Click and drag to select a group of nodes and links.
es: Hacer clic y arrastrar para seleccionar un conjunto de nodos y sus vínculos.

source: Ctrl-click (PC) or Cmd-click (macOS) to add a node or a link to, or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o quitar un nodo o vínculo a la selección.

source: **To delete links between nodes:**
es: **Para borrar vínculos entre nodos:**

source: Select the links you want to delete and do one of the following:
es: Seleccionar los vínculos que se desee borrar y realizar una de las siguientes acciones:

source: Choose Edit → **Delete**.
es: Elegir Editar → **Borrar**.

source: Right-click any selected link and choose **Delete** from the menu that opens.
es: Hacer clic derecho sobre cualquier vínculo seleccionado y elegir **Borrar** desde el menú.

source: **To connect a node to the Xsheet node:**
es: **Para conectar un nodo al nodo de la Planilla:**

source: Click and drag the output port of the node to the input port of the **Xsheet** node.
es: Arrastrar desde el conector de salida del nodo hasta el conector de entrada del nodo **Planilla**.

source: Right-click the node you want to connect to the Xsheet node, and choose **Connect to Xsheet** from the menu that opens.
es: Hacer clic derecho sobre el nodo que se desee conectar al nodo de la Planilla y elegir **Conectar a la planilla** en el menú.

source: **To disconnect a flow from the Xsheet node:**
es: **Para desconectar un flujo del nodo de Planilla:**

source: Delete the link from the node to the Xsheet node.
es: Borrar el vínculo desde el nodo al nodo de Planilla.

source: Right-click the node you want to disconnect from the Xsheet node, and choose **Disconnect from Xsheet** from the menu that opens.
es: Hacer clic derecho sobre el nodo de se desee desconectar del nodo de la Planilla y elegir **Desconectar de la planilla** en el menú.

source: **To insert an effect node into a link:**
es: **Para insertar un nodo de efecto en una línea de vínculo:**

source: **Alt-click and drag** it onto the link.
es: Hacer **Alt-clic y arrastrar** sobre la línea de vínculo.

source: **To extract an effect node from a link:**
es: **Para extraer un nodo de efecto de un flujo:**

source: **Alt-click and drag** it away from the link.
es: Hacer **Alt-clic y arrastrar** fuera del flujo.

source: **To edit an effect nodes selection:**
es: **Para editar una selección de nodos de efecto:**

source: Use the **Copy** command to keep the selection in memory for further operations.
es: Usar el comando **Copiar** para mantener en memoria la selección para operaciones futuras.

source: Use the **Cut** command to eliminate the selection from the schematic and keep it in memory for further operations.
es: Usar el comando **Cortar** para eliminar la selección de nodos del Diagrama de efectos y mantenerla en memoria para operaciones futuras.

source: Use the **Paste** command to paste the selection kept in memory in the FX Schematic.
es: Usar el comando **Pegar** para pegar la selección en memoria, en el Diagrama de efectos.

source: Right-click a link and use the **Paste Insert** command to insert the selection kept in memory into the *selected link*.
es: Hacer clic derecho sobre una línea de vínculo y usar **Pegar (insertar)** para insertar la selección guardada en memoria en el *vínculo seleccionado*.

source: Right-click any node and use the **Paste Add** command to add the selection kept in memory from the *selected nodes* at the end of the new links.
es: Hacer clic derecho sobre un nodo y usar **Pegar (agregar)** para agregar la selección guardada en memoria al final de los nuevos vínculos creados.

source: Right-click an effect node and use the **Paste Replace** command to replace the *selected effect nodes* with the selection kept in memory.
es: Hacer clic derecho sobre un nodo de efecto y usar **Pegar (reemplazar)** para reemplazar los *nodos de efecto seleccionados* con los guardados en memoria.

source: Use the **Delete** command to delete the selection.
es: Usar el comando **Borrar** para borrar los nodos seleccionados.

source: All these commands are available in the menu that opens when right-clicking nodes and links.
es: Todos estos comandos también se encuentran disponibles en el menú emergente al hacer clic derecho sobre los nodos y líneas de vínculo.

source: **To create a linked effect:**
es: **Para Crear un efecto vinculado:**

source: Select the effect nodes you want to duplicate.
es: Seleccionar los nodos de efecto que se desee vincular.

source: Right-click any of the selected nodes and choose **Create Linked FX** from the menu that opens.
es: Hacer clic derecho sobre alguno de los nodos seleccionados y elegir **Crear efecto vinculado** en el menú.

source: **To break linked effects:**
es: **Para Desvincular efectos vinculados:**

source: Select the effect nodes you want to unlink.
es: Seleccionar los nodos de efecto que se desee desvincular.

source: Right-click any of the selected nodes and choose **Unlink** from the menu that opens.
es: Hacer clic derecho sobre uno de los nodos seleccionados y elegir **Desvincular** en el menú.

source: Using Multiple Output Nodes
es: Uso de varios nodos de salida

source: In the FX Schematic by default the Xsheet node is connected to an Output node: this means that all the nodes connected to the Xsheet node will be rendered both in the preview and in the final rendering.
es: En el Diagrama de efectos de forma predefinida el nodo **Planilla** se encuentra conectado a un nodo **Salida**: esto significa que todos los nodos conectados al nodo **Planilla** serán procesados, tanto en las previsualizaciones como en el procesamiento final.

source: The scene rendering can be limited to a specific node of the schematic by creating additional Output nodes, connected to the node where you want to limit the rendering.
es: Será posible limitar el procesamiento a algún nodo específico del Diagrama mediante la creación de nodos de **Salida** adicionales, conectados al nodo al que se desee limitar el procesamiento.

source: When more than one Output node is defined, you can set which is the *active* one (the one that will be considered for previewing or rendering the scene); the active output node is displayed in *blue*, while the others in *grey*.
es: Cuando se hubiera creado más de un nodo de salida, será posible definir cual deberá ser considerado el nodo *activo* (el que será tomado en cuenta para las previsualizaciones y el procesamiento final de la escena); el nodo de salida activo será mostrado en color *azul*, mientras que los demás aparecerán en color *gris*.

source: **To limit the output to a specific node:**
es: **Para limitar la salida a un nodo específico:**

source: Select the node to which you want to limit the output.
es: Seleccionar el nodo hasta el cual se desee limitar la salida.

source: Click the **New Output** button (|output|) in the bottom bar of the schematic window.
es: Hacer clic en el botón **Nuevo nodo de salida** (|output|) en la esquina inferior derecha del Diagrama de efectos.

source: Right-click the node and choose **New Output** from the menu that opens.
es: Hacer clic derecho sobre el nodo y elegir **Nuevo nodo de salida** en el menú.

source: **To add an Output node:**
es: **Para agregar un nodo de Salida:**

source: Right-click in the schematic and choose **New Output** from the menu that opens.
es: Hacer clic derecho en el Diagrama y elegir **Nuevo nodo de salida** en el menú.

source: **To connect a node to an Output node:**
es: **Para conectar un nodo a un nodo de Salida:**

source: Click and drag the output port of the node to the input port of the Output node.
es: Hacer clic y arrastrar desde el conector de salida del nodo deseado hasta el conector de entrada del nodo **Salida**.

source: **To set the current Output node:**
es: **Para definir el nodo de Salida activo:**

source: Right-click the Output you want to set as current and choose **Activate** from the menu that opens.
es: Hacer clic derecho sobre el nodo **Salida** que se desee activar y elegir **Activar** en el menú.

source: **To remove an Output node:**
es: **Para eliminar un nodo de Salida:**

source: Select it and choose Edit → **Delete**.
es: Seleccionarlo y elegir Editar → **Borrar**.

source: Right-click it and choose **Delete** from the menu that opens.
es: Hacer clic derecho sobre el nodo de **Salida** que se desee eliminar y elegir **Borrar** en el menú.

source: The last Output node remaining cannot be removed from the Schematic.
es: No será posible eliminar el último nodo de **Salida** del Diagrama de efectos.

source: Editing Effects Settings
es: Edición de las Opciones de efectos

source: Effects parameters and their animation can be controlled in the **FX Settings** window. According to the selected effect, it displays a different layout of sliders, check boxes, text fields, etc.
es: Es posible controlar los parámetros de los efectos y sus animaciones mediante el uso del panel **Opciones de efecto**. De acuerdo al efecto que se encuentre seleccionado, el panel mostrará una distribución de deslizadores, casillas de verificación, campos numéricos, campos de texto, etc.

source: At the bottom of the window a *preview area* is available to check the result of the applied effect: you can expand it or contract it, activate it or deactivate it, navigate its content, set its size, its background color, and limit it to the camera shot. The preview area can be expanded or contracted by clicking on the **+**/**-** symbol to the left of the **Swatch Viewer** text, at the bottom left of the FX Settings window.
es: Enla sección inferior del panel, existe un *área de previsualización* que permite revisar el resultado del efecto aplicado: será posible expandirla o contraerla, activarla o desactivarla, navegar su contenido, definir su color de fondo o limitarla a mostrar el encuadre de la cámara activa. El área de previsualización podrá ser expandida o contraída haciendo clic en los símbolos **+**/**-** a la izquierda del texto **Ver muestra**, en la esquina inferior izquierda del panel de Opciones de efecto.

source: Parameters can be animated by setting keyframes at specific frames. A **Set Key** button (|key|) is available in the preview area, at the bottom bar of the window, to set keyframes for *all* of the parameters. For each of the parameters that can be animated there is also a specific **Set Key** button (|key|) to the right of the parameter name, in order to set keyframes for each parameter independently.
es: Los parámetros podrán ser animados marcando claves en fotogramas específicos. Existe un botón **Marcar fotograma clave** (|key|) en la barra inferior del área de previsualización, que permitirá marcar fotogramas clave para *todos* los parámetros de un efecto. Para cada uno de los parámetros que puedan ser animados existirá también un botón **Marcar fotograma clave** (|key|) específico, a la derecha del nombre del parámetro, que permitirá marcar claves para cada parámetro de forma independiente.

source: The **Set Key** button (|key|) may have the following colors:
es: El botón **Marcar fotograma clave** (|key|) del área de previsualización, podrá presentar los siguientes colores:

source: It is **grey** when no keyframes for any parameter is defined at the current frame.
es: **Gris**, cuando no existan claves para ningún parámetro en el fotograma actual.

source: It is **blue-striped** when keyframes are defined at least for one parameter.
es: **A bandas azules**, cuando existan claves para al menos un parámetro en el fotograma actual.

source: It is **blue** when keyframes are defined for all the parameters.
es: **Azul**, cuando existan claves para todos los parámetros en el fotograma actual.

source: The parameter specific **Set Key** button (|key|) may have the following colors:
es: El botón **Marcar fotograma clave** (|key|) de cada parámetro, podrá presentar los siguientes colores:

source: It is **grey** if no key value is defined for the parameter at the current frame.
es: **Gris**, cuando no exista un clave para el parámetro en el fotograma actual.

source: It is **orange** when a key value is defined for the parameter at the current frame.
es: **Naranja**, cuando exista un clave para el parámetro en el fotograma actual.

source: It is **pale yellow** if the parameter is animated but no key value is defined at the current frame.
es: **Amarillo claro**, cuando el parámetro esté animado, pero no exista un clave en el fotograma actual.

source: It is **yellow** if you changed the parameter value and the current frame does not have a key for the parameter.
es: **Amarillo**, cuando se hubiera modificado el valor de un parámetro animado y no existiera un clave en el fotograma actual.

source: Frames and keyframes can be navigated by using the related buttons in the bottom bar of the window. The **Next Key** (|next_key|) and **Previous Key** buttons (|prevkey|) are available only if more than one keyframe is defined.
es: Será posible navegar por los fotogramas y claves mediante el uso de los botones correspondientes en la barra inferior del panel. Los botones **Clave anterior** (|prevkey|) y **Clave siguiente** (|next_key|) estarán disponibles si hubiera más de un clave definido.

source: |FX_Settings_Example|
es: |FX_Settings_Example_es|

source: If no keyframes are defined, parameters you set will be used throughout the scene.
es: Cuando no hubiera fotogramas clave definidos, el valor especificado para los parámetros será usado a lo largo de todas la escena.

source: **To open the FX Settings window:**
es: **Para abrir el panel de Opciones de efecto:**

source: Right-click the effect node, and choose **Edit FX...** from the menu that opens.
es: Hacer clic derecho sobre un nodo de efecto y elegir **Editar efecto...* en el menú.

source: Double-click the effect node.
es: Hacer doble clic sobre el nodo de efecto.

source: **To define values for the effect:**
es: **Para definir valores para un efecto:**

source: Use the available sliders, check boxes, text fields, etc., to configure the effect the way you prefer.
es: Utilizar los deslizadores, casillas de verificación, campos numéricos y de texto, etc. disponibles, para configurar el efecto de la manera deseada.

source: **To set the current frame:**
es: **Para definir el fotograma actual:**

source: Type the frame number or use the **Next Frame** and **Previous Frame** buttons available in the bottom bar of the window.
es: Ingresar el número de fotograma o usar los botones **Fotograma anterior** y **Fotograma siguiente** disponibles en la esquina inferior derecha del área de previsualización del panel.

source: Move the current frame cursor in the Xsheet/Timeline or in the Function Editor.
es: Mover el cursor de tiempo en la Planilla/Línea de tiempo o en el Editor de funciones.

source: Use the frame bar or the playback buttons in the bottom bar of the Viewer.
es: Usar la barra de fotogramas o los botones de reproducción en la barra inferior del Visor.

source: **To set keyframes for all the effect parameters at the current frame:**
es: **Para marcar un clave para todos los parámetros de un efecto en el fotograma actual:**

source: If the current frame is not a key, click the **Set Key** button (|key|) in the bottom bar of the window: it turns from *grey* to *blue* and current values become keyframes for all the parameters at the current frame.
es: Si en el fotograma actual no hubiera un clave, hacer clic en el botón **Marcar fotograma clave** (|key|) en la barra inferior del área de previsualización: el color del botón cambiará de *gris* a *azul* y los valores actuales de todos los parámetros se transformarán en claves.

source: If the current frame is a keyframe for some parameters only, click the **Set Key** button (|key|): it turns from *blue-striped* to *blue* and current values become keyframes for all the parameters at the current frame.
es: Si en el fotograma actual hubiera claves sólo para algunos parámetros, hacer clic en el botón **Marcar fotograma clave** (|key|) en la barra inferior del área de previsualización: el color del botón cambiará de mostrar *bandas azules* a *azul* y los valores actuales de todos los parámetros se transformarán en claves.

source: Define the values for the parameters.
es: Definir los valores de los parámetros.

source: **To set keyframes for a specific parameter at the current frame:**
es: **Para marcar claves para parámetros específicos en el fotograma actual:**

source: If the current frame does not have a keyframe for the parameter, click the squared **Set Key** button (|key|) to the right of the parameter: it turns from *grey* to *orange*, and the current value becomes a keyframe for the parameter at the current frame.
es: Si en el fotograma actual no hubiera un clave para el parámetro deseado, hacer clic en el botón **Marcar fotograma clave** (|key|) a la derecha del nombre del mismo: el color del botón cambiará de *gris* a *naranja* y el valor actual del parámetro se transformará en clave.

source: Define the value for the parameter.
es: Definir el valor del parámetro.

source: If the current frame is not a keyframe for the parameter, and you changed it, the **Set Key** button (|key|) to the right of the parameter turns *yellow*. Click it to set the key.
es: Si en el fotograma actual no hubiera un clave para el parámetro deseado y se hubiera modificado su valor, el botón **Marcar fotograma clave** (|key|) a la derecha del nombre del mismo, cambiará su color a *amarillo*.

source: **To remove all keyframes for the effect parameters at the current frame:**
es: **Para eliminar todos los claves de los parámetros de un efecto en el fotograma actual:**

source: If the keyframes are set for all the parameters, click the **Set Key** button (|key|) in the bottom bar of the window: it turns from *blue* to *grey*.
es: Si hubiera claves marcados para todos los parámetros, hacer clic en el botón **Marcar fotograma clave** (|key|) en la barra inferior del área de previsualización: su color cambiará de *azul* a *gris*.

source: If the keyframes are set for some parameters only, click twice the **Set Key** button (|key|) in the bottom bar of the window: with the first click it turns from *blue-striped* to *blue* (as you set keys for all the parameters); with the second click, it turns from *blue* to *grey*.
es: Si hubiera claves marcados sólo para algunos de los parámetros, hacer clic dos veces en el botón **Marcar fotograma clave** (|key|) en la barra inferior del área de previsualización: con el primer clic su color cambiará de *azul a bandas* a *azul* y con el segundo clic cambiará a *gris*.

source: **To remove a keyframe for a specific parameter at the current frame:**
es: **Para eliminar un clave de un parámetro específico en el fotograma actual:**

source: Click the **Set Key** button (|key|) to the right of the parameter: it turns from *grey* to *orange*.
es: Hacer clic en el botón **Marcar fotograma clave** (|key|) a la derecha del nombre del parámetro: su color cambiará de *gris a *naranja*.

source: **To navigate frames where keyframes are defined:**
es: **Para recorrer los fotogramas donde existan claves marcados:**

source: Use the **Next Key** (|next_key|) and **Previous Key** buttons (|prevkey|) available at the side of the **Set Key** button.
es: Usar los botones **Clave anterior** (|prevkey|) y **Clave siguiente** (|next_key|) disponibles a los lados del botón **Marcar fotograma clave** (|key|).

source: **To activate/deactivate the preview:**
es: **Para activar/desactivar la previsualización:**

source: Do any of the following:
es: Realizar una de las siguientes acciones:

source: Click the **Camera Preview** button (|camera|) in the bottom bar of the FX Settings window to limit the preview to the camera shot.
es: Hacer clic en el botón **Previsualizar cámara** (|camera|) en la barra inferior del área de previsualización, para limitar la previsualización al encuadre de la cámara activa.

source: Click the **Preview** button (|preview|) in the bottom bar of the FX Settings window to preview the results regardless of the camera shot.
es: Hacer clic en el botón **Previsualizar** (|preview|) en la barra inferior del área de previsualización, para previsualizar el resultado en un área que será posible ajustar libremente.

source: **To resize the preview area:**
es: **Para redimensionar el área de previsualización:**

source: Click and drag the horizontal separator.
es: Arrastrar el separador horizontal.

source: Click and drag the separator toward the window border to hide the preview area.
es: Arrastrar el separador hacia el borde inferior del panel para ocultar el área de previsualización.
