Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: es

source: Creates a new column/layer containing a simple gradient with a colored 'wavy' pattern. The waves colors are definied by setting the RGBA values of the Color 1 and Color 2 parameters. The stage of the displacement map image can be controlled by using the Evolution value; by setting the variation of this value between two keys, you set how much the displacement map image changes during the animation.
es: Permite crear una nueva columna/capa con un patrón 'ondulado' de color. Los colores serán definidos mediante los valores RVAα de los parámetros Color 1 y Color 2. El estado del mapa de desplazamiento puede ser controlado mediante el uso del parámetro **Evolution** (Evolución); controlando la variación de este valor entre dos fotogramas clave, se podrá definir qué tanto cambiará la imagen durante el transcurso de la animación.

source: GPU Radial Blur
es: GPU Radial Blur (Desenfoque radial GPU)

source: Blurs along radial lines whose origin is the set Center, defined by horizontal (X) and vertical (Y) coordinates, starting from an unaffected inner area defined by the Safe Radius. The Blur Factor parameter sets the amount of blur.
es: Permite crear un efecto de desenfoque radial cuyo origen es definido por los valores X (horizontal) e Y (vertical) del parámetro **Center** (Centro), partiendo de un área interior no afectada definida por el parámetro **Safe Radius** (Radio seguro). El parámetro **Blur** (Desenfoque) permite definir el nivel de desenfoque.

source: GPU Spin Blur
es: GPU Spin Blur (Desenfoque de giro GPU)

source: Blurs along concentric circular lines as if the Source content turns around the set Center, defined by horizontal (X) and vertical (Y) coordinates, starting from an unaffected inner area defined by the Safe Radius. The Blur parameter sets the amount of blur.
es: Permite crear un efecto de desenfoque de giro, como si el contenido del nodo conectado a *Source* estuviera girando alrededor del centro definido por los valores X (horizontal) e Y (vertical) del parámetro **Center** (Centro), partiendo de un área interior no afectada definida por el parámetro **Safe Radius** (Radio seguro). El parámetro **Blur** (Desenfoque) permite definir el nivel de desenfoque.
