Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: es

source: The distortion can be done like in the Free Distort effect (see :ref:`Free Distort <free_distort>` ). The fade Color can be defined by Red, Green and Blue values and a Fade intensity can be set. A different Blur and Transparency value can be set for the top and the bottom part of the Source content, in order to have a more realistic shadow.
es: La distorsión podrá ser realizada de manera análoga al efecto Free Distort (Distorsión libre) (ver :ref:`Free Distort <free_distort>` ). El color **Color** podrá ser definido por sus valores Rojo, Verde y Azul y podrá especificarse una intensidad mediante el parámetro **Fade** (Fundido). Será posible definir distintos valores de **Blur** (Desenfoque) y **Transparency** (Transparencia) para las partes **Top** (Superior) y **Bottom** (Inferior) de la sombra generada, para alcanzar un resultado más realista.

source: Glow
es: Glow (Resplandor)

source: Creates a glowing effect, using the Light node content as a light glowing on the node content connected to the Source input port. The Blur and Brightness of the glowing can be set; the Light node content can be also faded to a color defined by Red, Green and Blue values, according to the set Intensity.
es: Permite crear un efecto de resplandor, utilizando el contenido conectado a *Light* como una luz que resplandecerá sobre el contenido conectado a *Source*. Será posible definir el **Blur** (Desenfoque) y **Brightness** (Brillo) del resplandor; el contenido del nodo conectado a *Light* también podrá ser fundido a un **Color**, definido mediante sus valores Rojo, Verde, Azul y Alfa, que será aplicado de acuerdo al parámetro **Fade** (Fundir).

source: If no Source node is defined, the glowing is applied to all the images underlaying the Light node content according to the Xsheet/Timeline layering order.
es: Si no hubiera un nodo conectado a *Source*, la operación de resplandor se aplicará con respecto a todas las imágenes que quedaran por debajo de su contenido, de acuerdo al orden natural de composición de las columnas en la Planilla (o capas en la Línea de tiempo).

source: Light Spot
es: Light Spot (Foco)

source: Creates a new column/layer containing a light spot whose size and color can be set respectively with the Width and Height values, and the Reg, Green, Blue and Alpha values. The Softness sets the light diffusion in the area outside the spot.
es: Permite crear una nueva columna/capa con un foco de luz, cuyo tamaño podrá ser definido por los parámetros **Width** (Ancho) y **Height** (Altura), y su **Color** por los valores Rojo, Verde, Azul y Alfa. **Softness** (Suavidad) permitirá definir la difusión de la luz en el área exterior al foco.

source: The width and height can be also set by using a box gadget with handles in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: El ancho y altura también podrán ser definidos usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Raylit
es: Raylit (Rayo de luz)

source: Places a source of light behind the Source node content, casting rays of light outside or inside the image outline.
es: Permite ubicar una fuente de luz detrás del contenido conectado a *Source*, proyectando rayos de luz hacia afuera o adentro del contorno de la imagen.

source: The light source position is defined by horizontal (X) and vertical (Y) coordinates. By changing the light source position you change the way rays are cast along the image outline; by changing the Distance value you can make the light source approach to or go away from the image.
es: La posición de la fuente de luz estará definida por las coordenadas horizontal (X) y vertical (Y) del parámetro **Center** (Centro). Al cambiar la posición de la fuente de luz será posible cambiar la forma en la que los rayos son proyectados por el contorno de la imagen; al cambiar el parámetro **Distance** (Distancia) será posible hacer que la fuente de luz se acerque o aleje de la imagen.

source: Properties of the light can be set by defining the Intensity, the Color, that is set by Red, Green, Blue and Alpha values, the Decay, that is the decrease of the light intensity according to its distance from the image, and the Smoothness, that determines how sharp the rays are along the image outline.
es: Las propiedades de la luz podrán ser definidas mediante los siguientes parámetros: **Intensity** (Intensidad) permitirá definir la intensidad de la luz, **Color** su color mediante los valores de Rojo, Verde, Azul y Alfa; **Decay** (Decaimiento) la disminución de la intensidad de la luz, de acuerdo a su distancia de la imagen, y **Smoothness** (Suavidad) determinará qué tan definidos serán los haces de luz proyectados en el contorno de la imagen.

source: The Invert option switches the casting of rays of light from the outside of the image to the inside.
es: La opción **Invert** (Invertir) permite lograr que la proyección de rayos se produzca en el interior de la imagen, en vez de en su exterior.

source: The Keep Image check-box determines if the original drawing is rendered in the output or not.
es: La opción **Keep Image** (Mantener imagen) permitirá decidir si la imagen original deberá ser mostrada en el resultado final o no.

source: The center can be also set by using a point gadget in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ) and in the FX Settings preview.
es: El centro también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ), así como en el área de previsualización del panel Opciones de efecto.

source: The Source node content needs to have a significant alpha channel in order to have an effective result.
es: El contenido del nodo conectado a *Source* deberá tener presente información de canal alfa, para poder ser usado de forma exitosa con este efecto.

source: Color Raylit
es: Color Raylit (Rayo de luz de color)

source: Places a source of light behind the Source node content, casting rays of light outside the image outline.
es: Permite ubicar una fuente de luz detrás del contenido conectado a *Source*, proyectando rayos de luz hacia afuera del contorno de la imagen.

source: The colours of the rays are calculated from the original drawing colours.
es: Los colores de los rayos serán calculados a partir de los colores originales del dibujo.

source: Properties of the light can be set by defining the Intensity, the Decay, that is the decrease of the light intensity according to its distance from the image, and the Smoothness, that determines how sharp the rays are along the image outline.
es: Las propiedades de la luz podrán ser definidas mediante los siguientes parámetros: **Intensity** (Intensidad) permitirá definir la intensidad de la luz, **Decay** (Decaimiento) la disminución de la intensidad, de acuerdo a su distancia de la imagen, y **Smoothness** (Suavidad) determinará qué tan definidos serán los haces de luz proyectados en el contorno de la imagen.

source: Target Spot
es: Target Spot (Foco con objetivo)

source: Creates a new column/layer containing a light spot whose size and color can be set respectively with the Width and Height values, and the Red, Green, Blue and Alpha values. The direction of the spot can be set by defining the Distance of the light from the table and the Angle between the light spot direction and the table. The Decay, that is the decrease of the light intensity according to the distance from table, can be controlled as well.
es: Permite crear una nueva columna/capa con un foco de luz, cuyo tamaño podrá ser definido por los parámetros **Width** (Ancho) y **Height** (Altura), y su **Color** por los valores Rojo, Verde, Azul y Alfa. La dirección del foco podrá ser definida controlando los parámetros **Distance** (Distancia), que permite establecer la distancia del foco a la mesa, y **Angle** (Ángulo) que permite definir el ángulo entre la dirección del foco y la mesa. Mediante el parámetro **Decay** (Decaimiento) también podrá ser controlado el decaimiento de la intensidad del foco con la distancia.

source: Matte
es: Matte (Opacidad)

source: Erode/Dilate
es: Erode/Dilate (Erosionar/Dilatar)

source: Morphologically erodes or dilates the alpha channel of the connected node by the specified value, where positive values correspond to dilations and negative ones to erosion.
es: Permite erosionar o dilatar el canal alfa del nodo conectado a *Source* en la medida especificada mediante el parámetro **Radius** (Radio), donde valores positivos corresponderán a una expansión del contenido y negativos a una erosión del mismo.

source: The Type parameter defines the shape of the corners of the frame, applied around the image, when the Radius value is positive.
es: El parámetro **Type** (Tipo) permitirá definir la forma de las esquinas del marco, aplicado alrededor de los nuevos límites de la imagen cuando el valor del radio es positivo.

source: HSV Key
es: HSV Key (Recorte TSV)

source: Defines a chroma key for the Source content using the set Hue, Saturation and Value values. You can set the range for each value by using the related Range slider. The selection can be inverted using the Invert button.
es: Permite definir un recorte por croma para el contenido conectado a *Source*, usando los valores **Tone** (Tono), **Saturation** (Saturación) y **Value** (Valor). Será posible definir el rango para cada valor, por medio del deslizador de rango correspondiente (**H/S/V Range**). Será posible invertir la selección usando la opción **Invert**.

source: Matte In
es: Matte In (Opacidad interior)

source: Makes the Source content visible only inside the opaque areas of the node content connected to the Matte input port.
es: Permite hacer que el contenido conectado a *Source* sea visible sólo en el interior de las áreas opacas del contenido conectado a *Matte*.

source: Matte Out
es: Matte Out (Opacidad exterior)

source: Makes the source content visible only outside the opaque areas of the node content connected to the Matte input port.
es: Permite hacer que el contenido conectado a *Source* sea visible sólo en el exterior de las áreas opacas del contenido conectado a *Matte*.

source: RGB Key
es: RGB Key (Recorte RVA)

source: Defines a chroma key for the Source content using the set Red, Green and Blue values. You can set the range for each value by using the related Range slider. The selection can be inverted using the Invert button.
es: Permite definir un recorte por croma para el contenido conectado a *Source*, usando los valores **Red** (Rojo), **Green** (Verde) y **Azul** (Azul). Será posible definir el rango para cada valor, por medio del deslizador de rango correspondiente (**Red/Green/Blue Range**). Será posible invertir la selección usando la opción **Invert**.

source: Visible Matte In
es: Visible Matte In (Opacidad interior visible)

source: Makes the Up node content visible only inside the opaque areas of the node content connected to the Down input port, keeping the Down node still visible.
es: Permite hacer que el contenido conectado a *Up* sea visible sólo en el interior de las áreas opacas del contenido conectado a *Down* (al igual que sucede con el efecto Matte In), pero manteniendo la visibilidad del contenido del nodo conectado a *Down*.

source: Noise
es: Noise (Ruido)

source: Dissolve
es: Dissolve (Disolver)

source: Eliminates randomly pixels from the Source content according to the set Intensity.
es: Permitirá eliminar píxeles de forma aleatoria del contenido conectado a *Source*, de acuerdo a la intensidad expresada en el parámetro **Intensity**.

source: Adds a noise effect to the Source content according to the set Intensity. You can decide which noise component among Red, Green and Blue you want to activate, and if the result has to be in Black and White.
es: Permite agregar un efecto de ruido al contenido conectado a *Source*, de acuerdo al valor de **Intensity** (Intensidad) especificado. Será posible decidir cuál componente de color afectar activando las opciones **Red** (Rojo), **Green** (Verde) y **Blue** (Azul), así como si el resultado deberá ser en tonos de gris, mediante la opción **Black & White** (Blanco y negro).

source: Salt & Pepper Noise
es: Salt & Pepper Noise (Ruido sal y pimienta)

source: Adds a black and white noise effect to the Source content according to the set Intensity.
es: Permite agregar un ruido en blanco y negro al contenido conectado a *Source*, de acuerdo a la intensidad definida mediante el parámetro **Intensity**.

source: Render
es: Render (Generados)

source: Clouds
es: Clouds (Nubes)

source: Creates a new column/layer containing a fractal image whose type can be chosen between Clouds and Marble/Wood. The Size affect the grid used for generating the fractal image; a color spectrum defines the used colors (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ).
es: Permite crear una nueva columna/capa con una imagen fractal cuyo tipo podrá ser elegido entre **Clouds** (Nubes) y **Marble/Wood** (Mármol/Madera). **Size** (Tamaño) permitirá afectar el tamaño del patrón fractal; un espectro permitirá definir los colores a ser usados (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ).

source: Increasing the Minimum value shifts the color spectrum to the right, and consequently more pixels will be colored as the color defined at the far left of the spectrum. Decreasing the Maximum value shifts the color spectrum to the left, and consequently more pixels will be colored as the color defined at the far right of the spectrum.
es: Aumentar el valor **Min** (Mínimo) permitirá desplazar el espectro de colores hacia la derecha, lo que producirá que más píxeles utilicen el color de la izquierda del gradiente. Disminuir el valor **Max** (Máximo) permitirá desplazar el espectro de colores hacia la izquierda, lo que producirá que más píxeles utilicen el color de la derecha del gradiente.

source: The Evolution stage of the fractal image can be controlled as well; by setting the variation of this value between two keys, you set how much the fractal image changes during the animation.
es: **Evolution** (Evolución) permitirá controlar el estado de evolución del patrón fractal; si se define una variación de este valor a lo largo de la animación, se podrá controlar cómo cambiará el patrón fractal con el tiempo.

source: Particles
es: Particles (Partículas)

source: The Particles effect creates a new level in the selected column/layer containing particles.
es: El efecto Particles permite crear una nueva columna/capa conteniendo partículas.

source: It allows you to simulate a wide range of phenomena, such as rain, snow, sparkles, smoke, and a random configuration of elements, for example a field of shining stars starting from one shining star or the waving grass in a meadow starting from one animated blade of grass.
es: Es capaz de simular una amplia variedad de fenómenos, como lluvia, nieve, chispas, humo, así como también de habilitar la creación de múltiples elementos, por ejemplo la creación de todo un cielo de estrellas a partir de una sola de ellas o de un campo de césped a partir del dibujo de un solo tallo animado.

source: See :ref:`Using the Particles Effect <using_the_particles_effect>` .
es: Ver :ref:`Uso del efecto Particles <using_the_particles_effect>` .

source: Text Iwa
es: Text Iwa (Texto Iwa)

source: Creates a new column/layer containing editable and animatable text, using the following parameters:
es: Permite crear una nueva columna/capa con texto editable y animable, por medio de los siguientes parámetros:

source: **Source**, specifies the text source. You can choose one from:
es: **Source** (Origen), permite especificar el origen del texto. Es posible elegir entre:

source: **Nearby Note Column**: Get the text from Note Level column put on the directly left side of the Text Iwa effect column, in the Xsheet (for Timeline view, the Note Level layer just under the effect layer is used). If the respective column/layer does not contain a Note Level or the cell is empty, text will not be rendered.
es: **Nearby Note Column** (Columna de notas cercana): Permitirá obtener el texto a partir de una columna/capa de Notas que se encuentre directamente a la izquierda de la columna del efecto en la Planilla (o debajo, en la Línea de tiempo). Si la columna/capa respectiva no fuera una de Notas o la celda se encontrara vacía, no aparecerá ningún texto.

source: **Specified Note Column**: It's similar to the **Nearby Note Column** option, but the Note Level column number to use can be specified using the **Column Index** field below.
es: **Specified Note Column** (Columna de notas específica): Es similar a la opción **Nearby Note Column** (Columna de notas cercana), pero en este caso se podrá indicar la columna que se desee usar como origen, mediante el parámetro **Column Index** (Índice de columna) que se encuentra inmediatamente debajo.

source: **Input Text**: The text typed in the **Text** field below will be used (as shown in the image on top).
es: **Input Text** (Texto ingresado): Permitirá utilizar el texto ingresado en el campo **Text** (Texto) (tal como se muestra en la imagen de más arriba).

source: **Column Index**, specifies the source Note Level column number to use. Only used in **Specified Note Column** Source mode.
es: **Column Index** (Índice de columna), permite especificar el número de la columna/capa de Notas que deberá ser usado cuando la opción **Source** (Origen) se encuentra en el modo **Specified Note Column** (Columna de notas específica).

source: **Text**, specifies the source text. Only used in **Input Text** Source mode.
es: **Text** (Texto), permite especificar el texto de origen que deberá ser usado cuando la opción **Source** (Origen) se encuentra en el modo **Input Text** (Texto ingresado).

source: **Horizontal Align**, specifies the text align. Options are: **Left**, **Right**, **Center**, and **Justify**.
es: **Horizontal Align** (Alineación horizontal), permite especificar la alineación del texto. Las opciones son: **Left** (Izquierda), **Right** (Derecha), **Center** (Centro) y **Justify** (Justificar).

source: **Center X:**, **Y:** specify the position of the text.
es: **Center** (Centro) **X:**, **Y:** permiten especificar la posición del texto.

source: **Width**, **Height**, define the dimension of the text box. Just like in the Text items of the Clapperboard feature, the font size will be automatically adjusted in order to fit the box (see :ref:`Using The Clapperboard <using_the_clapperboard>` ).
es: **Width** (Ancho), **Height** (Altura), permite definir la dimensión del marco de texto. De igual forma que en los elementos de texto de la función Claqueta, el tamaño de la tipografía se ajustará automáticamente para ajustarse al marco (ver :ref:`Uso de la Claqueta <using_the_clapperboard>` ).

source: **Font**, specifies the font family to use.
es: **Font** (Tipografía), permite especificar la familia tipográfica a ser usada.

source: **Style:**, specifies the font style to use.
es: **Style:** (Estilo), permite especificar el estilo de la tipografía a ser usada.

source: **Size:**, specifies the *maximum* font size to use.
es: **Size:** (Tamaño máximo), permite especificar el tamaño *máximo* de la tipografía a ser usado.

source: The **Size** value will only take effect if the *automatically-calculated font size* (in order to fit the specified text box) is bigger than the value specified for this parameter.
es: El valor **Size** (Tamaño) sólo entrará en efecto cuando el *tamaño de la tipografía calculado automáticamente* (para que se ajuste al marco de texto especificado) fuera mayor que el valor especificado en este parámetro.

source: **Text Color**, specifies the color of the text. This color will also be used for the border line.
es: **Text Color** (Color del texto), permite especificar el color del texto. Este color también será usado para la línea del contorno, si estuviera activada.

source: **Box Color**, specifies the background color of the text box.
es: **Box Color** (Color de fondo), permite especificar el color de fondo del *marco delimitador del texto*.

source: **Show Border**, when activated, a border line will be rendered around the *text bounding box*. Please note that the *text box* (specified by the user) and the *text bounding box* (automatically computed from the rendered text) may become different, especially when the maximum font **Size** parameter is set to a small value.
es: **Show Border** (Mostrar contorno), al estar activado mostrará una línea en el contorno del *marco delimitador del texto*. Nótese que el *marco de texto* (especificado por el usuario) y el *marco delimitador del texto* (calculado automáticamente a partir del texto generado) podrían llegar a ser distintos, especialmente cuando el parámetro **Size** (Tamaño máximo) estuviera usando un valor bajo.

source: Known Issue: When you are using a Note Level column for the source text, a change in the note text will not automatically trigger the preview regeneration. You will need to manually regenerate the preview using the context menu of the Viewer.
es: Problema conocido: Cuando se esté usando una columna de Notas como origen del texto, al cambiar el texto de una nota, esto no disparará automáticamente una regeneración de la previsualización del texto. Se necesitará regenerar manualmente la previsualización, usando el menú contextual del Visor.

source: Stylize
es: Stylize (Estilización)

source: Color Emboss
es: Color Emboss (Relieve en color)

source: Traces the edges of the Source content with a combination of highlights and shadows. You can set the Intensity of the effect, and the Distance and Direction of the light that create the emboss effect. The Radius sets the depth of the embossing.
es: Permite trazar los bordes del contenido conectado a *Source* usando una combinación de iluminaciones y sombras. **Intensity** (Intensidad) permitirá controlar la intensidad del efecto, **Distance** (Distancia) y **Direction** (Dirección) permitirán controlar respectivamente la distancia y dirección de la luz que crea el efecto de relieve. **Radius** (Radio) permite definir la profundidad del relieve.

source: By connecting a node to the Controller port, the Source content will be embossed according to the Controller node content.
es: Cuando hubiera un nodo conectado a *Controller*, el relieve aplicado al contenido conectado a *Source* se generará en base a la información del nodo conectado a *Controller*.

source: Emboss
es: Emboss (Relieve)

source: Turns the Source content to grey areas and traces its edges with a combination of highlights and shadows. You can set the Intensity of the effect, and the Distance and Direction of the light that create the emboss effect. The Radius sets the depth of the embossing.
es: Permite convertir el contenido conectado a *Source* en una imagen gris y trazar sobre la misma sus bordes usando una combinación de iluminaciones y sombras. **Intensity** (Intensidad) permitirá controlar la intensidad del efecto, **Distance** (Distancia) y **Direction** (Dirección) permitirán controlar respectivamente la distancia y dirección de la luz que crea el efecto de relieve. **Radius** (Radio) permite definir la profundidad del relieve.

source: Mosaic
es: Mosaic (Mosaico)
