Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/applying_special_fx.po
Languages: es

source: No result will be visible if the motion blur is applied to a column that always stands in the same position while the content is a level where the movement is drawn.
es: No se apreciará ningún efecto cuando el desenfoque por movimiento fuera aplicado a una columna que se mantenga siempre en su lugar, por más que su contenido describa la animación de un movimiento.

source: Radial Blur
es: Radial Blur (Desenfoque radial)

source: Blurs along radial lines whose origin is the set Center, defined by horizontal (X) and vertical (Y) coordinates, starting from an unaffected inner area defined by the Radius.
es: Permite generar un desenfoque a lo largo de líneas radiales cuyo origen está definido por los valores horizontal (X) y vertical (Y) del parámetro **Center** (Centro), comenzando a partir de un área interior no afectada definida por el parámetro **Radius** (Radio).

source: The center and the radius can be also set by using a point and a circle gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ); the center can be set in the FX Settings preview as well.
es: También será posible definir el centro y el radio mediante el uso del manipulador interactivo en el Visor (ver :ref:`Uso de los Manipuladores de efectos <using_fx_gadgets>` ); el centro también podrá ser definido en el área de previsualización del panel Opciones de efecto.

source: Spin Blur
es: Spin Blur (Desenfoque de giro)

source: Blurs along concentric circular lines as if the Source content turns around the set Center, defined by horizontal (X) and vertical (Y) coordinates, starting from an unaffected inner area defined by the Radius.
es: Permite generar un desenfoque a lo largo de líneas circulares concéntricas como si el contenido conectado a *Source* estuviera girando alrededor del centro definido por el parámetro **Center**, comenzando a partir de un área no afectada definida por el parámetro **Radius** (Radio).

source: Distort
es: Distort (Distorsión)

source: Free Distort
es: Free Distort (Distorsión libre)

source: Distorts the Source content according to the position of four points, defined by horizontal (X) and vertical (Y) coordinates. For each point you can set the actual position and its origin, to determine which feature of the image will be distorted to the new position.
es: Permite distorsionar el contenido conectado a *Source* de acuerdo a la posición de cuatro puntos, definidos por coordenadas horizontales (X) y verticales (Y). Para cada punto será posible definir su origen, así como su posición actual, para determinar las partes de la imagen que deberán ser distorsionadas para alcanzar la nueva posición.

source: The Mode option menu lets you set the way the distortion is applied: Bilinear distorts the images according to the four points end positions, and Perspective forces the distortion to fit a perspective projection plane.
es: La opción **Mode** (Modo) permite definir la forma en que se aplicará la distorsión: **Bilinear** (Bilineal) simplemente distorsionará las imágenes de acuerdo a las posiciones finales de los cuatro puntos, mientras que **Perspective** (Perspectiva) forzará a que la distorsión se ajuste al plano de proyección de una perspectiva.

source: To better set the origin position for each point, you can use the Deactivate option that lets you see the image without distortion.
es: Para poder ubicar de mejor manera las posiciones de origen de cada punto, será posible usar la opción **Deactivate** (Desactivar) para poder visualizar la imagen sin los efectos de la distorsión.

source: The position of the four points and their origins can be also set by using arrow gadgets with handles at the ends in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ) and in the FX Settings preview as well.
es: La posición de los cuatro puntos y sus orígenes también podrá ser definida mediante el uso del manipulador interactivo en el Visor (ver :ref:`Uso de los Manipuladores de efectos <using_fx_gadgets>` ), así como en el área de previsualización del panel Opciones de efecto.

source: Linear Wave
es: Linear Wave (Ondas lineales)

source: Distorts the Source content creating a wave effect that uses an automatically generated displacement map image. The Quantity value sets the number of waves; the Period sets the distance between waves; the Phase shifts distortion in the wave direction.
es: Permite distorsionar el contenido conectado a *Source*, por medio de un mapa de desplazamiento generado internamente, con forma de ondas. El valor **Quantity** (Cantidad) define la cantidad de ondas; el valor **Period** (Período) define la distancia entre las ondas; el valor **Phase** (Fase) permite desplazar la distorsión en la dirección de las ondas.

source: You can also add a Transverse Wave on the main linear waves: the Amplitude sets the intensity of the distortion; the Frequency sets the number of waves creating the distortion; the Cycle shifts the distorting waves.
es: También será posible agregar ondas transversales (**Transverse Wave**) sobre las ondas principales: el valor **Amplitude** (Amplitud) define la intensidad de la distorsión; **Frequency** (Frecuencia) define la cantidad de ondas; **Cycle** (Ciclo) permite desplazar las ondas de distorsión.

source: A rotation for the whole wave effect can be set by using the Angle value.
es: Será posible definir una rotación para el efecto completo de ondas, usando el parámetro **Angle** (Ángulo).

source: The amount of distortion is controlled by the Intensity value; the detail of the distortion, by the Sensitivity parameter; the Sharpen option allows you to decrease the blur on the final result.
es: La cantidad general de distorsión será controlada por el valor **Intensity** (Intensidad); el valor **Sensitivity** (Sensibilidad) permitirá controlar el detalle del mapa de desplazamiento donde se generarán las ondas, mientras que la opción **Sharpen** (Definir) permitirá reducir el desenfoque en el resultado final del desplazamiento.

source: Perlin Noise
es: Perlin Noise (Ruido Perlin)

source: Distorts the Source content by using a computer-generated displacement map image whose type can be chosen between Clouds and Marble/Wood.
es: Permite distorsionar el contenido conectado a *Source* usando un mapa de desplazamiento generado internamente, cuyo tipo podrá ser elegido por medio del parámetro **Type**, entre las opciones: **Clouds** (Nubes) o **Marble/Wood** (Mármol/Madera).

source: The amount of distortion is controlled by the Intensity value; the , by the Size of the displacement map grid. The Horizontal and Vertical Offset, and the Evolution stage of the displacement map image can be controlled as well; by setting the variation of these values between two keys, you can set how much the displacement map moves and changes during the animation.
es: La cantidad de distorsión será controlada por el valor **Intensity** (Intensidad); mientras que **Size** (Tamaño) definirá el tamaño del efecto sobre la imagen. También será posible controlar los valores **Horizontal Offset** (Desplazamiento horizontal), **Vertical Offset** (Desplazamiento vertical) y **Evolution** (Evolución) de la distorsión; por medio de la variación de estos valores en el tiempo será posible definir qué tan rápido se moverá y cambiará el mapa de desplazamiento durante la animación.

source: The Alpha option adds also a transparency displacement to fully-opaque images.
es: La opción **Alpha** (Alfa) permitirá afectar también la transparencia de imágenes totalmente opacas.

source: The horizontal and vertical offset can also be set by using a point gadget in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: Los valores de desplazamiento horizontal y vertical también podrá ser definidos usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Random Wave
es: Random Wave (Ondas aleatorias)

source: Distorts the Source content creating a random wave effect that uses an automatically generated displacement map image. It can be used, for instance, to create a reflection on a water surface, or an underwater view.
es: Permite distorsionar el contenido conectado a *Source*, por medio de un mapa de desplazamiento generado internamente, con forma de ondas aleatorias. Podrá ser usado, por ejemplo, para simular la reflexión de una superficie de agua o una vista submarina.

source: The stage of the displacement map image can be controlled by using the Evolution value; by setting the variation of this value between two keys, you set how much the displacement map image changes during the animation.
es: Se podrá controlar el estado de evolución de la imagen del mapa de desplazamiento mediante el parámetro **Evolution** (Evolución); definiendo la variación de este valor entre dos fotogramas clave, será posible definir qué tanto cambiará la imagen del mapa de desplazamiento durante el transcurso de la animación.

source: The position of the displacement map image can be shifted along the Horizontal and the Vertical axis. By setting the variation of this value between two keys, the distortion effect can be animated in any direction.
es: El parámetro **Position** (Posición) permitirá controlar la posición del mapa de desplazamiento en los ejes horizontal y vertical. Definiendo la variación de este valor entre dos fotogramas clave, será posible animar el efecto de desplazamiento en cualquier dirección.

source: The position along the horizontal and vertical axis can also be set by using a point gadget in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: La posición a lo largo de los ejes horizontal y vertical también podrá ser definida usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Ripple
es: Ripple (Ondas concéntricas)

source: Distorts the Source content creating a circular wave effect that uses an automatically generated displacement map image. The Quantity value sets the number of ripples; the Period value sets the distance between ripples; the Cycle shifts the ripple distortion, with increasing values expanding the ripples, and decreasing values collapsing them.
es: Permite distorsionar el contenido conectado a *Source*, por medio de un mapa de desplazamiento generado internamente, con forma de ondas concéntricas. El valor **Quantity** (Cantidad) permitirá definir la cantidad de ondas; **Period** (Período) definir la distancia entre las ondas; **Cycle** (Ciclo) permitirá desplazar la distorsión de las ondas, con valores mayores provocando la expansión de las mismas y valores menores su contracción.

source: The Center of the circular waves can be set with a Horizontal and Vertical value; circular waves can be scaled in the Horizontal and Vertical directions, and rotated according to a set Angle.
es: **Center** (Centro) permite definir el centro de emisión de las ondas, mediante sus valores horizontal y vertical; **Scale** (Escala) permitirá controlar el tamaño horizontal y vertical de las ondas, mientras que **Angle** (Ángulo) permitirá controlar la rotación del patrón de ondas en su conjunto.

source: The center and the period can be also set by using a point and a circle gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ); the center can be set in the FX Settings preview as well.
es: El centro y el período de las ondas también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Warp
es: Warp (Distorsionar)

source: Distorts the Source content according to the brightness variation of the node content connected to the Warper input handle, that is used as a displacement map image affecting the Source content.
es: Permite distorsionar el contenido conectado a *Source*, de acuerdo a la variación de luminosidad del contenido del nodo conectado a **Warper**.

source: The amount of distortion is controlled by the Intensity value; the detail of the warp, by the Size of the displacement map grid; the Sharpen option allows you to decrease the blur on the final result.
es: La cantidad de distorsión será controlada por el valor **Intensity** (Intensidad); **Size** (Tamaño) controlará el grado de detalle de la distorsión; mientras que la opción **Sharpen** (Definir) permitirá reducir el desenfoque en el resultado final.

source: Gradients
es: Gradients (Gradientes)

source: Diamond Gradient
es: Diamond Gradient (Gradiente en diamante)

source: Creates a new column/layer containing a gradient, that goes hyperbolically from the center to the four corners, defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ) and a Size value.
es: Permite crear una nueva columna/capa con un gradiente que va desde el centro hacia las cuatro esquinas de forma hiperbólica, definido por varios colores (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ) y un parámetro **Size** (Tamaño) para definir su tamaño.

source: The size can also be set by using a circle gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: El tamaño también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Four Points Gradient
es: Four Points Gradient (Gradiente de cuatro puntos)

source: Creates a new column/layer containing a gradient defined by four Colors, defined by Red, Green, Blue and Alpha values, whose source Points can be placed where needed defining horizontal (X) and vertical (Y) coordinates.
es: Permite crear una nueva columna/capa con un gradiente definido por cuatro colores, definidos por sus valores de Rojo, Verde, Azul y Alfa, cuyas posiciones se alcanzarán en los puntos definidos por las coordenadas horizontales (X) y verticales (Y) de los cuatro parámetros **Point** (Punto) disponibles.

source: The source points can also be set by using point gadgets in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ) and in the FX Settings preview as well.
es: Las posiciones de los colores también podrán ser definidos usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Linear Gradient
es: Linear Gradient (Gradiente lineal)

source: Creates a new column/layer containing a gradual blend between two Colors defined by Red, Green, Blue and Alpha values. The Size controls the area of the gradient between the two colors.
es: Permite crear una nueva columna/capa con un gradiente lineal entre dos colores, definidos por sus valores Rojo, Verde, Azul y Alfa. **Size** (Tamaño) permite controlar el área del gradiente entre los dos colores.

source: You can also add a Distortion Wave on the linear gradient: the Amplitude sets the intensity of the distortion; the Frequency sets the number of waves creating the distortion; the Phase shifts the distorting waves.
es: También será posible agregar una Onda de distorsión que actúe sobre el gradiente: donde **Amplitude** (Amplitud) definirá la intensidad de la distorsión; **Frequency** (Frecuencia) definirá la cantidad de ondas y **Phase** (Fase) desplazará las ondas de la distorsión.

source: The size can also be set by using a gadget with two handles at the ends in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: El tamaño del gradiente también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Multi Linear Gradient
es: Multi Linear Gradient (Gradiente lineal múltiple)

source: Creates a new column/layer containing a multi linear gradient defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ). The Period value sets the size of a spectrum gradient; the Quantity is the number of times the spectrum is repeated; the Phase shifts the gradient colors.
es: Permite crear una nueva columna/capa con un gradiente lineal múltiple, definido por un espectro de colores (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ). El valor **Period** (Período) definirá el tamaño del gradiente; **Quantity** (Cantidad) definirá la cantidad de veces que el gradiente será repetido y **Phase** (Fase) permitirá desplazar los colores del gradiente.

source: You can also add a Wave distortion on the multi linear gradient: the Amplitude sets the intensity of the distortion; the Frequency sets the number of waves creating the distortion; the Phase shifts the distorting waves.
es: También será posible agregar una Onda de distorsión que actúe sobre el gradiente: donde **Amplitude** (Amplitud) definirá la intensidad de la distorsión; **Frequency** (Frecuencia) definirá la cantidad de ondas y **Phase** (Fase) desplazará las ondas de la distorsión.

source: The period can also be set by using a gadget with two handles at the ends in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` )
es: El período del gradiente también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Multi Radial Gradient
es: Multi Radial Gradient (Gradiente radial múltiple)

source: Creates a new column/layer containing a multi radial gradient defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ). The Period value sets the size of a spectrum gradient; the Quantity is the number of times the spectrum is repeated; the Phase shifts the gradient colors.
es: Permite crear una nueva columna/capa con un gradiente radial múltiple, definido por un espectro de colores (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ). El valor **Period** (Período) definirá el tamaño del gradiente; **Quantity** (Cantidad) definirá la cantidad de veces que el gradiente será repetido y **Phase** (Fase) permitirá desplazar los colores del gradiente.

source: The period can be also set by using a circle gadget with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: El período del gradiente también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Radial Gradient
es: Radial Gradient (Gradiente radial)

source: Creates a new column/layer containing a gradual blend between two colors, defined by Red, Green, Blue and Alpha values, shading them in a circular pattern. The Inner Size controls the area where the gradient between the two colors begins; the Outer Size where it ends.
es: Permite crear una nueva columna/capa con un gradiente radial entre dos colores, definidos por sus valores Rojo, Verde, Azul y Alfa. **Inner Size** (Tamaño interior) permite controlar el radio inicial del gradiente, mientras que **Outer Size** (Tamaño exterior) define el radio final del gradiente.

source: The inner and outer sizes can be also set by using circle gadgets with a handle in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: Los tamaños inicial y final también podrán ser definidos usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Spiral
es: Spiral (Espiral)

source: Creates a new column/layer containing a spiral pattern gradient defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ). The Frequency sets the size and number of the spires; the Phase shifts the gradient colors.
es: Permite crear una nueva columna/capa con un gradiente en forma de espiral, definido por un espectro de colores (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ). El valor **Frequency** (Frecuencia) definirá el tamaño y la cantidad de vueltas de la espiral y **Phase** (Fase) permitirá desplazar los colores del gradiente.

source: Square Gradient
es: Square Gradient (Gradiente cuadrado)

source: Creates a new column/layer containing a square gradient, that goes linearly from the center to the four corners, defined by a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ) and a Size value.
es: Permite crear una nueva columna/capa con un gradiente cuadrado, que se extenderá linealmente desde el centro hacia sus cuatro esquinas, y estará definido por un espectro de colores (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ) y un valor **Size** (Tamaño) que permitirá definir su tamaño.

source: The size can also be set by using a rotated square gadget with handles in the Viewer (see :ref:`Using FX Gadgets <using_fx_gadgets>` ).
es: El tamaño también podrá ser definido usando el manipulador del efecto en el Visor (ver :ref:`Usando los Manipuladores de efectos <using_fx_gadgets>` ).

source: Image Adjust
es: Image Adjust (Ajuste de imagen)

source: Adjust Levels
es: Adjust Levels (Ajustar niveles)

source: Adjusts the highlights and shadows of the Source content by remapping pixels intensity according to the Input and Output levels values for the RGB, Red, Green, Blue and Alpha channels; it also controls the Gamma value for each channel separately.
es: Permite ajustar las sombras e iluminaciones del contenido conectado a *Source*, remapeando la intensidad de los píxeles de acuerdo a los niveles de **Input** (Entrada) y **Output** (Salida) de los canales RVA, Rojo, Verde, Azul y Alfa; también permite controlar el valor de **Gamma** (Gama) para cada canal de forma independiente.

source: For each channel the Input values remaps pixel intensity whose value is equal or lower than the Minimum value, to 0, and those whose value is equal or higher than the Maximum value, to 255. This may be helpful to increase the contrast of an image.
es: Para cada canal, el valor de **Input** (Entrada) permitirá remapear la intensidad de los píxeles como sigue: los valores menores o iguales que el Mínimo serán transformados en 0, mientras que los mayores e iguales que el Máximo serán transformados en 255, los valores intermedios se ajustarán para mantener su relación proporcional con los nuevos extremos definidos. Esto puede resultar de ayuda para aumentar el nivel de contraste de una imagen.

source: For each channel the Output values remaps pixel intensity whose value is lower than the Minimum value, to the Minimum value, and those whose value is higher than the Maximum value, to the Maximum value. This may be helpful to decrease the contrast of an image.
es: Para cada canal, el valor de **Output** (Salida) permitirá remapear la intensidad de los píxeles como sigue: los valores menores que el Mínimo serán transformados en el valor Mínimo, mientras que los mayores que el Máximo serán transformados en el Máximo, los valores intermedios se ajustarán para mantener su relación proporcional con los nuevos extremos definidos. Esto puede resultar de ayuda para disminuir el nivel de contraste de una imagen.

source: Brightness & Contrast
es: Brightness & Contrast (Brillo y contraste)

source: Increases or decreases the brightness and contrast of the Source content.
es: Permite aumentar o disminuir el brillo y el contraste del contenido conectado a *Source*.

source: Channel Mixer
es: Channel Mixer (Mezclar canales)
