Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: es

source: Creating Movements
es: Creación de movimientos

source: Each scene has a series of *objects* that can be transformed; they can be Xsheet columns (or Timeline layers), pegbars, cameras, or the table.
es: Cada escena contiene una serie de *objetos* que pueden ser transformados; éstos pueden ser: columnas de la Planilla (capas de la Línea de tiempo), barras de sujeción, cámaras o la propia mesa.

source: Every transformation you set for an object at a specific frame automatically defines a keyframe. When keyframes are defined at several frames, in-between positions are automatically interpolated.
es: Cada transformación que se defina para un objeto, en un fotograma específico, será guardada como un fotograma clave. Cuando se hubieran definido claves en varios fotogramas, las posiciones intermedias serán interpoladas automáticamente.

source: To create more complex animations, you can also work in a 3D environment, where cameras and scene elements can be placed like on a stage at different distances one from another.
es: Para crear animaciones más complejas, también será posible trabajar en un entorno 3D, donde las cámaras y los elementos de la escena podrán ser ubicados como si se tratara de un escenario, a diferentes distancias unos de otros.

source: Using the Stage Schematic
es: Uso del Diagrama de escenario

source: The Stage Schematic contains *nodes* for all of the objects used in a scene, making it possible to manage the way they are linked to each other. It's organized in a hierarchy starting from the animation table, where all the columns/layers and pegbars are placed. A camera is available as well, and additional cameras can be defined.
es: El Diagrama de escenario contiene *nodos* para cada objeto usado en la escena, haciendo posible administrar la forma en que éstos se vinculan entre sí. Se encuentra organizado como una jerarquía que comienza en la mesa de trabajo, donde están ubicadas todas las columnas/capas y barras de sujeción. De forma predefinida también hay una cámara, siendo posible crear más, de ser necesario.

source: By default the Stage Schematic contains the table node and one camera node.
es: De forma predefinida el Diagrama de escenario contiene el nodo de la mesa y uno para la cámara.

source: Column/layer nodes are added as soon as you load or create some content; pegbars and cameras can be added at any time (pegbars will be automatically linked to the table).
es: A medida que se vayan exponiendo niveles en la Planilla/Línea de tiempo, los correspondientes nodos de columnas/capas irán siendo creados, vinculados a la mesa; será posible también crear barras de sujeción y cámaras, en cualquier momento (estas últimas estarán siempre vinculadas a la mesa).

source: When more than one camera is created, you can set which is the active one, used in the Viewer; the active camera node is displayed in blue while the others are left idle in grey. Each camera can have a different size and resolution, and each of them can be animated independently (see :ref:`Defining Camera Settings <defining_camera_settings>` ).
es: Cuando se cree más de una cámara, será posible definir la cámara *activa* usada en el Visor; el nodo de la cámara activa será mostrado en *azul*, mientras los de las demás cámaras serán mostrados en *gris*. Cada cámara podrá tener un tamaño y resolución distintos y ser animada de forma independiente (ver :ref:`Definición de Opciones de cámara <defining_camera_settings>` ).

source: Objects nodes can be easily added and arranged and they can be selected in order to be cut, copied, pasted or deleted. When selected, nodes' edges are highlighted in white; the current node has its label displayed in yellow; when at least one node is selected, its related links are displayed in cyan.
es: Es posible agregar y ordenar nodos de objetos de forma sencilla, así como seleccionarlos para que puedan ser cortados, copiados, pegados o borrados. Al seleccionar un nodo, su contorno se resaltará en *blanco*; la etiqueta del nodo actual se mostrará en *amarillo*; cuando hubiera al menos un nodo seleccionado, sus vínculos serán mostrados en *cian*.

source: It's also possible to *group* several nodes into one single node, in order to better manage a complex Stage Schematic. Groups can be opened to be examined, and its components can be selected for further operations, like creating animations or new groups.
es: También será posible *agrupar* varios nodos en uno solo, para poder administrar de mejor manera Diagramas de escenario de alta complejidad. Será posible abrir los grupos para examinarlos, y sus componentes podrán ser seleccionados para posteriores operaciones, como crear animaciones o nuevos grupos.

source: Column/layer nodes have buttons defining their visibility in Camera stand (|camera_stand|) and Render (|preview|) views, these buttons are located at the top right of the nodes: the toggles are linked to the ones available in the Xsheet columns (Timeline layers) headers (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>` ).
es: Los nodos de columnas/capas contienen botones para definir su **Visibilidad en mesa de trabajo** (|camera_stand|) y **Visibilidad durante el procesamiento** (|preview|), ubicados en la esquina superior derecha de los nodos: estos interruptores están enlazados con los existentes en el encabezado de las columnas/capas de la Planilla/Línea de tiempo (ver :ref:`Trabajo con columnas/capas <working_with_xsheet_columns>` ).

source: **To access the stage schematic:**
es: **Para acceder al Diagrama de escenario:**

source: Go to the Window menu, and choose the Schematic option.
es: Elegir la opción Ventanas → Diagrama.

source: If necessary, click the FX/Stage toggle button (|schematic|) in the bottom bar of the Schematic pane until the title bar displays Stage Schematic.
es: Si fuera necesario, hacer clic en el botón **Diagrama de efectos/escenario** (|schematic|) en la esquina inferior derecha del panel Diagrama, hasta que en la barra se lea Diagrama de escenario.

source: **To navigate the stage schematic:**
es: **Para navegar en el diagrama:**

source: Do one of the following:
es: Hacer una de las siguientes cosas:

source: Use the mouse wheel, or the zoom shortcut keys (by default + and - keys) to zoom in and zoom out.
es: Usar la rueda del ratón o los atajos (de forma predefinida las teclas **+** y **-**) para usar el zoom.

source: Middle-click and drag to scroll in any direction.
es: Hacer clic central y arrastrar para desplazar la vista en cualquier dirección.

source: Use the **Fit to Window** button (|fit_to_window|) in the bottom bar of the stage window to display all the objects in the current window.
es: Usar el botón **Ajustar a ventana** (|fit_to_window|) en la esquina inferior izquierda del Diagrama, para mostrar todos los objetos en la ventana.

source: Use the **Focus on Current** button (|focus_on_current|) in the bottom bar of the stage window to center the stage on the current object.
es: Usar el botón **Enfocar en nodo actual** (|focus_on_current|) en la esquina inferior izquierda del Diagrama, para centrar la vista en el nodo actual.

source: Use the **Reorder Nodes** button (|reorder_nodes|) in the bottom bar of the stage window to change the position of the nodes in the schematic to a default arrangement.
es: Usar el botón **Reordenar nodos** (|reorder_nodes|) en la esquina inferior izquierda del Diagrama, para reorganizar automáticamente los nodos en el Diagrama.

source: Use the **Reset Size** button (|reset|) in the bottom bar of the stage window, or use the reset view shortcut (by default the 0 key) to display all the objects at the default size.
es: Usar el botón **Restablecer tamaño** (|reset|) en la esquina inferior izquierda del Diagrama (o su atajo predefinido **Alt + 0**), para visualizar todos los nodos a su tamaño predefinido.

source: **To add a column/layer:**
es: **Para agregar una columna/capa:**

source: Load or create some content for the Xsheet column (Timeline layer): it will be automatically displayed in the Stage Schematic.
es: Cargar o crear contenido en una columna de la Planilla (o capa de la Línea de tiempo): se creará el nodo correspondiente en el Diagrama.

source: **To add a pegbar:**
es: **Para agregar una barra de sujeción:**

source: Click the **New Pegbar** button (|pegbar|) in the bottom bar of the Stage Schematic window.
es: Hacer clic en el botón **Nueva barra de sujeción** (|pegbar|) en la esquina inferior derecha del Diagrama de escenario.

source: Right-click in the Stage Schematic and choose **New Pegbar** from the menu that opens.
es: Hacer clic derecho en el Diagrama de escenario y elegir **Nueva barra de sujeción** en el menú.

source: **To add a camera:**
es: **Para agregar una cámara:**

source: Click the **New Camera** button (|camera|) in the bottom bar of the Stage Schematic window.
es: Hacer clic en el botón *Nueva cámara** (|camera|) en la esquina inferior derecha del Diagrama de escenario.

source: Right-click in the Stage Schematic and choose **New Camera** from the menu that opens.
es: Hacer clic derecho en el Diagrama de escenario y elegir **Nueva cámara** en el menú.

source: **To set the active camera:**
es: **Para establecer la cámara activa:**

source: In the Stage Schematic right-click the camera node you want to set as active and choose **Activate** from the menu that opens.
es: En el Diagrama de escenario, hacer clic derecho sobre el nodo de cámara que se desee transformar en activo y elegir **Activar** en el menú.

source: **To rename an object:**
es: **Para renombrar un objeto:**

source: Ctrl + double-click the node name and type a new one.
es: Hacer Ctrl + doble clic sobre el nombre del nodo que se desee renombrar.

source: **To minimize or maximize column/layer nodes:**
es: **Para minimizar o maximizar los nodos de una columna/capa:**

source: Click the arrowhead button to the left of the node name to minimize/maximize it selectively.
es: Hacer clic sobre el botón con forma de flecha, en la esquina superior izquierda del nodo, para minimizarlo o maximizarlo selectivamente.

source: Click the **Maximize Nodes** (|maximize|) button in the bottom bar of the Stage Schematic pane to minimize/maximize all of the nodes.
es: Hacer clic en el botón **Maximizar nodos** (|maximize|) en la esquina inferior izquierda del Diagrama, para maximizar/minimizar todos los nodos.

source: **To select objects and links:**
es: **Para seleccionar objetos y líneas de vínculo:**

source: Click to select an object.
es: Hacer clic en un nodo para seleccionar el objeto.

source: Click and drag to select a group of objects.
es: Hacer clic y arrastrar para seleccionar un grupo de nodos.

source: Ctrl-click (PC) or Cmd-click (Mac) to add an object to, or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o quitar un nodo de la selección.

source: Links can be selected together with objects (see :ref:`Linking Objects <linking_objects>` ).
es: Es posible seleccionar líneas de vínculo conjuntamente con nodos (ver :ref:`Vinculación de objetos <linking_objects>` ).

source: **To move the selection:**
es: **Para mover los nodos de una selección:**

source: Click and drag any object of the selection.
es: Hacer clic y arrastrar cualquier nodo de la selección.

source: **To edit an objects selection:**
es: **Para editar una selección de objetos:**

source: Use the **Copy** command to keep the selection in memory for further operations.
es: Usar el comando **Copiar** para mantener en memoria la selección para operaciones futuras.

source: Use the **Cut** command to eliminate the nodes selection from the Stage Schematic and keep them in memory for further operations.
es: Usar el comando **Cortar** para eliminar la selección de nodos del Diagrama de escenario y mantenerla en memoria para operaciones futuras.

source: Use the **Paste** command to paste the selection kept in memory in the Stage Schematic: the pasted selection will be linked to the same object to which the copied or cut objects were linked.
es: Usar el comando **Pegar** para pegar la selección en memoria, en el Diagrama de escenario: la selección pegada estará vinculada al mismo nodo al cual se encontraban vinculados los nodos cortados/copiados previamente.

source: Use the **Delete** command to delete the selection.
es: Usar el comando **Borrar** para borrar los nodos seleccionados.

source: All of these commands are available in the menu that opens when right-clicking nodes and links.
es: Todos estos comandos también se encuentran disponibles en el menú contextual que se invoca al hacer clic derecho sobre los nodos y líneas de vínculo.

source: The table and the default camera cannot be removed from the Stage Schematic.
es: La mesa y la última cámara no podrán ser eliminadas del Diagrama de escenario.

source: **To Group selected objects:**
es: **Para Agrupar los objetos seleccionados:**

source: Right-click any selected nodes and choose **Group** from the menu that opens.
es: Hacer clic derecho sobre uno de los nodos seleccionados y elegir **Agrupar** en el menú.

source: Nodes can only be grouped if they share the parent node, and the parent node is included in the selection.
es: Sólo será posible agrupar nodos que compartan un mismo nodo superior, si el mismo también forma parte de la selección.

source: **To open a Group:**
es: **Para abrir un Grupo:**

source: Right-click the group and choose **Open Group** from the menu that opens: the group objects are displayed in a box, showing links between group nodes, and links with nodes outside of the group.
es: Hacer clic derecho sobre el grupo y elegir la opción **Abrir grupo** en el menú: el grupo de nodos será mostrará dentro de un marco, pudiendo verse tanto los vínculos entre los nodos del grupo, como los vínculos con nodos externos al mismo.

source: In the Stage Schematic, when the content of a group is displayed it's not possible to edit the links between group nodes, and links with nodes outside of the group.
es: En el Diagrama, mientras se esté visualizando el contenido de un grupo, no será posible editar los vínculos entre los nodos del grupo, ni los vínculos con otros nodos, externos al mismo.

source: **To close a Group:**
es: **Para cerrar un Grupo:**

source: Click the **Close button** on the right of the group box bar.
es: Hacer clic sobre el botón de **Cerrar grupo** en la esquina superior derecha del marco del grupo.

source: **To release a Group:**
es: **Para disolver un Grupo:**

source: Right-click the group and choose **Ungroup** from the menu that opens.
es: Hacer clic derecho sobre el nodo del grupo y elegir **Desagrupar** en el menú.

source: **To reorder nodes in the Stage Schematic:**
es: **Para reordenar los nodos en el Diagrama de escenario:**

source: Click the **Reorder Nodes** button (|reorder_nodes|) in the bottom bar of the stage window.
es: Usar el botón **Reordenar nodos** (|reorder_nodes|) en la esquina inferior izquierda del Diagrama.

source: Linking Objects
es: Vinculación de objetos

source: Objects can be linked in order to create shared movements (movements that all the linked objects share with the parent object) and relative movements (movements that are the sum of the object's own movement and the movement of its parent object).
es: Es posible vincular objetos, formando relaciones jerárquicas entre ellos, para crear movimientos compartidos (movimientos que todos los objetos vinculados compartirán con su objeto superior), así como movimientos relativos (movimientos que serán la suma del propio movimiento del objeto y el de su objeto superior).

source: As parent objects can be linked, in their turn, to other moving objects, it is possible to define a complex hierarchy of transformations.
es: Como los objetos superiores, a su vez, podrán ser vinculados a otros objetos en movimiento, será posible obtener una jerarquía compleja de transformaciones.

source: The hierarchy between objects can be edited by setting links that allow you to set parent and linked objects: columns/layers can be linked to other columns/layers, pegbars, the table or cameras; pegbars can be linked to other pegbars, the table or cameras; cameras can be linked to any object in order to create complex shots, for example with a camera following the movement of a character in the scene.
es: Será posible editar una jerarquía de objetos, estableciendo vínculos que permitan definir objetos superiores y subordinados: las columnas/capas podrán ser vinculadas a otras columnas/capas, barras de sujeción, la mesa o cámaras; las barras de sujeción podrán ser vinculadas a otras barras de sujeción, la mesa o cámaras; las cámaras podrán ser vinculadas a cualquier tipo de objeto para crear tomas complejas, por ejemplo para obtener una cámara que siga a un personaje de la escena.

source: Links can be set by using the ports located at each side of the object node:
es: Es posible usar los conectores, ubicados a cada lado de los nodos, para definir sus vínculos:

source: The **port on the left** is for linking the object to a **parent** object.
es: El **conector de la izquierda** permitirá vincular un nodo a su nodo **superior**.

source: The **port on the right** is for linking the object to a **child** object.
es: El **conector de la derecha** permitirá vincular un nodo a un nodo **subordinado**.

source: The **port at the bottom** is for assigning the object a **motion path** to follow (see for :ref:`Creating a Movement along a Motion Path <creating_a_movement_along_a_motion_path>` ).
es: El **conector inferior** permitirá asignar una **trayectoria de movimiento** al nodo (ver for :ref:`Creación de movimiento a lo largo de una trayectoria <creating_a_movement_along_a_motion_path>` ).

source: Links can also be selected in order to be deleted: when selected, links are highlighted; when at least one object is selected, the related links are displayed in blue.
es: También es posible seleccionar las líneas de vínculo entre nodos, para poder ser borradas: al estar seleccionadas, se mostrarán resaltadas; cuando hubiera al menos un nodo seleccionado, sus líneas de vínculo correspondientes serán mostradas en *cian*.

source: Columns/layers and pegbars are always linked, at least to the table: this means that their links cannot be deleted, but only replaced with different ones or restored to their default: the table.
es: Tanto los nodos de las columnas/capas, como los de las barras de sujeción, estarán al menos vinculados a la mesa; esto significa que sus líneas de vínculo no podrán ser borradas, sino simplemente reemplazadas con otras distintas o restablecidas a su estado predefinido: conectadas a la mesa.

source: **To link a node to another:**
es: **Para vincular un nodo a otro:**

source: In the Stage Schematic, click and drag from a node's left port to the parent node's right port, or viceversa.
es: En el Diagrama de escenario, hacer clic y arrastrar desde el conector izquierdo de uno de los nodos hacia el conector derecho del nodo superior, o viceversa.

source: **To link a column/layer to another object:**
es: **Para vincular una columna/capa a otro objeto:**

source: Do any of the following:
es: Realizar alguna de las siguientes acciones:

source: Define the link in the Stage Schematic.
es: Definir el vínculo en el Diagrama de escenario.

source: Select the **Animate** tool (|animate|) with the **Pick:** option set to **Column**, and in the viewer **Shift-click** the column contents to which you want to link the current column.
es: Usando la herramienta **Animar** (|animate|) en modo **Todo** y con su opción **Seleccionar:** en **Columnas**, en el Visor hacer **Mayúsculas-clic** sobre el contenido de la columna/capa a la cual se desee vincular la columna actual.

source: **To select the linked object to edit in the hierarchy:**
es: **Para seleccionar un objeto vinculado a otro en una jerarquía:**

source: Select it in the Stage Schematic.
es: Seleccionarlo en el Diagrama de escenario.

source: Use the **Animate** tool (|animate|) with the **Pick:** option set to **Pegbar** to click a drawing in the viewer and select the first pegbar in the hierarchy the column containing the drawing is linked to.
es: Usando la herramienta **Animar** (|animate|) en modo **Todo** y con su opción **Seleccionar:** en **Barras de sujeción**, en el Visor hacer clic sobre un dibujo para seleccionar la primera barra de sujeción a la que éste se encontrara vinculado.

source: Right-click a drawing in the viewer to choose from the menu that opens the **Select** command related to the object that you want to edit.
es: Hacer clic derecho sobre un dibujo en el Visor y elegir desde el menú emergente el comando **Seleccionar** correspondiente al objeto que se desee editar en su jerarquía.

source: **To select links:**
es: **Para seleccionar líneas de vínculo:**

source: Click to select a link.
es: Hacer clic para seleccionar una línea de vínculo.

source: Click and drag to select several links.
es: Hacer clic y arrastrar para seleccionar varias líneas de vínculo.

source: Ctrl-click (PC) or Cmd-click (Mac) to add a link to, or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o quitar una línea de vínculo a la selección.

source: Objects can be selected together with links (see :ref:`Using the Stage Schematic <using_the_stage_schematic>` ).
es: Es posible seleccionar objetos conjuntamente con líneas de vínculo (ver :ref:`Uso del Diagrama de escenario <using_the_stage_schematic>` ).

source: **To remove selected links:**
es: **Para eliminar las líneas de vínculo seleccionadas:**

source: Choose Edit → **Delete**, links will be replaced by default ones (i.e to the table).
es: Elegir Editar → **Borrar**, las líneas de vínculo serán reemplazadas con vínculos predefinidos (esto es, a la mesa).

source: Advanced Linking
es: Vinculación avanzada

source: Optionally, the connector ports can be displayed as letters (instead of the default circles), to be able to control, in more advanced ways, the position of the centers to be used when linking the nodes:
es: De forma opcional, será posible mostrar los conectores de los nodos, en forma de letras (en vez de los círculos predefinidos), para posibilitar un control más avanzado de la posición de los centros a ser usados al vincular nodos:

source: Center **B** is the geometrical center of each object (and the default connection option).
es: El centro **B** representa al centro geométrico de cada objeto (y es la opción de conexión predefinida entre nodos).

source: Center **A** is placed 8 inches to the left.
es: El centro **A** se encuentra ubicado 8 pulgadas a la izquierda del centro geométrico.

source: Center **C** is placed 8 inches to the right.
es: El centro **C** se encuentra ubicado 8 pulgadas a la derecha del centro geométrico.

source: When a link is created, the letters at its ends set the way the linked object overlaps with the parent object. If at both ends of the link you set the same letter, the two objects will overlap with no offset respect to their default centers; while if for example, a column centered on B is linked to a pegbar centered on A, it will have an offset of 8 inches to the left.
es: Cuando se crea un vínculo, las letras en sus extremos definirán la forma en que el objeto subordinado se ubicará con respecto al objeto superior en la jerarquía. Si en ambos extremos se define la misma letra, ambos objetos se posicionarán con respecto a sus centros, sin ningún desplazamiento; mientras, que por ejemplo si una columna/capa centrada en B es subordinada a una barra de sujeción centrada en A, dicha columna/capa tendrá un desplazamiento de 8 pulgadas hacia la izquierda, con respecto a su centro geométrico.
