Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: es

source: Apart from letters, columns have also numbered centers as well; these serve for setting links relative to the position of Hooks assigned to these columns (see :ref:`Using Hooks <using_hooks>` ).
es: Además de letras, el centro de las columnas/capas también podrá contener números; estos servirán para definir centros relativos a la posición de Enganches que hayan sido asignados a estas columnas (ver :ref:`Uso de Enganches <using_hooks>` ).

source: Center **1** is the center defined by hook number 1.
es: El centro **1** es el centro definido por el enganche número 1.

source: Center **2** is the center defined by hook number 2.
es: El centro **2** es el centro definido por el enganche número 2.

source: While in this mode, each node will have always a free connector port available in order to accept a link to a different center. In this way if you want to link another object to the same parent object, you can choose whether to use the same center or a different one.
es: En este modo de visualización de conectores, siempre existirá un conector libre, para que sea posible aceptar conexiones usando otros centros. De esta forma si se deseara vincular otro nodo al mismo nodo superior, será posible elegir si usar el mismo centro o uno nuevo.

source: By defining parent and child objects you can also create cutout animation (see :ref:`Creating Cutout Animation <creating_cutout_animation>` ).
es: Mediante la definición de jerarquías de objetos será posible instrumentar una animación de recortes (ver :ref:`Creación de animación de recortes <creating_cutout_animation>` ).

source: **To switch the connector ports display mode:**
es: **Para cambiar el modo de visualización de los conectores:**

source: Click the **Switch Output Port Display Mode** button (|switch_output_port|) in the bottom bar of the Stage Schematic pane until you see the letters on each side of the nodes, instead of the default circles.
es: Hacer clic en el botón **Cambiar visualización de puertos de salida** (|switch_output_port|) en la barra inferior del Diagrama de escenario, hasta que se vean letras en los conectores, en vez de los círculos predefinidos.

source: **To set the center of an object:**
es: **Para definir el centro de un objeto:**

source: Place the mouse pointer over the object left port and wait for the double-arrow button to appear.
es: Posar el puntero del ratón sobre el conector izquierdo del nodo y esperar a que aparezca un pequeño botón con forma de doble flecha, a un lado del conector.

source: Click and **drag up or down the double-arrow** button to scroll the options available: letters and numbers for columns, and letters for all the other types of objects.
es: Hacer clic sobre la doble flecha y **arrastrar hacia arriba/abajo** para recorrer las opciones disponibles: letras y números en el caso de columnas/capas y únicamente letras para los otros tipos de objetos.

source: **To set the way a child object overlaps its parent object:**
es: **Para definir la forma en que un objeto se posicionará en relación al objeto superior en la jerarquía:**

source: Set the *same letter* for the two ports at the end of a link to overlap the objects without an offset.
es: Definir la **misma letra** para ambos conectores, en los extremos de una línea de vínculo, para que no haya desplazamiento entre ellos.

source: Set the *following letter* in alphabetical order on the **left port** of the **child object** to offset it to the left: for each successive letter there is an offset of 8 inches to the left.
es: **Para desplazar hacia la izquierda** al objeto subordinado, definir la letra siguiente en orden alfabético, en *su conector izquierdo*: por cada letra sucesiva habrá un desplazamiento progresivo del objeto subordinado de 8 pulgadas hacia la izquierda.

source: Set the *following letter* in alphabetical order on the **right port** of the **parent object** to offset it to the right: for each successive letter there is an offset of 8 inches to the right.
es: **Para desplazar hacia la izquierda** al objeto subordinado, definir la letra siguiente en orden alfabético, en *su conector izquierdo*: por cada letra sucesiva habrá un desplazamiento progresivo del objeto subordinado de 8 pulgadas hacia la izquierda.

source: Using Hooks
es: Uso de Enganches

source: Hooks are reference points that can be defined for any animation level directly in the viewer, by using the **Hook** tool (|hook|).
es: Los enganches son puntos de referencia que pueden ser definidos para cualquier nivel de animación, directamente en el Visor, usando la herramienta **Enganche** (|hook|).

source: Once defined for a column/layer, they can be used in the Stage Schematic to link another object to it in relation to a specific hook, or to move it, according to any of its hook sets.
es: Una vez definidos para una columna/capa, los enganches pueden ser usados en el Diagrama de escenario para subordinar otros objetos a ellos, así como para lograr que el propio nivel donde se encuentra definido un enganche se desplace de acuerdo a los cambios de posición del mismo.

source: In the first case the hook is used as a tracking point to link another object (a column/layer or camera) to a specific feature of the animation level. For example, if you have a character carrying a lamp, you can track the lamp position with a hook, and link a radial gradient to it (placed over the lamp for every frame of the animation) to create a glow.
es: En el primer caso, el enganche será usado como un punto de rastreo, para subordinar otro objeto (columna/capa, cámara, etc.) a una parte específica de un nivel de animación. Por ejemplo, si se tuviera un personaje llevando una lámpara, será posible rastrear la posición de la lámpara utilizando un enganche y subordinar un gradiente al enganche (que quedará superpuesto a la posición de la lámpara en cada fotograma de la animación) para crear un halo.

source: In the second case, the hook is used as the center of the column/layer where the hooked level will be exposed, thus creating a different center and offset for each level frame. For example, if you have a walking animation cycle, you can set a new center following the character’s feet with a hook, and make the level move accordingly to prevent a moon-walking effect on the background.
es: En el segundo caso, el enganche será usado como centro de la propia columna/capa donde éste se encuentre definido, posibilitando así la animación del centro del nivel en cada fotograma. Por ejemplo, si se tuviera un ciclo de animación de una caminata, será posible definir (usando un enganche) un nuevo centro que siga a la posición de los pies del personaje, y hacer que el nivel se desplace como corresponda para evitar que los pies del personaje patinen con respecto al suelo.

source: Hooks can also be split and passed from one drawing feature to another, automatically creating an offset position. For example, the hook following the character’s foot feature can pass from one foot to another, in order to make the character move continuously onward.
es: Es posible hacer que un enganche se divida, para pasar de una parte a otra de un dibujo, creando automáticamente un desplazamiento en su posición. Por ejemplo, un enganche que esté siguiendo a la posición de uno de los pies de un personaje, podrá ser pasado al otro pie, para hacer que el personaje tenga un movimiento constante de avance.

source: The hook set 2 follows the lamp, while the hook set 1 follows the character’s feet, passing from one feet to another when both are on the ground.
es: El enganche 2 sigue a la lámpara, mientras que el 1 a los pies del personaje, pasando de un pie al otro cuando ambos se encuentran en el suelo.

source: A hook can be created starting from any frame. Once it is created, it will appear on the following level frames in the same position, from where it can be moved.
es: Es posible crear un enganche a partir de cualquier fotograma. Una vez creado, aparecerá en todos los fotogramas en la misma posición, desde donde podrá ser movido.

source: You can use up to 20 hooks for each level; each hook is labeled with a number, to reference it in each level frame.
es: Es posible definir hasta 20 enganches para cada nivel; cada enganche se encontrará etiquetado con un número, para poder seguir su pista en los diferentes fotogramas del nivel, así como en las operaciones de vinculación en el Diagrama de escenario.

source: By activating the **Snap** option, hooks for the current level can be accurately placed by snapping them exactly to the same position of hooks defined for the other animation levels visible in the viewer. In case the current level is a Toonz Vector level, hooks will snap also to the center of any closed shapes it may contain (e.g. rectangles, circles or single vector shapes closed with the Tape tool). This option may prove useful especially when defining hooks for cutout animation models (see :ref:`Creating Cutout Animation <creating_cutout_animation>` ).
es: Al activar la opción **Adherencia**, será posible ubicar de forma precisa enganches en el nivel actual adhiriéndolos de forma exacta a las posiciones de enganches definidos en otros niveles de animación visibles en el Visor. En caso de que el nivel actual sea un nivel Vectorial de Toonz, los enganches también se adherirán al centro de cualquier figura cerrada que pueda contener el mismo (p.ej: rectángulos, círculos o figuras libres creadas a partir de un solo trazo y cerradas mediante la herramienta Cinta). Esta opción puede resultar útil especialmente al definir enganches cuando se construyen modelos para animación de recortes (ver :ref:`Creación de animación de recortes <creating_cutout_animation>` ).

source: Hook information is saved along with each level, as a file in XML format, named as the file but with the *_hooks* suffix. For example, hooks defined for the level ``mouse`` will be saved in the file ``mouse_hooks.xml`` .
es: La información de enganches es guardada conjuntamente con cada nivel, como un archivo XML llamado de igual forma que el nivel con el sufijo *_hooks*. Por ejemplo, los enganches definidos para el nivel ``ratón`` serán almacenados en el archivo ``ratón_hooks.xml`` .

source: Hooks are also visible in Onion Skin mode (see :ref:`Using Onion Skin <using_onion_skin>` ).
es: Los enganches también serán visibles en el modo Piel de cebolla (ver :ref:`Uso de piel de cebolla <using_onion_skin>` ).

source: Hooks can be also used to create a cutout animation model, as they allow you to link the model sections according to specific pivot points (see :ref:`Creating Cutout Animation <creating_cutout_animation>` ).
es: También será posible usar enganches durante la creación de un modelo para animación de recortes, ya que posibilitarán vincular las distintas secciones del modelo usando puntos de pivote específicos (ver :ref:`Creación de animación de recortes <creating_cutout_animation>` ).

source: **To define a hook for a level:**
es: **Para definir un enganche para un nivel:**

source: Select a frame from the level you want to set hooks for.
es: Seleccionar un fotograma del nivel para el cual se desee definir enganches.

source: Choose the **Hook** tool (|hook|).
es: Elegir la herramienta **Enganche** (|hook|).

source: Click to create a hook and drag to define the hook starting position.
es: Hacer clic para crear un enganche y arrastrar para definir su posición.

source: Click elsewhere to create another hook and the related hook starting position.
es: Hacer clic en otro lugar para crear otro enganche y definir su posición.

source: **To select hooks:**
es: **Para seleccionar enganches:**

source: Click a hook to select it.
es: Hacer clic sobre un enganche para seleccionarlo.

source: Ctrl-click (PC) or Cmd-click (Mac) to add a hook to, or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o quitar un enganche de la selección.

source: **To move selected hooks:**
es: **Para mover los enganches seleccionados:**

source: Drag them to a new position.
es: Arrastrar la selección hasta una nueva posición.

source: **Shift-drag** to constrain an horizontal or vertical movement.
es: **Mayúsculas-arrastrar** para restringir el movimiento a las dimensiones horizontal o vertical.

source: Activate the **Snap** option to place the hook exactly at the same position of hooks defined for other animation levels visible in the viewer, or in case the level is a Toonz Vector level, also at the center of closed shapes.
es: Activar la opción **Adherencia** para ubicar el enganche de forma precisa en la posición de enganches definidos en otros niveles de animación visibles en el Visor. En caso de que el nivel actual fuera un nivel Vectorial de Toonz, los enganches también se adherirán al centro de cualquier figura cerrada.

source: **To pass a hook from one position to another:**
es: **Para pasar un enganche de una posición a otra:**

source: **Alt-click and drag** the hook to split it into two.
es: Hacer **Alt-clic y arrastrar** el enganche para dividirlo en dos.

source: Place the **double circle** where the hook has to be for the current frame.
es: Ubicar el **círculo** donde el enganche deba estar en el fotograma actual.

source: Place the **cross** where you want the reference point to be from the next frame onwards.
es: Ubicar la **cruz** donde el enganche deba estar a partir del fotograma siguiente.

source: **To delete a hook:**
es: **Para borrar un enganche:**

source: Select the related hook in any frame and choose Edit → **Delete**.
es: Seleccionar el enganche correspondiente en cualquier fotograma y elegir Editar → **Borrar**.

source: **To link an object to a level hook:**
es: **Para vincular un objeto a un enganche de otro nivel:**

source: Link the object to the column containing the hook.
es: Vincular el objeto a la columna/capa que contenga el enganche deseado.

source: Place the mouse pointer over the column right port and wait for the double-arrow button to appear.
es: Ubicar el puntero del ratón sobre el conector derecho del nodo de la columna/capa y esperar a que aparezca el pequeño botón con las flechas.

source: **Click and drag up** the double-arrow button to scroll the numbers available before letter A, and release the mouse button to define the hook number to be used.
es: Hacer **clic y arrastrar hacia arriba** el botón para recorrer los números disponibles antes de la letra A y soltar en el número de enganche que se desee usar.

source: Column 3 is linked to the hook set 2 of column 2, while column 2 is moving according to its own hook set 1.
es: La columna 3 se encuentra subordinada al enganche № 2 de la columna 2, a la vez que ésta se encuentra vinculada usando su propio enganche № 1 como centro.

source: **To make the level move according to one of its hooks:**
es: **Para hacer que un nivel use uno de sus enganches como centro:**

source: Place the mouse pointer over the left port of the column containing the hook, and wait for the double-arrow button to appear.
es: Ubicar el puntero del ratón sobre el conector izquierdo de la columna/capa que contenga el enganche y esperar hasta que aparezca el pequeño botón con las flechas.

source: **Click and drag up** the double-arrow button to scroll the numbers available before letter A, and release the mouse button to define the hook to be used.
es: Hacer **clic y arrastrar hacia arriba** el botón para recorrer los números disponibles antes de la letra A y soltar en el número de enganche que se desee usar.

source: **To prevent an animation walking cycle from moon-walking:**
es: **Para evitar que un ciclo de caminata resbale en el suelo:**

source: Define a hook by following these guidelines:
es: Definir un enganche siguiendo la siguiente guía:

source: Place the hook on the *same foot feature* along the whole sequence, for example the tip of the foot.
es: Ubicar el enganche para que siga a *la misma parte del pie* en toda la secuencia, por ejemplo a su punta.

source: If the character is supposed to be moving horizontally on the ground, *the hook should always lie on the ground line* (without changing its vertical position along the sequence). If the feature you are following leaves the ground, still place the hook on the ground line, under the feature you were following.
es: Si, por ejemplo, se supone que el personaje deba estar moviéndose horizontalmente sobre el suelo, *el enganche debería permanecer siempre en la línea del suelo* (sin cambios en su posición vertical a lo largo de la secuencia). Aún en caso de que la parte que el enganche esté siguiendo deje su contacto con el suelo, el enganche debería permanecer en la línea del suelo, directamente por debajo de la parte que se encuentre siguiendo.

source: When both feet are on the ground line you can split the hook to pass it form one foot to the other.
es: En el instante en que ambos pies estuvieran sobre el suelo, será posible dividir el enganche en dos, para pasarlo desde un pie hacia el otro.

source: If the animation is a cycle and you want the character to keep on walking, the last hook position has to be connected to the first one, and the hook has to pass from one foot to the other by splitting it, and then to the first one again by splitting it again.
es: Si la animación se tratara de un ciclo y se deseara que el personaje se mantuviera avanzando, la última posición del enganche deberá estar conectada con la primera del ciclo y el enganche ser dividido para poder pasar de un pie al otro, también en el primer fotograma deberá ser dividido para completar el pasaje.

source: Tracking Points
es: Rastreo de puntos

source: It is possible to automatically track specific regions in a sequence of images by using the **Tracker** tool (|tracker|). The results of the tool are a series of hooks that can be used to link an object to another (see above).
es: Es posible rastrear automáticamente regiones específicas de una secuencia, usando la herramienta **Punto de rastreo** (|tracker|). Mediante la misma será posible definir una serie de enganches que podrán ser usados para subordinar objetos (ver más arriba).

source: When selected, the Tracker tool (|tracker|) allows you to define one or several regions in an image, by defining a center and a size; regions can also be connected to one another to better track points having a visual geometrical relationship. The region defined with the tool sets both, the *pattern* that the tracking system will try to recognize in the following images, and the *size* of the search area where it will look for it (that will be of approximately twice that region).
es: Al estar seleccionada, la herramienta **Punto de rastreo** (|tracker|) permitirá establecer una o más regiones de una imagen, definiendo un centro y un área a su alrededor; las regiones también podrán estar conectadas entre sí, para poder rastrear de mejor manera puntos que posean una relación geométrica visible mutua. La región definida por medio de esta herramienta servirá tanto para definir el *patrón* de imagen que el sistema de rastreo intentará reconocer en las imágenes sucesivas, como el tamaño del *área de búsqueda* alrededor del mismo, donde intentará encontrarlo (y que será de aproximadamente el doble del tamaño de la región definida).

source: Once areas to be tracked are defined in the first frame of a range, it's possible to automatically track the regions in a selected range, by specifying the following options:
es: Una vez que se hayan definido las regiones a ser rastreadas en el primer fotograma del rango, será posible rastrearlas automáticamente a lo largo del mismo, especificando las siguientes opciones:

source: **Threshold** sets the amount of difference between the defined pattern and the recognized one. When using low values, the tracking system will look for an area with an almost identical pattern, and when using high values, will look for an area that can be quite different from the original one. This means that if the value is too low, it’s more likely for the tracking to fail on certain images; if too high, the tracking may fail by following the wrong areas.
es: **Umbral:**, permite definir el nivel de diferencia aceptable entre el patrón de búsqueda definido y la zona reconocida. Cuando se usen valores bajos, el sistema de rastreo buscará un área con un patrón casi idéntico, mientras que cuando se usen valores altos, buscará un área que podrá contener muchas más diferencias, con respecto al patrón original. Esto significa que si el valor fuera demasiado bajo, será más probable que el rastreo falle en ciertas imágenes; y si fuera muy alto, el rastreo podrá fallar al seguir zonas erróneas.

source: **Sensitivity** sets how often the defined pattern has to be updated according to the variation it may have in the following images. For the maximum value, the pattern will be updated after each image is tracked.
es: **Sensibilidad:**, permite definir qué tan frecuentemente se deberá actualizar el patrón de búsqueda, de acuerdo a las variaciones que puedan presentarse en las imágenes sucesivas. En su valor máximo, el patrón se actualizará luego de que cada imagen sea rastreada.

source: **Variable Region Size**, when activated, will look for the defined pattern considering also the different sizes that it can have in the following images.
es: **Regiones de tamaño variable**, cuando se encuentre activada, permitirá la búsqueda del patrón definido, considerando también que pueda presentarse en distintos tamaños en los fotogramas sucesivos.

source: **Include Background**, when activated, it considers the background as part of the defined pattern. It can be deactivated when tracking an element whose background does not affect the pattern, such as a green/blue screen background.
es: **Incluir el fondo**, cuando se encuentre activado, permitirá considerar el fondo como parte del patrón definido. Podrá ser desactivado cuando se esté rastreando un elemento cuyo fondo no afecte al patrón (p.ej: un fondo de color verde o azul).

source: **To define a region to be tracked:**
es: **Para definir una región a ser rastreada:**

source: Choose the **Tracker** tool (|tracker|) and click and drag in the image.
es: Elegir la herramienta **Punto de rastreo** (|tracker|) y hacer clic y arrastrar sobre la imagen.

source: Use the handles along the defined region bounding box to resize it.
es: Usar las asas en los bordes de la región para redimensionarla.

source: Click and drag elsewhere to define a second region: the center of the region will be labelled with a different letter.
es: Hacer clic y arrastrar en cualquier otra parte para definir una segunda región: el centro de la región estará etiquetado con una letra diferente.

source: **To define a region connected to another one:**
es: **Para definir una región conectada a otra ya existente:**

source: Choose the **Tracker** tool (|tracker|) and **select the region** to which you want to connect another region.
es: Elegir la herramienta **Punto de rastreo** (|tracker|) y **seleccionar una región ya existente** a la que se desee conectar la nueva región.

source: Click and drag elsewhere to define a connected region: the center of the region will be labelled with the same letter of the first one.
es: Hacer clic y arrastrar en otra parte para definir una nueva región conectada a la anterior: el centro de la región estará etiquetado con la misma letra que la región seleccionada en primera instancia.

source: **To delete a defined region:**
es: **Para borrar una región anteriormente definida:**

source: Choose the **Tracker** tool (|tracker|) and select the region you want to delete.
es: Elegir la herramienta **Punto de rastreo** (|tracker|) y seleccionar la región que se desee borrar.

source: Choose Edit → **Delete**.
es: Elegir Editar → **Borrar**.
