Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: es

source: Keys can also be removed or navigated by working in the Function Editor (see :ref:`Editing Curves and Numerical Columns <editing_curves_and_numerical_columns>` ).
es: También será posible eliminar o recorrer fotogramas clave usando el Editor de funciones (ver :ref:`Edición usando la planilla de valores y curvas <editing_curves_and_numerical_columns>` ).

source: **To customize the Animate tool options bar:**
es: **Para personalizar la barra de opciones de la herramienta Animar:**

source: Use the **Tool Mode:** dropdown menu to choose from one of its modes: Position, Rotate, Scale, Shear, Center or All: only the options for the selected transformation category will be displayed.
es: Usar el menú desplegable de Modo de la herramienta, para elegir uno de sus modos: Posición, Rotación, Escala, Inclinación, Centro o Todo: únicamente se mostrarán las opciones correspondientes al modo elegido.

source: Use the **Lock** button (|lock|) to choose which transformations have to be locked while transforming the object: only selected items will be locked.
es: Usar el botón de **Bloqueo** (|lock|) para elegir qué transformaciones deberán permanecer bloqueadas mientras se usa el manipulador en el Visor para transformar al objeto: sólo se bloquearán los elementos seleccionados.

source: Changing Stacking Order of Columns/Layers
es: Cambio del Orden de composición de las columnas/capas

source: The column/layer stacking order, which sets which drawings and images are placed on top or behind, other images, by default depends on how columns/layers are placed in the Xsheet/Timeline: Xsheet direction is from left to right, while Timeline direction is from bottom to top, making what's on the left/bottom to be behind of what's on the right/top.
es: El orden de composición de las columnas/capas, que determina que un dibujo sea compuesto por delante o detrás de otros, de forma predefinida dependerá de cómo se encuentren ordenadas las columnas en la Planilla (o las capas en la Línea de tiempo). La dirección de composición de la Planilla es de izquierda a derecha, mientras que en la Línea de tiempo es de abajo hacia arriba, en donde las columnas que se encuentren a la izquierda (o las capas que se encuentren abajo) serán compuestas por debajo de las que se encuentren a la derecha/arriba.

source: This would mean that if an animation element has to move behind another animation element and then in front of it, it'd have to be exposed in two different columns, one before and one after the column containing the second animation element.
es: Normalmente esto significaría que si un elemento debiera moverse desde atrás de un objeto hacia adelante del mismo, debería ser expuesto en dos distintas columnas, una colocada antes y otra después del segundo objeto.

source: By editing the **SO** (i.e. stacking order) value it's possible to change and animate the element compositing order without editing the columns/layers position in the Xsheet/Timeline.
es: Mediante la utilización del parámetro **Orden:** será posible cambiar y animar el *orden de composición* del objeto, sin necesitar editar la posición de su columna/capa en la Planilla/Línea de tiempo.

source: The **SO** default value for all the columns is 0, meaning that the Xsheet column (or Timeline layer) order is what's taken into account when there are no modifications to the SO position. As soon as a column/layer has a higher SO value, it will be placed on top, regardless of the position of the column/layer in the Xsheet/Timeline; conversely if the SO value is lower it will be placed behind.
es: El valor predefinido del parámetro **Orden:** para todas las columnas/capas es 0, lo que significará que el orden de la columna/capa en la Planilla/Línea de tiempo será lo que se tome en cuenta, al momento de componerla con las otras. En el momento en que el parámetro Orden contenga un valor positivo, dicha columna/capa será compuesta por encima de todas las que aún tuvieran un valor de 0, mientras que si su valor fuera negativo lo haría por detrás de éstas.

source: In case a column/layer's Z position is edited, columns/layers closer to the camera will be composited on top of others, ignoring both its Xsheet/Timeline order and its SO value (see :ref:`Working in a 3D Environment <working_in_a_3d_environment>` ).
es: En caso de que se hubiera editado la **Posición Z** de una columna/capa, las columnas/capas que se encontraran más cerca de la cámara serán compuestas por encima de las otras, ignorando tanto el valor de la propiedad **Orden:**, como el orden natural de las mismas en la Planilla/Línea de tiempo (ver :ref:`Trabajo en un entorno 3D <working_in_a_3d_environment>` ).

source: **To edit and animate a column/layer SO value:**
es: **Para editar y animar el valor de Orden de una columna/capa:**

source: Select the column/layer to which you want to edit the SO value.
es: Seleccionar la columna/capa a la que se desee editar su Orden.

source: Set the frame where you want to define the key.
es: Definir el fotograma donde se desee marcar el fotograma clave.

source: In the tool options bar enter the value in the **SO** field.
es: En la barra de opciones de la herramienta, ingresar el valor numérico del **Orden:**.

source: Columns/layers **SO** values can also be edited and animated by working in the Function Editor (see :ref:`Editing Curves and Numerical Columns <editing_curves_and_numerical_columns>` ).
es: También será posible editar y animar el **Orden:** de una columna/capa usando el Editor de funciones (ver :ref:`Edición usando la planilla de valores y curvas <editing_curves_and_numerical_columns>` ).

source: Creating a Movement along a Motion Path
es: Creación de movimiento a lo largo de una trayectoria

source: Objects can be moved along a motion path according to two different type of movements: one without changing the object orientation, and the other with an automatic orientation, set according to the direction of the motion path.
es: Es posible mover objetos a lo largo de una trayectoria definida por un trazo vectorial, el movimiento podrá ser de dos tipos: sin modificar la orientación del objeto o con una orientación automática, de acuerdo a la orientación de la trayectoria.

source: A motion path can be assigned to an object node in the Stage Schematic, and it can be defined with drawing tools and edited in the viewer as if it was a vector drawing. Once defined, it's displayed as a dashed red line, with small numbers indicating the control points defining the vector stroke.
es: Será posible asignar una trayectoria a un objeto usando el Diagrama de escenario, ésta podrá ser definida usando las herramientas de dibujo en el Visor, como si se tratara de cualquier trazo vectorial. Una vez definida, la trayectoria será mostrada como una línea discontinua de color *rojo*, con números indicando la posición de los puntos de control que la definen.

source: A motion path assigned to pegbar 2.
es: Una trayectoria asignada a la barra de sujeción Peg2.

source: As soon as a path is assigned to an object's node, the object will be automatically placed at the beginning of the path according to its center, and it will only be able to move along it (and not in the standard X and Y directions anymore).
es: Tan pronto como se asigne una trayectoria al nodo de un objeto, el objeto será automáticamente ubicado al comienzo de la misma (de acuerdo a su Centro) y sólo será posible mover al objeto sobre ella (esto es, ya no será posible moverlo en las direcciones X e Y).

source: The keyframes of the object on the motion path can be defined by dragging the object along it, and they are *expressed as a percentage* where 0% is the starting point and 100% is the ending point of the path.
es: Será posible definir fotogramas clave para el objeto sobre la trayectoria, arrastrándolo sobre la misma. Los valores de Posición serán *expresados como un porcentaje*, donde 0% representa el comienzo de la trayectoria y 100% su final.

source: It's also possible to link the keyframes of the objects to the positions of the control points defining the motion path, so that they remain consistent when the motion path is edited. To help you better understand where the control points are, the object snaps to them when it is dragged along the motion path.
es: También será posible establecer un vínculo entre la posición del objeto y la posición de los puntos de control que definen la trayectoria, de esta forma será posible mantener una consistencia en caso de que la trayectoria necesitara ser editada. Para ayudar a entender mejor dónde se encuentran los puntos de control, el objeto se adherirá a ellos, al ser arrastrado sobre la trayectoria.

source: If you want to change the center of the object, you can move it using the **Animate** tool (|animate|), and then use the **Reset Center** command in the Stage Schematic.
es: Si se deseara modificar el Centro del objeto, será posible moverlo usando la herramienta **Animar** (|animate|), y luego usar el comando **Restablecer centro** en el Diagrama de escenario.

source: A motion path can also be created by copying and pasting a drawing vector stroke, and conversely a drawing vector stroke can be created by copying and pasting a motion path.
es: También será posible crear una trayectoria copiando y pegando un trazo vectorial y, en sentido inverso, será posible crear un dibujo vectorial a partir de una trayectoria de movimiento.

source: **To create a motion path:**
es: **Para vincular un objeto a una nueva trayectoria de movimiento:**

source: Select the object for which you want to define a motion path.
es: Seleccionar el objeto para el cual se desee definir una trayectoria de movimiento.

source: Click the **New Motion Path** button (|new_motion_path|) in the bottom bar of the stage window.
es: Hacer clic en el botón **Nueva trayectoria de movimiento** (|new_motion_path|) en la barra inferior del Diagrama de escenario.

source: Right-click in the stage and choose **New Motion Path** from the menu that opens.
es: Hacer clic derecho en el Diagrama de escenario y elegir **Nueva trayectoria de movimiento** en el menú.

source: **To define and edit a motion path:**
es: **Para crear y editar una trayectoria de movimiento:**

source: Select the motion path node in the stage and do any of the following:
es: Seleccionar el nodo de la trayectoria de movimiento en el Diagrama de escenario y realizar una de las siguientes acciones:

source: Use the drawing tools to define it in the viewer.
es: Usar las herramientas de dibujo para definirla en el Visor.

source: Use the modifier tools to edit it.
es: Usar las herramientas de edición para editarla.

source: Draw a new line, and confirm in the dialog that opens, to replace a previously created motion path with the new one.
es: Dibujar una nueva línea y confirmar en el diálogo emergente, para reemplazar una trayectoria ya existente con la nueva.

source: **To assign a motion path to an object:**
es: **Para asignar una trayectoria de movimiento a un objeto:**

source: Click and drag the motion path top port to the object node bottom port.
es: Arrastrar desde el conector superior del nodo de la trayectoria hasta el conector inferior del objeto.

source: **To remove a motion path from an object:**
es: **Para desconectar una trayectoria de un objeto:**

source: Select the link between the object and the motion path.
es: Seleccionar la línea de vínculo entre el nodo del objeto y el de la trayectoria.

source: **To set the type of movement along a motion path:**
es: **Para definir el tipo de movimiento sobre la trayectoria:**

source: Click the button at *the far left* of the object bottom port to switch between two options: the **Square** button (|square|) will preserve the object's original orientation, and the **Rotated Square** button (|rhomb|) will automatically rotate the object according to the motion path's direction.
es: Hacer clic en el botón *más a la izquierda* del conector inferior del objeto, para alternar entre sus dos opciones: el **Cuadrado** (|square|) mantendrá inalterada la orientación del objeto, mientras el **Rombo** (|rhomb|) permitirá que el objeto rote para mantenerse perpendicular a la trayectoria.

source: **To link the object keyframes to the control points defining the motion path:**
es: **Para vincular los fotogramas clave del objeto a los puntos de control que definen la trayectoria:**

source: Click the button *next to* the object bottom port to activate or deactivate the **Link to Control Points** option (|link_to_control_points|).
es: Hacer clic en el botón *a la izquierda* del conector inferior del objeto, para activar o desactivar la opción **Vincular a puntos de control** (|link_to_control_points|).

source: **To change the center of the object:**
es: **Para cambiar el Centro del objeto:**

source: Move the center of the object to the new position.
es: Mover el Centro del objeto a una nueva posición.

source: Right-click the object node in the Stage Schematic and select **Reset Center** from the menu that opens.
es: Hacer clic derecho sobre el objeto en el Diagrama de escenario y seleccionar la opción **Restablecer centro** en el menú.

source: **To save a motion path:**
es: **Para guardar una trayectoria de movimiento:**

source: Right-click it and select **Save Motion Path** from the menu that opens.
es: Hacer clic derecho sobre su nodo y elegir **Guardar trayectoria de movimiento...** en el menú.

source: In the browser choose a location and a name and click the **Save** button. The file will be saved with the MPATH extension.
es: En el Explorador elegir una ubicación y nombre y hacer clic en el botón **Guardar**. El archivo será guardado con la extensión MPATH.

source: **To load a motion path:**
es: **Para cargar una trayectoria de movimiento:**

source: Right-click the motion path and select **Load Motion Path** from the menu that opens.
es: Hacer clic derecho sobre su nodo y elegir **Cargar trayectoria de movimiento...** en el menú.

source: In the browser retrieve the MPATH file you want to load and click the Load button.
es: En el Explorador obtener el archivo MPATH que se desee cargar y hacer clic en el botón **Abrir**.

source: **To use a drawing vector stroke as a motion path:**
es: **Para usar el trazo vectorial de un dibujo como trayectoria de movimiento:**

source: Select the vector stroke you want to use as a motion path with the **Selection** tool (|selection|).
es: Seleccionar el trazo vectorial que se desee usar como trayectoria de movimiento, mediante la herramienta **Seleccionar** (|selection|).

source: Copy/cut it.
es: Coparlo o cortarlo.

source: Select the motion path you want to paste to, in the Stage Schematic.
es: Seleccionar, en el Diagrama de escenario, la trayectoria de movimiento donde se desee pegarlo.

source: Click in the viewer and paste the copied/cut vector that will automatically become the motion path.
es: Hacer clic en el Visor y pegar el trazo copiado, se convertirá en la trayectoria de movimiento.

source: **To use a motion path as a vector stroke in a drawing:**
es: **Para usar una trayectoria de movimiento como un trazo en un dibujo vectorial:**

source: Select the motion path in the Stage Schematic.
es: Seleccionar la trayectoria en el Diagrama de escenario.

source: Select the motion path with the **Selection** tool (|selection|) in the viewer.
es: Seleccionar la trayectoria, usando la herramienta **Seleccionar** (|selection|) en el Visor.

source: Select the drawing where you want to paste the new stroke.
es: Seleccionar el dibujo donde se desee pegar el nuevo trazo.

source: Paste the copied/cut motion path that will automatically become a stroke.
es: Pegar la trayectoria copiada, se convertirá automáticamente en un trazo vectorial.

source: **To remove a motion path from the Stage Schematic:**
es: **Para eliminar una trayectoria de movimiento del Diagrama de escenario:**

source: Select the motion path node and choose Edit → **Delete**.
es: Seleccionar el nodo de la trayectoria y elegir Editar → **Borrar**.

source: Right-click the motion path node and choose **Delete** from the menu that opens.
es: Hacer clic derecho sobre el nodo de la trayectoria y elegir **Borrar** en el menú.

source: Using Keys in Columns/Layers
es: Uso de claves en columnas/capas

source: When columns/layers are animated, their animation can be controlled in a quick way by managing keyframes and interpolations directly in the Xsheet or Timeline, with no need to use the Function Editor.
es: Cuando se animan columnas/capas, es posible controlar su animación de una manera rápida, manipulando los fotogramas clave y la interpolación entre ellos directamente en la Planilla o la Línea de tiempo, sin necesidad de usar el Editor de funciones.

source: As soon as a keyframe is defined for a column/layer, a **Key icon** is displayed on the right of the column/layer cell to which it refers; the key is displayed regardless of how many parameters are animated. Keys can be moved within the column/layer they refer to, and selected in order to be cut/copied and pasted from one cell to another.
es: Tan pronto como se haya creado un fotograma clave para una columna de la Planilla, se mostrará un **ícono de fotograma clave** del lado derecho de la celda correspondiente (en el caso de la Línea de tiempo, el ícono aparecerá centrado en la celda); el ícono tendrá la misma apariencia, sin importar cuántos parámetros tuvieran claves en ese mismo fotograma. Será posible mover los claves dentro de la columna/capa correspondiente, así como ser seleccionados para poder ser cortados/copiados y pegados de una celda a otra.

source: When the **Global Key** option is activated for the **Animate** tool, and the default interpolation is not set to **Linear**, as soon as at least two keyframes are created for a column, **a line connecting them with two arrowheads** is displayed (see :ref:`Animating Objects <animating_objects>` and :ref:`Setting Segment Interpolations <setting_segment_interpolations>` ). The two arrowheads divide the line into three sections indicating the speed in, the constant speed, and speed out phases *of all the transformations defined*. This allows you to control the speed of the movement between the two keys as you wish, including a constant speed movement.
es: Cuando la opción **Clave global** se encuentre activada en la herramienta **Animar**, y la interpolación predefinida estuviera establecida en **Lineal**, tan pronto se creen al menos dos fotogramas clave para una columna/capa, aparecerá una **línea vertical con dos flechas**, conectándolos (ver :ref:`Animación de objetos <animating_objects>` y :ref:`Definición de la interpolación de segmentos <setting_segment_interpolations>` ). Las dos flechas dividirán la línea en tres secciones, indicando las fases de aceleración, velocidad constante y desaceleración *de todas las transformaciones definidas* por los fotogramas clave. Esto permitirá controlar a voluntad la velocidad del movimiento entre dos fotogramas clave, incluyendo la obtención de un movimiento de velocidad totalmente constante.

source: You can also cycle previously created keys, in order to repeat automatically all the previously defined keys for the whole length of the scene, with no need to copy and paste keys from cells to cells.
es: También será posible repetir los fotogramas clave creados previamente, para extender la animación más allá del rango cubierto por los fotogramas clave, sin necesidad de copiar y pegar los mismos una y otra vez de una celda a otra.

source: All animations and interpolations set for the column/layer can be visible and edited with the Function Editor. When you edit any column/layer transformation in the Function Editor, the arrowheads will not be displayed anymore between keys, to stress the fact that a specific interpolation has been modified with the Function Editor. If needed, you can **Reset** the whole column/layer transformation to the default interpolation values, and make the arrowheads available again (see :ref:`Editing Curves and Numerical Columns <editing_curves_and_numerical_columns>` ).
es: Todos los fotogramas clave e interpolaciones definidos para una columna/capa podrán ser visualizados y editados usando en Editor de funciones. Al editar cualquier transformación de una columna/capa en dicho editor, las flechas entre fotogramas clave, anteriormente mencionadas, ya no se mostrarán, para indicar el hecho de que se ha modificado alguna interpolación desde el Editor de Funciones. Si fuera necesario, será posible **Restablecer** completamente las interpolaciones de las transformaciones de la columna/capa a sus valores predefinidos, para volver a visualizar las flechas en la Planilla/Línea de tiempo (ver :ref:`Edición usando la planilla de valores y curvas <editing_curves_and_numerical_columns>` ).

source: **To modify a key:**
es: **Para modificar un fotograma clave:**

source: Select the cell the key refers to.
es: Seleccionar la celda donde se encuentra el fotograma clave.

source: Use the **Animate** tool (|animate|) to modify position and size.
es: Usar la herramienta **Animar** (|animate|) para modificar alguna de las transformaciones de la columna/capa.

source: Enter values you want to modify in the Animate tool (|animate|) options bar.
es: Ingresar los valores que se desee modificar en la barra de opciones de la herramienta **Animar** (|animate|).

source: **To select keys:**
es: **Para seleccionar fotogramas clave:**

source: **Click a key icon** to select it.
es: Hacer **clic** sobre un ícono de fotograma clave, para seleccionarlo.

source: **Click a key icon and drag** to select a range of keys on different columns and at different frames.
es: Hacer **clic y arrastrar** sobre un ícono de fotograma clave, para definir un marco rectangular y seleccionar claves en distintas columnas/capas y fotogramas.

source: **Shift-click** to extend the selection to a specific key.
es: Hacer **Mayúsculas-clic** sobre un ícono de fotograma clave, para extender la selección hasta un fotograma clave específico.

source: **Ctrl-click** (PC) or **Cmd-click** (Mac) to add to, or remove a key to the selection.
es: **Ctrl-clic** (PC) o **Cmd-clic** (macOS) para agregar o quitar un fotograma clave a la selección.

source: **Right-click** a key icon and choose the related command from the menu that opens to perform specific selections, such as all keys in the row, all previous ones, all following ones, etc.
es: Hacer **clic derecho** sobre un ícono de fotograma clave y elegir un comando en el menú, para realizar selecciones específicas de fotogramas clave, tales como seleccionar todos los de una columna, todos los anteriores, todos los siguientes, etc.

source: **To move a key selection:**
es: **Para desplazar una selección de fotogramas clave:**

source: Click any of the selected keys and drag the selection to the new position. Dragging is allowed only inside its own column/layer.
es: Hacer clic sobre alguno de los claves seleccionados y arrastrar la selección hasta la nueva posición. Sólo será posible arrastrarlos dentro de su misma columna/capa.

source: **To edit a key selection:**
es: **Para editar una selección de fotogramas clave:**

source: Use the **Cut** command to eliminate the selection from the scene and keep it in memory for further operations.
es: Usar el comando **Cortar** para eliminar la selección de la escena y mantenerla en memoria para operaciones futuras.

source: Use the **Paste** command to paste the selection kept in memory starting from the selected cell.
es: Usar el comando **Pegar** para pegar la selección guardada en memoria, comenzando a partir de la celda seleccionada.
