Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: es

source: **To track a defined region in a series of images:**
es: **Para rastrear una región a lo largo de un rango de fotogramas:**

source: Select the first image of the range you want to track.
es: Seleccionar la primera imagen del rango que se desee rastrear.

source: Choose the **Tracker** tool (|tracker|) and define the regions to be tracked.
es: Elegir la herramienta **Punto de rastreo** (|tracker|) y definir las regiones a ser rastreadas.

source: Select the frame range in the Xsheet/Timeline or in the Level Strip.
es: Seleccionar el rango de fotogramas en la Planilla/Línea de tiempo o en la Cinta de nivel.

source: Choose Level → **Tracking...**, set the tracking options and click the **Track** button.
es: Elegir Nivel → **Rastrear...**, definir las opciones de rastreo y hacer clic en el botón **Rastrear**.

source: **To link an object to the tracked region:**
es: **Para subordinar un objeto a la región rastreada:**

source: Link the object to one of the hooks defined by the tracking process (see :ref:`Using Hooks <using_hooks>` ).
es: Vincular el objeto a uno de los enganches definidos durante el proceso de rastreo (ver :ref:`Uso de Enganches <using_hooks>` ).

source: Animating Objects
es: Animación de objetos

source: You can animate the position, rotation, scale and shear (plus edit the center) of columns, pegbars, cameras and the table by using the Animate tool. Objects to be animated can be selected either in the Stage Schematic, the Viewer, the Xsheet/Timeline or by using a dropdown menu in the Animate tool's own options bar.
es: Es posible animar la posición, rotación escala e inclinación (además de editar el centro) de las columnas/capas, barras de sujeción, cámaras y la mesa, usando la herramienta **Animar**. Los objetos a ser animados podrán ser seleccionados en el Diagrama de escenario, el Visor, la Planilla/Línea de tiempo o usando el menú desplegable presente en la barra de opciones de la herramienta Animar.

source: In the **Animate tool** (|animate|) options bar you can set the following:
es: En la barra de herramientas de la herramienta **Animar** (|animate|) será posible controlar lo siguiente:

source: **Object:**, lets you select which scene object is to be effected by the tool. Here will be listed all columns, cameras and pegbars created, plus the table itself.
es: **Objeto:**, permite seleccionar el objeto de la escena que será editado por la herramienta. En este menú desplegable serán listadas todas las columnas/capas, cámaras y barras de sujeción creadas, además de la mesa.

source: **Mode:**, lets you choose which transformation options to display in the tool options bar. Options are: **Position**, **Rotation**, **Scale**, **Shear**, **Center** and **All**.
es: **Modo:**, de la herramienta, permite escoger qué opciones de transformación serán mostradas en la barra de opciones. Las opciones son: **Posición**, **Rotación**, **Escala**, **Inclinación**, **Centro** y **Todo**.

source: **Position**, **X:** and **Y:** set the horizontal and vertical positions of the selected object, **Z:** sets its position along the Z axis, for defining the depth of the object in 3D space (see :ref:`Working in a 3D Environment <working_in_a_3d_environment>` ), and **SO:** sets the column/layer stacking order, that can override the default one defined by the Xsheet column (or Timeline layer) order (see :ref:`Changing Columns Stacking Order <changing_columns_stacking_order>` ).
es: **Posición**, **X:** e **Y:** permiten definir las posiciones horizontal y vertical del objeto seleccionado, **Z:** define su posición a lo largo del eje Z, para establecer la profundidad del objeto en el espacio 3D (ver :ref:`Trabajo en un entorno 3D <working_in_a_3d_environment>` ), y **Orden:** permite cambiar el orden de composición de la columna/capa, redefiniendo así el orden natural derivado de la posición de la columna en la Planilla (o de la capa en la Línea de tiempo) (ver :ref:`Cambio del Orden de composición de las columnas/capas <changing_columns_stacking_order>` ).

source: **Rotation:**, sets the rotation of the selected object around the Z axis.
es: **Rotación:**, permite definir la rotación del objeto seleccionado en torno al eje Z.

source: **Scale**, **Global:**, **H:** and **V:** set the global, horizontal and vertical scaling of the selected object. **Maintain:** sets a constraint for scaling operations performed by using the Animate tool handle: if it is set to **A/R** the object will maintain its proportions, if it is set to **Mass** the object will maintain its overall volume.
es: **Escala**, **Global:**, **H:** y **V:** permiten definir la escala global, horizontal y vertical del objeto seleccionado. **Preservar:** permite definir una restricción para las operaciones de escalado realizadas al usar el manipulador de la herramienta Animar: si estuviera establecido en **Proporción** el objeto mantendrá su proporción, si estuviera en **Masa** el objeto mantendrá su volumen.

source: **Shear**, **H:** and **V:** set the horizontal and vertical shearing of the selected object.
es: **Inclinación**, **H:** y **V:** permiten definir la inclinación horizontal y vertical del objeto seleccionado.

source: **Center**, **X:** and **Y:** set the horizontal and vertical position of the center of the selected object. The Center of an object cannot be animated.
es: **Centro**, **X:** e **Y:** permiten definir la posición horizontal y vertical del centro de pivote del objeto seleccionado. No es posible animar el Centro de un objeto.

source: **All** displays all transformation types at the same time. In the viewer a handle will also be available that let users visually change any of the transformation types: Position, Rotation, Scale, Shear and Center.
es: **Todo**, permite mostrar las opciones de todos los tipos de transformación a la vez, en la barra de opciones de la herramienta. Además, se mostrará un *Manipulador* en el Visor, que permitirá cambiar visualmente todos los tipos de transformación: Posición, Rotación, Escala, Inclinación y Centro.

source: **Pick:** (only available in All mode) lets the user choose to automatically select columns/layers or pegbars to be animated when the selection is done by clicking in the Viewer: when set to **Column**, clicking a drawing automatically selects the related column/layer; when set to **Pegbar**, clicking a drawing automatically selects the pegbar to which the column/layer containing the drawing is linked (if there is one); when set to **None** the selection of drawings in the Viewer is disabled.
es: **Escoger:** (sólo disponible en el modo Todos), permite al usuario definir si al escoger un dibujo en el Visor, se deberá seleccionar la columna/capa donde éste se encuentre expuesto o la barra de sujeción a la cual eventualmente estuviera subordinada dicha columna/capa: cuando esta opción estuviera establecida en **Columnas**, al hacer clic sobre un dibujo se seleccionará la columna/capa correspondiente; cuando estuviera en **Barras de sujeción**, se seleccionará la barra de sujeción a la cual se encuentre subordinada la columna/capa donde esté expuesto el dibujo (si existiera); cuando estuviera en **nada**, no será posible escoger objetos haciendo clic en el Visor.

source: **Lock buttons** (|lock|) define which values remain locked while transforming the object.
es: Botones de **Bloqueo** (|lock|), permiten definir qué valores permanecerán bloqueados al transformar el objeto seleccionado.

source: **Global Key** when activated, sets a key for all of the object transformations as soon as a key is set for any of its transformations interactively in the viewer. For example if you change the position of an object, thus defining a keyframe for it, keys will also be automatically defined for the rotation, scaling and shearing transformations as well. This option will not take any effect if the values for the property are input directly in the toolbar, and not interactively.
es: **Clave global**, al estar activado permitirá definir un fotograma clave para *todas* las transformaciones del objeto, en el momento en que se estableciera un fotograma clave para alguna de ellas, de forma interactiva en el Visor. Por ejemplo, si se modificara la posición de un objeto (estableciendo así un fotograma clave para esa transformación), se definirán automáticamente fotogramas clave para la rotación, escala e inclinación del objeto. Esta opción no tendría ningún efecto si los valores de la posición hubieran sido ingresados directamente en la barra de opciones de la herramienta Animar, en vez de hacerlo interactivamente.

source: If the tool options bar is too short to display all the tool options, it can be scrolled by using arrow buttons available at its ends.
es: Si la barra de opciones resultara muy corta como para mostrar todas las opciones, podrá ser desplazada utilizando los botones con forma de flecha que aparecerán en sus extremos.

source: Position values are expressed in the default unit of measure set in the Preferences... → Interface dialog (see :ref:`Choosing the Working Unit <choosing_the_working_unit>` ).
es: Los valores de Posición estarán expresados en la unidad predefinida en el diálogo Archivo → Preferencias... → Interfaz (ver :ref:`Elección de unidades de trabajo <choosing_the_working_unit>` ).

source: Animate Tool Handle
es: Manipulador de la herramienta Animar

source: When the Animation tool is in **All** mode, you can also interactively control transformation values by using the handle available in the viewer. The handle is made of an inner double circle with three arms that allow you to change any of the following transformations:
es: Cuando la herramienta Animación se encuentra en el modo **Todo**, será posible controlar interactivamente los valores de transformación, usando el Manipulador disponible en el Visor. El manipulador está compuesto de un círculo interior doble con tres brazos que permiten cambiar cualquiera de las siguientes transformaciones:

source: As you roll over the handles, the cursor changes shape to indicate to you the operations you may perform.
es: A medida que se desplaza el puntero sobre las distintas áreas del manipulador, se resaltarán sus diferentes partes, indicando las operaciones que será posible realizar.

source: For greater precision it is possible to keep the **Alt** key depressed before starting to perform any transformation.
es: Para una mayor precisión es posible mantener presionada la tecla **Alt** antes de comenzar a realizar cualquier transformación.

source: **Position:** Click and drag anywhere to move the object; if the **Shift** key is pressed while dragging, the movement will be constrained in the horizontal or vertical direction.
es: **Posición:** Hacer clic y arrastrar en cualquier parte por fuera del manipulador para mover el objeto seleccionado; si la tecla **Mayúsculas** se encontrara presionada al arrastrar, el movimiento se restringirá a las direcciones horizontal o vertical.

source: **Rotate:** Click and drag the circle end to rotate the object;
es: **Rotación:** Hacer clic y arrastrar el extremo circular del brazo vertical del manipulador, para rotar el objeto seleccionado.

source: **Scale:** Click and drag the outer square of the double-square end to scale the object uniformly on the vertical and horizontal; click and drag the inner square of the double-square end to scale the object according to the constraint set in the options bar; if no constraint is set and the **Shift** key is pressed while dragging, the scaling will be uniform.
es: **Escala:** Hacer clic y arrastrar el extremo cuadrado del brazo inferior izquierdo del manipulador, para escalar el objeto de manera uniforme; hacer clic y arrastrar el cuadrado interior del mismo brazo para escalar el objeto libremente en ambas dimensiones, tomando en cuenta la opción **Preservar:** definida en la barra de opciones, si no hubiera definida ninguna restricción igualmente será posible presionar **Mayúsculas** al arrastrar, para escalar proporcionalmente.

source: **Shear:** Click and drag the parallelogram end to shear the object; if the **Shift** key is pressed while dragging, the shearing will be constrained in the horizontal or vertical direction.
es: **Inclinación:** Hacer clic y arrastrar el extremo en forma de paralelogramo del brazo inferior derecho del manipulador, para inclinar el objeto; si la tecla **Mayúsculas** se encontrara presionada al arrastrar, la inclinación se restringirá a las direcciones horizontal o vertical.

source: **Center:** Click and drag the double circle at the center to change the center of the object.
es: **Centro:** Hacer clic y arrastrar el círculo interior doble del manipulador, para cambiar la posición del centro del objeto.

source: The object center can be moved, but cannot be animated. Once it is set, or modified, it is retained in that position during all of the animation. If the Center is changed many times, and you want to set it back to its original position, right-click the object in the Stage Schematic and choose **Reset Center** from the menu that opens.
es: Será posible mover el Centro de los objetos, pero no animarlo. Una vez establecido o modificado, se mantendrá en esa posición durante toda la animación. Si el Centro hubiera sido cambiado varias veces y se deseara regresarlo a su posición predefinida, es posible hacer clic derecho sobre el nodo del objeto en el Diagrama de escenario y elegir la opción **Restablecer centro** en el menú.

source: When entering a value or operating the handle, a keyframe will be automatically generated at the current frame only for the set transformation; if the **Global Key** option is activated, keys will be generated for all of the transformations.
es: Tanto al ingresar un valor en la barra de opciones, como al operar el Manipulador, se creará automáticamente un fotograma clave en el fotograma actual únicamente para la transformación modificada; si la opción **Clave global** se encontrara activada, se generarán claves para todas las transformaciones del objeto seleccionado.

source: If you want to set a key for an object transformation, maintaining its value as it is at the current frame, you can just press **Enter** on the displayed value. If you want to set keys for all of the object transformations maintaining their values as they are at the current frame, you can use the **Set Key** button (|key|) available in the bottom bar of the viewer; in this case keys are created for all of the object transformations, regardless of the **Global Key** option.
es: Si se deseara marcar un fotograma clave para una de las transformaciones de un objeto, sin cambiar su valor en el fotograma actual, bastará con hacer clic en el campo de valor de dicha propiedad y presionar **Intro**. Si se deseara marcar fotogramas clave para todas las transformaciones de un objeto, manteniendo sus valores en el fotograma actual, será posible usar el botón **Marcar fotograma clave** (|key|) disponible en la barra inferior del Visor; en este caso se crearán claves para todas las transformaciones del objeto seleccionado, independientemente del estado de la opción **Clave global**.

source: Objects can also be animated by working in the Function Editor (see :ref:`Editing Curves and Numerical Columns <editing_curves_and_numerical_columns>` ).
es: También será posible animar objetos mediante el uso de las características del Editor de funciones (ver :ref:`Edición usando la planilla de valores y curvas <editing_curves_and_numerical_columns>` ).

source: The movement of the column contents can be checked by activating the Onion Skin mode, as it will display the position of drawings contained in the current column at different frames (see :ref:`Using Onion Skin <using_onion_skin>` ).
es: Será posible revisar el movimiento del contenido de las columnas/capas activando el modo Piel de cebolla, dado que mostrará la posición de los dibujos contenidos en la columna actual, en varios fotogramas distintos (ver :ref:`Uso de piel de cebolla <using_onion_skin>` ).

source: **To select the object to edit:**
es: **Para seleccionar el objeto a ser animado:**

source: Select it in the stage schematic.
es: Seleccionarlo en el Diagrama de escenario.

source: If the object is a column/layer, select it in the Xsheet/Timeline.
es: Si el objeto fuera una columna/capa, seleccionarlo en la Planilla/Línea de tiempo.

source: Use the **Animate** tool (|animate|) with the **Pick:** option set to **Column** to click a drawing in the viewer to select the related column.
es: Usar la herramienta **Animar** (|animate|) con la opción **Escoger:** en **Columnas** para poder hacer clic sobre un dibujo en el Visor y así seleccionar su columna/capa correspondiente.

source: Use the **Animate** tool (|animate|) with the **Pick:** option set to **Pegbar** to click a drawing in the viewer to select the pegbar that the column containing the drawing is linked to.
es: Usar la herramienta **Animar** (|animate|) con la opción **Escoger:** en **Barras de sujeción** para poder hacer clic sobre un dibujo en el Visor y así seleccionar la barra de sujeción a la cual se encuentre subordinada la columna/capa que contiene el dibujo.

source: Right-click in the Viewer a drawing to select an object from the list of scene objects.
es: Hacer clic derecho en el Visor sobre un dibujo para seleccionar un objeto de la lista de objetos de la escena.

source: **To animate an object with the Animate tool:**
es: **Para animar un objeto usando la herramienta Animar:**

source: Select the object you want to animate.
es: Seleccionar el objeto que se desee animar.

source: Choose the **Animate** tool (|animate|).
es: Elegir la herramienta **Animar** (|animate|).

source: Set the frame where you want to define the key by doing one of the following:
es: Definir el fotograma donde se desee marcar el fotograma clave realizando una de las siguientes acciones:

source: Move the current frame cursor in the Xsheet/Timeline or in the Function Editor.
es: Mover el cursor de tiempo en la Planilla/Línea de tiempo o en el Editor de funciones.

source: Use the Frame bar or the Playback buttons in the bottom bar of the viewer.
es: Usar la barra de tiempo o los botones de reproducción en la barra inferior del Visor.

source: When animating columns only, select the related cell in the column/layer.
es: Únicamente al animar columnas/capas, seleccionar la celda correspondiente en la columna/capa.

source: Define a keyframe.
es: Transformar el objeto como se desee, se marcará automáticamente un fotograma para dicha transformación.

source: Select a different frame, and go on defining keyframes.
es: Seleccionar otro fotograma y continuar transformando al objeto como sea necesario.

source: **To define a keyframe only for some object transformations:**
es: **Para definir un fotograma sólo para algunas transformaciones:**

source: Deactivate the **Global Key** option in the tool options bar.
es: Desactivar la opción **Clave global** en la barra de opciones de la herramienta.

source: Enter values in the **Animate** tool options bar for the object transformations you want to set a key for.
es: Ingresar valores, en las opciones de la herramienta **Animar**, para las transformaciones a las que se desee marcar nuevos fotogramas clave.

source: If in **All** mode, operate the handle to move, scale, rotate or shear the object, automatically generating a key only for the modified transformation.
es: Si la herramienta estuviera en el modo **Todo**, utilizar el manipulador en el Visor para cambiar la posición, rotación, escala e inclinación del objeto, generándose de esa forma fotogramas clave sólo para las transformaciones realizadas.

source: As this keyframe is partial and refers only to some transformations, the **Set Key** button turns striped-blue.
es: Debido a que estos fotogramas serán parciales y se referirán sólo a algunas transformaciones, el botón **Marcar fotograma clave** se mostrará con bandas de color *azul*.

source: **To define a keyframe for all the object transformations:**
es: **Para marcar un fotograma clave para todas las transformaciones de un objeto:**

source: Activate the **Global Key** option in the tool options bar.
es: Activar la opción **Clave global** en la barra de opciones de la herramienta **Animar**.

source: Interactively move, rotate, scale or shear the object in the viewer.
es: Usando el manipulador de la herramienta, mover, rotar, escalar o inclinar el objeto en el Visor.

source: As this keyframe is global and refers to all the transformations, the **Set Key** button turns blue.
es: Como este clave será global, refiriéndose a todas las transformaciones, el botón **Marcar fotograma clave** se mostrará en color azul.

source: **To define a key for an object transformation leaving its value as it is at the current frame:**
es: **Para marcar un fotograma clave en un objeto, sin cambiar los valores de las transformaciones en ese fotograma:**

source: In the **Animate** tool options bar click in the field of the object transformations you want to set a key for, and press the **Enter** key.
es: En la barra de opciones de la herramienta **Animar** hacer clic en el campo numérico de la transformación deseada y presionar la tecla **Intro**, se creará un fotograma clave para dicha propiedad.

source: **To define keys for all of the object transformations leaving their values as they are at the current frame:**
es: **Para marcar claves para todas las transformaciones de un objeto, sin cambiar sus valores en el fotograma actual:**

source: Click the **Set Key** button (|key|).
es: Hacer clic en el botón **Marcar fotograma clave** (|key|) en la barra inferior del Visor.

source: When animating columns/layers only, right-click in the column/layer cell and choose **Set Key** from the menu that opens.
es: Únicamente al animar columnas/capas, hacer clic derecho sobre la columna/capa y elegir **Marcar fotograma clave** en el menú.

source: **To turn a partial keyframe to a global key:**
es: **Para transformar un fotograma clave parcial en uno global:**

source: Click the **Set Key** button (|key|): it turns from blue-striped to blue.
es: Hacer clic en el botón **Marcar fotograma clave** (|key|): pasará de mostrarse con bandas de color *azul*, a ser completamente *azul*.

source: **To remove a set keyframe from the viewer bottom bar:**
es: **Para eliminar un fotograma clave usando la barra inferior del Visor:**

source: If the keyframe is global, click the **Set Key** button (|key|): it turns from blue to grey.
es: Si el fotograma clave fuera global, hacer clic en el botón **Marcar fotograma clave** (|key|): pasará de mostrarse en color *azul*, a ser *gris*.

source: If the keyframe is partial, click twice the **Set Key** button (|key|): with the first click it turns from striped-blue to blue, with the second from blue to grey.
es: Si el fotograma clave fuera parcial, hacer clic dos veces en el botón **Marcar fotograma clave** (|key|): primero pasará de mostrarse con bandas de color *azul*, a ser completamente *azul*, y luego a ser *gris*.

source: **To navigate frames where keyframes are defined in the viewer bottom bar:**
es: **Para recorrer los fotogramas donde haya definidos claves, usando la barra inferior del Visor:**

source: Use the **Previous Key** (|prevkey|) and **Next Key** (|next_key|) buttons available at the side of the Set Key button.
es: Usar los botones **Clave anterior** (|prevkey|) y **Clave siguiente** (|next_key|) disponibles a los lados del botón **Marcar fotograma clave**.
