Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/creating_movements.po
Languages: es

source: All these commands are also available in the menu that opens when right-clicking the key icon.
es: Todos estos comandos también se encuentran disponibles en el menú contextual que se invoca al hacer clic derecho sobre un ícono de fotograma clave.

source: **To set the speed of the movement or transformation:**
es: **Para definir la velocidad de la animación de una transformación:**

source: **Click the arrowheads** available on the line connecting two subsequent keys, **and drag them up or down** to the new position. In particular:
es: Hacer **clic en las flechas** visibles en las líneas que conectan dos claves contiguos, y **arrastrarlas hacia arriba o abajo** hasta la nueva posición. En particular:

source: To set a **constant speed**, drag the top arrowhead close to the first key icon to eliminate the ease in section, and the bottom arrowhead close to the second key icon to eliminate the ease out section.
es: Para definir una **velocidad constante**, arrastrar la primera flecha hacia el primer fotograma para eliminar la sección de aceleración, y arrastrar la segunda flecha hacia el último fotograma del segmento para eliminar la sección de desaceleración.

source: To set a **continuous acceleration**, drag both arrowheads close to the second key icon in order to increase the speed in section.
es: Para definir una **aceleración continua**, arrastrar ambas flechas hacia el último fotograma del segmento para lograr una aceleración continua en el mismo.

source: To set a **continuous deceleration**, drag both arrowheads close to the first key icon in order to increase the speed out section.
es: Para definir una **desaceleración continua**, arrastrar ambas flechas hacia el primer fotograma del segmento para lograr una desaceleración continua en el mismo.

source: **To make the arrowheads available when they are not:**
es: **Para volver a hacer visibles las flechas, cuando no lo estuvieran:**

source: Right-click the line connecting two subsequent keys and choose **Reset Interpolation** from the menu that opens.
es: Hacer clic derecho sobre la línea que conecta a dos claves sucesivos y elegir **Restablecer interpolación** en el menú.

source: **To activate/deactivate the cycling of previously created keys:**
es: **Para activar/desactivar la repetición de los claves de una columna/capa:**

source: Click the **Circular arrow** icon (|circular_arrow|) visible after the last key of a series.The cells affected by the cycled movement are marked on the right by *a zigzagged line*.
es: Hacer clic en el ícono de **Flecha circular** (|circular_arrow|) visible a continuación del último fotograma clave de una columna/capa. Las celdas afectadas por la repetición cíclica del movimiento, serán marcadas con una *línea zigzagueante*.

source: **To open the Function Editor:**
es: **Para abrir el Editor de funciones:**

source: Double-click a key.
es: Hacer doble clic sobre un ícono de fotograma clave.

source: Right-click a key and choose **Function Editor** from the menu that opens.
es: Hacer clic derecho sobre un ícono de fotograma clave y elegir **Editor de funciones** en el menú.

source: Working with Multiple Column/Layer Keys
es: Trabajo con claves de varias columnas/capas

source: It is possible to insert or delete keys affecting the Xsheet/Timeline as a whole, or a selection of Xsheet columns (or Timeline layers).
es: Es posible insertar o borrar claves, afectando a la Planilla/Línea de tiempo en forma completa o sólo a una selección de columnas/capas de la misma.

source: Inserting or deleting multiple keys allows you to manage keys for several columns/layers at the same time, for instance when you are working on a cutout animation where keys may be required for all the columns/layers where model sections are exposed (see :ref:`Creating Cutout Animation <creating_cutout_animation>` ).
es: Insertar o borrar múltiples claves permitirá administrar los claves de varias columnas/capas a la vez, por ejemplo al trabajar en una animación de recortes es posible que se necesitara tener claves en todas las columnas/capas donde el modelo se encontrara expuesto (ver :ref:`Creación de animación de recortes <creating_cutout_animation>` ).

source: Inserted keys are created for all the column transformations.
es: Al insertar fotogramas claves, éstos serán creados para todas las transformaciones de las columnas involucradas.

source: When a multiple key is inserted at the current frame, a key is created for each Xsheet column (or Timeline layer) where an animation level is exposed; if a column/layer selection is defined, keys are created in selected columns/layers only (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>` ).
es: Al insertar múltiples claves en el fotograma actual, se creará un fotograma clave para cada columna de la Planilla (o capa de la Línea de tiempo) donde haya un nivel de animación expuesto; si hubiera definida una selección de columnas/capas, se crearán claves sólo para las mismas (ver :ref:`Trabajo con columnas/capas <working_with_xsheet_columns>` ).

source: When a multiple key is deleted at the current frame, any key available in any Xsheet column (or Timeline layer) at the current frame is deleted; if a column/layer selection is defined, keys are deleted in selected columns/layers only.
es: Al borrar múltiples claves en el fotograma actual, se borrará todo fotograma clave de cada columna de la Planilla (o capa de la Línea de tiempo) en el fotograma actual; si hubiera definida una selección de columnas/capas, se borrarán sólo los claves de las mismas.

source: **To create several keys at once:**
es: **Para crear varios fotogramas clave a la vez:**

source: Select the columns/layers for which you want to create keys.
es: Seleccionar las columnas/capas para las cuales se desee crear claves.

source: Select no column by clicking anywhere in the Xsheet/Timeline, to create keys for all the columns/layers.
es: Deseleccionar todas las columnas haciendo clic en alguna parte de la Planilla/Línea de tiempo, para crear claves en todas las columnas/capas.

source: Select the frame where you want to insert keys.
es: Seleccionar el fotograma donde se desee insertar los claves.

source: Choose Xsheet → **Insert Multiple Keys**.
es: Elegir Planilla → **Insertar múltiples claves**.

source: **To remove several keys at once:**
es: **Para eliminar varios fotogramas claves a la vez:**

source: Select the columns/layers from which you want to delete keys.
es: Seleccionar las columnas/capas de donde se desee eliminar los claves.

source: Select no column by clicking anywhere in the Xsheet/Timeline, to delete keys from all the columns/layers.
es: Deseleccionar todas las columnas haciendo clic en alguna parte de la Planilla/Línea de tiempo, para eliminar los claves de todas las columnas/capas.

source: Select the frame where you want to delete keys.
es: Seleccionar el fotograma donde se desee eliminar los claves.

source: Choose Xsheet → **Remove Multiple Keys**.
es: Elegir Planilla → **Eliminar múltiples claves**.

source: Working in a 3D Environment
es: Trabajo en un entorno 3D

source: You can place and move cameras, the table, pegbars and columns/layers in a 3D environment, as if they were elements on a real 3D stage.
es: Es posible ubicar y mover cámaras, la mesa, barras de sujeción y columnas/capas usando un entorno 3D, como si fueran elementos en un escenario real.

source: This means that it's possible to move the camera automatically generating a multiplane effect, or truck it through characters and elements simulating a perspective effect, or create complex 3D motion paths for any element by combining a depth movement with movements in the X and Y directions.
es: Esto significa que será posible mover la cámara para generar automáticamente un efecto multiplano, o desplazarla lateralmente a través de personajes y elementos para simular un efecto de perspectiva, o también crear complejas trayectorias de movimiento tridimensionales para cualquier elemento, combinando movimientos en profundidad, horizontales y verticales.

source: The 3D environment can be activated, or deactivated, with the **3D View** button (|3d|) available in the Viewer title bar. When activated, the viewer displays the cone of the camera and all of the scene contents along the Z axis, which is the direction from the camera to the table. The area displayed can be moved and rotated to set the best viewing angle, and a side or top viewpoint can be set.
es: Es posible activar o desactivar el entorno 3D usando el botón **Vista 3D** (|3d|) disponible en la barra de título del Visor. Al estar activado, el Visor mostrará el cono de la cámara y todo el contenido de la escena a lo largo del eje Z, que es la dirección en que la cámara apunta a la mesa. Será posible desplazar y rotar el Visor para encontrar el mejor ángulo de visualización, así como obtener una vista superior o lateral.

source: By default all the pegbars and columns are on the table: their Z position is equal to the number of horizontal fields defined for the default camera (as the value represents the size of the area that is shot by the camera) (see :ref:`Defining Camera Settings <defining_camera_settings>` ). By increasing the field value, objects are placed farther from the camera; by decreasing it, objects are placed closer to the camera; at zero they are at the same Z position as the camera, and for negative values they are behind the camera.
es: De forma predefinida todas las barras de sujeción y columnas/capas se encuentran sobre la mesa, y el valor de su Posición Z será igual al número de campos horizontales establecido para la *cámara activa* (ya que este valor representa el tamaño del área vista por la misma) (ver :ref:`Definición de opciones de cámara <defining_camera_settings>` ). Al aumentar el valor de la Posición Z de los objetos, éstos se alejarán de la cámara; al disminuirlo, se acercarán; en 0 se encontrarán en la misma Posición Z que la cámara, y al usar valores negativos se encontrarán detrás de la misma.

source: As concerning the camera, by default its Z position is equal to the number of horizontal fields defined for the default camera. By increasing the field value, the camera moves farther from the table; by decreasing it, it moves closer; at zero it is at the same Z position of the table and for negative values it is behind the table.
es: En lo que respecta a la cámara, de forma predefinida su Posición Z será igual al número de campos horizontales establecido para la *cámara activa*. Al aumentar el valor de la Posición Z, la cámara se alejará de la mesa; al disminuirlo, se acercará a ella; en 0 se encontrará en la misma Posición Z que la mesa, y al usar valores negativos estará detrás de la mesa.

source: As soon as objects are moved, *projections on an imaginary floor and side wall* let you understand the position of the drawings in relation to each other and to the camera. If the current object is a column/layer, a dotted bounding box displays the area of it currently being shot by the camera.
es: Tan pronto como un objeto haya sido movido, se mostrará *una proyección del mismo sobre el suelo y la pared imaginarios*, que ayudará a comprender mejor su posición en relación a otros objetos y a la cámara. Si el objeto seleccionado fuera una columna/capa, se mostrará un marco delimitador punteado, indicando el área de la misma que esté siendo captada por la cámara.

source: The size of the objects changes according to its Z position, like in a real 3D environment, decreasing when an object is farther from the camera and increasing when closer. To keep control of this behaviour it's possible to define an additional Z position value in the tool options bar, that sets the position at which the object has to keep its original size.
es: El tamaño visible de los dibujos cambiará de acuerdo a su Posición Z, como sucede en un entorno 3D real, disminuyendo al alejarse de la cámara y aumentando al acercarse a la misma. Será posible definir un valor adicional de posición **(Z)** en la barra de herramientas, para poder mantener un control sobre este comportamiento, estableciendo en qué valor de la Posición Z el objeto será visto a su tamaño normal.

source: Columns closer to the camera are displayed on top of others, ignoring the Xsheet/Timeline order and the **SO** value. In case two or several columns have exactly the same distance, the **SO** value prevails; if two or several columns have exactly the same distance and SO value, the Xsheet column (or Timeline layer) order prevails (see :ref:`Changing Columns Stacking Order <changing_columns_stacking_order>` ).
es: Las columnas/capas más cercanas a la cámara serán compuestas por encima de las demás, ignorando tanto a su propiedad **Orden:**, como al orden natural de composición en la Planilla/Línea de tiempo. En caso de que dos o más columnas/capas estuvieran exactamente a la misma distancia, el valor de su propiedad **Orden:** será tomado en cuenta; en caso de que dos o más columnas/capas estuvieran exactamente a la misma distancia y tuvieran el mismo valor de **Orden:**, el orden natural de composición de la Planilla/Línea de tiempo será tomado en cuenta (ver :ref:`Cambio del Orden de composición de las columnas/capas <changing_columns_stacking_order>` ).

source: **To enter the 3D environment:**
es: **Para ingresar al entorno 3D:**

source: Click the **3D View** button (|3d|) available on the right of the viewer title bar.
es: Hacer clic en el botón **Vista 3D** (|3d|) disponible a la derecha de la barra de título del Visor.

source: **To set an object position in the 3D environment:**
es: **Para definir la posición de un objeto en el entorno 3D:**

source: Activate the **3D View**.
es: Activar la **Vista 3D**.

source: Select the object you want to move.
es: Seleccionar el objeto que se desee mover.

source: Select the **Animate** tool (|animate|).
es: Seleccionar la herramienta **Animar** (|animate|).

source: Enter a value for the **Z** position in the tool options bar.
es: Ingresar el valor de la posición **Z** en la barra de opciones de la herramienta.

source: Use the **double-arrow handle** parallel to the floor of the 3D environment, to move the selected object and set its Z position.
es: Usar el manipulador con una **flecha doble**, paralela al suelo del entorno 3D, para mover el objeto seleccionado y definir su posición Z. También será posible hacer **Ctrl-clic** (PC) o **Cmd-clic** (macOS) y arrastrar para activar el modo de desplazamiento en Z.

source: **To set at which position the object has to keep its original size:**
es: **Para definir en qué posición Z el objeto deberá ser visto a su tamaño normal:**

source: Enter a value for the **additional Z position** field *displayed in brackets* in the tool options bar. For example if you want a column content to keep its original size when placed at the Z position 8, also enter 8 as the value in brackets.
es: Ingresar un valor para la posición **(Z)** adicional, en la barra de opciones de la herramienta. Por ejemplo, cuando se desee que una columna mantenga su tamaño normal al estar ubicada en una Posición Z de 8, se deberá ingresar también 8 en el valor de **(Z)**.

source: **To move the work area displayed in 3D:**
es: **Para mover el área de trabajo del entorno 3D:**

source: Select the **Hand** tool (|hand|) and drag in the viewer.
es: Seleccionar la herramienta **Desplazar** (|hand|) y arrastrar en el Visor.

source: **To rotate the work area displayed in 3D:**
es: **Para rotar el área de trabajo del entorno 3D:**

source: Select the **Rotate** tool (|rotate|) and drag in the viewer.
es: Seleccionar la herramienta **Rotar** (|rotate|) y arrastrar en el Visor.

source: **To set a side or a top view:**
es: **Para ver desde una vista lateral o superior en el Visor:**

source: To set a **Side view** use the button (|side_view|) available on the side wall of the 3D environment.
es: Usar el botón **Vista lateral** (|side_view|) disponible en la pared lateral del entorno 3D.

source: To set a **Top view** use the button (|top_view|) available on the floor of the 3D environment.
es: Usar el botón **Vista superior** (|top_view|) disponible en el suelo del entorno 3D.

source: **To exit the 3D environment:**
es: **Para salir del entorno 3D:**

source: Click the **Camera Stand** (|camera_stand|) or **Camera View** (|camera_view|) buttons available on the right of the viewer title bar.
es: Hacer clic en los botones **Vista de mesa de trabajo** (|camera_stand|) o **Vista de cámara** (|camera_view|) disponibles a la derecha de la barra de título del Visor.
