Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: es

source: Paste the copied/cut selection: automatically a new drawing will be created.
es: Pegar la selección copiada/cortada: se creará un nuevo dibujo automáticamente.

source: Grouping and Ungrouping Vectors
es: Uso de grupos en niveles vectoriales

source: All the vector strokes of a drawing lie on the same plane, therefore drawing *areas* are outlined by segments defined by strokes intersections. This means that if you draw two intersecting squares, automatically three areas are defined: one belonging only to the first square, one to the second one, and another defined by the intersection.
es: Todos los trazos vectoriales de un dibujo residen en el mismo plano, así, los contornos de las *áreas* quedan definidos por la intersección de los trazos. Esto significa que si se dibujaran dos cuadrados que se intersectan, quedarían definidas tres áreas: una perteneciente sólo al primer cuadrado, otra al segundo y otra definida por la intersección de ambos.

source: Painting a drawing that contains intersecting vector strokes and shapes may be an issue, because all of them lie on the same layer.
es: Es posible que al pintar un dibujo que contenga trazos y figuras vectoriales que se intersecten se presenten problemas, ya que todos ellos residen en el mismo plano.

source: To organize strokes you can use the grouping features, that creates a new group entity containing only the strokes you select.
es: Para organizar los trazos es posible usar la característica de agrupación, que permite crear una nueva entidad que permite agrupar sólo a los trazos deseados entre ellos.

source: In the case of two intersecting squares, if you want the two squares to be overlapping instead of intersecting, you can create a group containing the strokes of the first square, and another those of the second square, thus defining two groups whose order can be arranged.
es: En el caso de los dos cuadrados intersectantes, si se deseara que ambos estuvieran superpuestos, en vez de intersectándose, es posible crear un grupo conteniendo a los trazos del primer cuadrado y otro conteniendo a los del segundo, definiendo así dos grupos, cuyo orden es posible controlar.

source: It's possible to create as many groups as you want in any drawing; groups can be made of one stroke only as well, for instance a circle, or a line.
es: Es posible crear tantos grupos como se desee en u nivel; éstos pueden estar conformados hasta por un único trazo, por ejemplo un círculo o una línea.

source: First define groups, then set a proper layering order to solve the intersection problems.
es: En primer lugar definir los grupos, luego definir un orden adecuado para resolver los problemas de intersección.

source: When drawing with the **Geometric** tool (|geometric|), closed shapes (i.e. rectangles, circles, ellipses, polygons and closed polylines) can be defined automatically as a group by activating the **Auto Group** option (see :ref:`Drawing with the Geometric Tool <drawing_with_the_geometric_tool>` ).
es: Al dibujar con la herramienta **Geometría** (|geometric|), es posible establecer que las formas cerradas (p.ej: rectángulos, círculos, elipses, polígonos o curvas Bézier cerradas) puedan conformar automáticamente un grupo, activando la opción **Agrupar automáticamente** (ver :ref:`Dibujo con la herramienta Geometría <drawing_with_the_geometric_tool>` ).

source: When your strokes selection includes one or several groups, the new group will include them as well, preserving them and their original sorting order position in case the group is released.
es: Cuando la selección de trazos incluye a uno o varios grupos, al crear un nuevo grupo éste los incluirá también, preservándolos así como a sus planos de ordenamiento originales, en caso de que el grupo sea desarmado.

source: It's not possible to define a group if the selection includes only some strokes belonging to a group.
es: No es posible definir un grupo si la selección incluye sólo a algunos trazos pertenecientes a un grupo.

source: When a group is released, if no other group is defined in the same drawing, all the strokes will lie at the same plane; if other groups are defined, the strokes of the released group will lie on a plane behind, in front of, or between the other groups, according to the original group sorting order position.
es: Al desarmar un grupo, si no hubiera ningún otro grupo definido en el mismo dibujo, todos los trazos quedarán en el mismo plano; si existieran otros grupos, los trazos del grupo desarmado residirán en un plano detrás, delante o entre los otros grupos, de acuerdo al orden original de posiciones.

source: It's possible to enter groups to isolate them visually from the rest of the drawing and better understand which strokes are inside and which outside the group. In this way it's also easier to work on the drawing, for instance to fill an area or to change the color of some strokes.
es: Es posible entrar a los grupos para aislarlos visualmente del resto de los dibujos, lo cual es útil para entender mejor cuáles son los trazos pertenecientes al mismo. De esta forma es también más sencillo trabajar en sus dibujos, por ejemplo para rellenar un área o para cambiar el color de algunos trazos.

source: As the **Selection** tool (|selection|) considers the group as a whole, if you want to select a stroke belonging to a group, first you have to enter the group, and then select the stroke.
es: Como la herramienta de **Selección** (|selection|) considera al grupo como un todo, si se desea seleccionar sólo a uno de los trazos pertenecientes a un grupo, primero es necesario entrar al grupo, para luego poder seleccionarlo.

source: As groups define which strokes belong to a certain plane, when using the **Fill** tool (|fill|), only areas defined by strokes within the same group can be filled.
es: Como los grupos permiten definir qué trazos pertenecen a un determinado plano, al usar la herramienta **Rellenar** (|fill|), sólo podrán ser rellenadas las áreas definidas por trazos que estén en ese grupo.

source: **To Define a group:**
es: **Para definir un grupo:**

source: Use the **Selection** tool (|selection|) to select the strokes you want to be in a group.
es: Usar la herramienta **Seleccionar** (|selection|) para seleccionar los trazos que se desea que pertenezcan a un mismo grupo.

source: Choose Edit → Group → **Group**.
es: Elegir Editar → Grupos → **Agrupar**.

source: Right-click on the selection and choose **Group** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Agrupar** en el menú.

source: **To Release a group:**
es: **Para desarmar un grupo:**

source: Select the group you want to release.
es: Seleccionar el grupo que se desea desarmar.

source: Choose Edit → Group → **Ungroup**.
es: Elegir Editar → Grupos → **Desagrupar**.

source: Right-click on the selection and choose **Ungroup** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Desagrupar** en el menú.

source: **To Enter a group:**
es: **Para entrar a un grupo:**

source: Select the group, then choose Edit → Group → **Enter Group**.
es: Seleccionar el grupo, luego elegir Editar → Grupos → **Entrar al grupo**.

source: Right-click the group and choose **Enter Group** from the menu that opens.
es: Hacer clic derecho sobre el grupo y elegir **Entrar al grupo** en el menú.

source: Double-click the group.
es: Hacer doble clic en el grupo.

source: **To Exit a group:**
es: **Para salir de un grupo:**

source: Choose Edit → Group → **Exit Group**.
es: Elegir Editar → Grupos → **Salir del grupo**.

source: Right-click the group and choose **Exit Group** from the menu that opens.
es: Hacer botón derecho sobre el grupo y elegir **Salir del grupo** en el menú.

source: Double-click outside the group.
es: Hacer doble clic fuera del grupo.

source: **To Select a group:**
es: **Para seleccionar un grupo:**

source: Choose the **Selection** tool (|selection|) and do any of the following:
es: Elegir la herramienta **Seleccionar** (|selection|) y hacer alguna de las siguientes cosas:

source: Click any stroke belonging to the group.
es: Hacer clic sobre alguno de los trazos pertenecientes al grupo.

source: Click and drag to select at least one stroke belonging to the group.
es: Hacer clic y arrastrar para seleccionar al menos uno de los trazos pertenecientes al grupo.

source: Set the type to **Rectangular** and click and drag to define a box and select at least one stroke belonging to the group.
es: Definir el tipo como **Rectangular**, hacer clic y arrastrar para definir un área rectangular y seleccionar al menos un trazo perteneciente al grupo.

source: Set the type to **Freehand** and click and drag to outline an area and select at least one stroke belonging to the group.
es: Definir el tipo como **Lazo**, hacer clic y arrastrar para definir el contorno de un área y seleccionar al menos un trazo perteneciente al grupo.

source: Set the type to **Polyline** and click to outline an area by defining a series of lines and select at least one stroke belonging to the group.
es: Definir el tipo como **Línea poligonal**, hacer varios clics para definir el contorno de un área y seleccionar al menos un trazo perteneciente al grupo.

source: **To Select a stroke in a group:**
es: **Para seleccionar un trazo agrupado:**

source: Enter the group.
es: Entrar al grupo.

source: Click the stroke to select it.
es: Hacer clic sobre el trazo para seleccionarlo.

source: Setting Stroke and Group Sorting Order
es: Definición del orden de trazos y grupos

source: For each vector drawing, strokes and groups sorting order can be changed by setting what has to lie in front of, and what behind.
es: En cada dibujo vectorial, es posible cambiar el orden de sus trazos y grupos definiendo los elementos que deben estar por delante o por detrás de otros.

source: Select vector strokes, create groups and set their layering order to better manage the drawing.
es: Seleccionar trazos vectoriales, crear grupos y definir el orden de sus planos para poder administrar mejor el dibujo.

source: **To bring the selection to front:**
es: **Para traer la selección al frente:**

source: Choose Edit → Arrange → **Bring to Front**.
es: Elegir Editar → Ordenar → **Traer al frente**.

source: Right-click on the selection and choose **Bring to Front** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Traer al frente** en el menú.

source: **To bring the selection one level forward:**
es: **Para traer la selección un nivel hacia adelante:**

source: Choose Edit → Arrange → **Bring Forward**.
es: Elegir Editar → Ordenar → **Traer hacia adelante**.

source: Right-click on the selection and choose **Bring Forward** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Traer hacia adelante** en el menú.

source: **To send the selection back:**
es: **Para enviar la selección al fondo:**

source: Choose Edit → Arrange → **Send Back**.
es: Elegir Editar → Ordenar → **Enviar al fondo**.

source: Right-click on the selection and choose **Send Back** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Enviar al fondo** en el menú.

source: **To send the selection one level backward:**
es: **Para enviar la selección un nivel hacia atrás:**

source: Choose Edit → Arrange → **Send Backward**.
es: Elegir Editar → Ordenar → **Enviar hacia atrás**.

source: Right-click on the selection and choose **Send Backward** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Enviar hacia atrás** en el menú.

source: Editing Vector Drawings
es: Edición de dibujos vectoriales

source: Vector drawings can be edited in some additional ways by using the set of tools. This allows you for example to better calibrate the bend of a vector, or to change its thickness.
es: Los dibujos vectoriales pueden ser editados de ciertas formas adicionales usando el conjunto de herramientas vectoriales. Esto permite, por ejemplo, calibrar de una mejor manera la curvatura de los trazos o cambiar su grosor.

source: All these transformations can be also achieved on already painted drawings, because the fill styles used to paint will automatically follow the shape of the areas you modify, working like “liquid” color, flooding an area defined by an outline.
es: Todas estas transformaciones también pueden ser realizadas sobre dibujos ya pintados, ya que los Estilos usados al rellenar seguirán automáticamente las modificaciones a la forma de las áreas definidas por éstos, funcionando como un color "líquido", que inunda cada área definida por sus contornos.

source: Editing Vector Control Points
es: Edición de puntos de control vectoriales

source: To modify a vector by editing its control points you can use the **Control Point Editor** tool (|cpe|).
es: Para modificar un trazo vectorial mediante la edición de sus puntos de control, es posible usar la herramienta **Editar puntos de control** (|cpe|).

source: Control points have handles whose length and direction define the bend of the vector. With this tool you can select a vector and modify the control point handles, or the bend of a curve defined by control points, and move, add or delete control points.
es: Los puntos de control tienen tangentes, cuya longitud y dirección definen la curvatura del trazo. Con esta herramienta es posible seleccionar un trazo y modificar las tangentes de sus puntos de control (o la curvatura del trazo), así como mover, agregar y borrar puntos de control.

source: Control point handles may be linked, that is to say they share the same direction, or not, creating a cusp in the vector; they can also be collapsed in the control point in order to turn it in a corner point. In case only one handle is collapsed, the point will be corner on one side and smooth on the other. When a section of the vector is defined by two corner points, it will be a straight line.
es: Las tangentes de los puntos de control pueden estar alineadas o no, creando en este último caso una cúspide en el trazo; también es posible colapsarlas logrando una curvatura lineal en ese punto de control. En caso de que sólo una de las tangentes haya sido colapsada, el punto será lineal de uno de los lados y tendrá una curvatura Bézier del otro lado. Cuando un segmento del trazo esté definido por dos puntos de control lineales, su forma será de línea recta.

source: The option Auto Select Drawing is available to automatically select any vector of any drawing visible in the viewer.
es: La opción **Seleccionar dibujo automáticamente** se encuentra disponible en barra de opciones de herramientas para permitir seleccionar automáticamente cualquier trazo de cualquier nivel visible en el Visor, sin necesidad de tener que seleccionar primero el nivel, para luego recién poder seleccionar uno de sus trazos.

source: Click to select a vector stroke and edit its control points; Alt-click to unlink control point handles; Ctrl-click (PC) or Cmd-click (Mac) the selected stroke to add a control point.
es: Hacer clic sobre un trazo para seleccionarlo y poder editar sus puntos de control; hacer Alt-clic para desvincular las tangentes de sus puntos de control; hacer Ctrl-clic (PC) o Cmd-clic (Mac) sobre el trazo seleccionado para agregar un punto de control.

source: **To select a vector:**
es: **Para seleccionar un trazo:**

source: Click it.
es: Hacer clic sobre él.

source: **To edit the bend of a vector:**
es: **Para editar la curvatura de un trazo:**

source: Click and drag the ends of the control point handles.
es: Hacer clic y arrastrar los extremos de las tangentes del punto de control.

source: Click and drag the curve defined by the control points to edit it.
es: Hacer clic y arrastrar el segmento de curva definido por los puntos de control para editarlo.

source: Shift-click and drag the curve defined by the control point to edit it by keeping the control points position fixed.
es: Hacer Mayúsculas-clic y arrastrar el segmento de curva definido por los puntos de control para editarlo, manteniendo la posición de los puntos de control fija.

source: **To unlink the control point handles:**
es: **Para desvincular las tangentes de un punto de control:**

source: Alt-click one of the handle ends and drag.
es: Hacer Alt-clic sobre el extremo de una de las tangentes y arrastrar.

source: **To link the control point handles:**
es: **Para vincular las tangentes de un punto de control:**

source: Alt-click one of the handle ends and drag: the other handle snaps to the direction of the one you are dragging.
es: Hacer Alt-clic sobre el extremo de una de las tangentes y arrastrar: la otra tangente saltará para alinearse a la dirección de la que se está arrastrando.

source: **To add a control point:**
es: **Para agregar un punto de control:**

source: Ctrl-click (Pc) or Cmd-click (Mac) the vector where you want to add a control point.
es: Hacer Ctrl-clic (Pc) o Cmd-clic (Mac) sobre el trazo en donde se desee agregar un nuevo punto de control.

source: **To select control points:**
es: **Para seleccionar puntos de control:**

source: Click a control point to select it.
es: Hacer clic sobre un punto de control para seleccionarlo.

source: Ctrl-click (Pc) or Cmd-click (Mac) a control point to add it to the selection.
es: Hacer Ctrl-clic (Pc) o Cmd-clic (Mac) sobre un punto de control para agregarlo a la selección.

source: Click and drag to select all of the control points that are included in the selection area.
es: Hacer clic y arrastrar sobre un área vacía para seleccionar todos los puntos de control incluidos en el marco de selección.

source: **To move the selection:**
es: **Para mover la selección:**

source: Click any selected control point and drag.
es: Hacer clic sobre cualquiera de los puntos de control seleccionados y arrastrar.

source: Use the Arrow keys to move the selection one pixel right, left, up or down.
es: Usar las teclas de flechas del teclado para mover la selección de a 1 píxel en cualquiera de las cuatro direcciones.

source: **To delete the selection:**
es: **Para borrar la selección:**

source: Choose Edit → Delete.
es: Elegir Editar → Borrar.

source: **To turn a control point into a corner point:**
es: **Para hacer que un punto de control sea lineal:**

source: Alt-click the control point.
es: Hacer Alt-clic sobre el punto de control.

source: Move the handle ends to the control point, in order to collapse them.
es: Mover el extremo de una de las tangentes hacia su punto de control para colapsarla.

source: Right-click the control point and choose **Set Linear Control Point** from the menu that opens.
es: Hacer clic derecho sobre el punto de control y elegir la opción **Punto de control Lineal** en el menú.

source: **To retrieve handles from a corner point:**
es: **Para recuperar las tangentes de un punto de control:**

source: Alt-click the corner point.
es: Hacer Alt-clic sobre el punto de control.

source: Right-click the control point and choose **Set Nonlinear Control Point** from the menu that opens.
es: Hacer clic derecho sobre el punto de control y elegir la opción **Punto de control Bezier** en el menú.

source: Changing the Bend of Vector Strokes
es: Cambio de curvatura de trazos vectoriales

source: To modify a bend of a vector stroke in a more intuitive way you can use the **Pinch** tool (|pinch|). You can use it anywhere you want on the stroke, in order to modify the bend in any direction.
es: Es posible usar la herramienta **Pellizcar** (|pinch|) para modificar la curvatura de un trazo vectorial de una manera más intuitiva. Es posible usarla en cualquier parte del mismo, para modificar su curvatura en cualquier dirección.

source: When the tool is selected, a segment of the center line of the closest stroke is highlighted: the segment shows the length of the stroke that will be affected by the pinching.
es: Cuando la herramienta se encuentra seleccionada, un segmento del trazo más cercano es resaltado: el segmento indica la porción del trazo que será afectada por la operación.

source: The length of the segment depends on the corner points, that the tool automatically detects along the stroke, according to the **Corner** value. It can also be manually set by activating the **Manual** option, and thus using the **Size** value to set the affected length.
es: La longitud del segmento dependerá de los puntos de control que formen esquinas en la curvatura del trazo; éstas serán detectadas de forma automática de acuerdo al valor del parámetro **Ángulo**. Alternativamente, es posible definirlo directa, activando la opción **Manual** y luego usando el parámetro **Tamaño** para definir su longitud.

source: When the **Manual** mode is activated, a handle is displayed along the highlighted stroke to control interactively the length of the segment that will be affected by the tool. The handle has a double circle and a square at its ends, that allows you to do the following:
es: Cuando el modo **Manual** se encuentra activado, aparece un manipulador sobre el trazo que permite controlar de forma interactiva la longitud del segmento que será afectado por la herramienta. El manipulador contiene un círculo y un cuadrado en sus extremos, y permite realizar lo siguiente:

source: **Double circle** lets you move the handle along the segment.
es: **Círculo** permite mover el manipulador hasta el área del trazo en donde se desea medir la longitud del segmento afectado.

source: **Square** lets you increase the length of the segment affected by the tool by *clicking and dragging right*, or decrease it by *clicking and dragging left*.
es: **Cuadrado** permite aumentar o disminuir la longitud del segmento afectado por la herramienta, haciendo clic y arrastrando hacia la derecha o izquierda.

source: In both Automatic and Manual modes, different types of editing can be performed when clicking and moving the cursor:
es: Tanto en el modo automático como en el Manual, es posible realizar distintos tipos de edición al hacer clic y arrastrar el cursor:

source: **Click** and drag to change the bend of the highlighted segment.
es: **Clic** y arrastrar para cambiar la curvatura del segmento resaltado.

source: **Shift-click** and drag to edit the highlighted segment by adding a *cusp*.
es: **Mayúsculas-clic** y arrastrar para editar el segmento resaltado, formando una *cúspide*.

source: **Ctrl-click** (Pc) or **Cmd-click** (Mac) and drag to edit the highlighted segment by adding a *corner*.
es: **Ctrl-clic** (Pc) o **Cmd-clic** (Mac) y arrastrar para editar el segmento resaltado, formando una *esquina*.

source: **To modify the bend of a stroke:**
es: **Para modificar la curvatura de un trazo:**

source: Change the length of the segment affected by the tool by setting the **Corner** value in the tool options bar.
es: Cambiar la longitud del segmento afectado por la herramienta, usando el parámetro **Ángulo** en la barra de opciones de herramientas.

source: Click, Shift-click, or Ctrl-click (Pc) or Cmd-click (Mac) and drag to modify the bend of the highlighted segment.
es: Hacer clic, Mayúsculas-clic, o Ctrl-clic (PC) o Cmd-clic (Mac) y arrastrar para modificar la curvatura del segmento resaltado.

source: Click and drag to change the bend; Shift-click to add a cusp; Ctrl-click (PC) or Cmd-click (Mac) to add a corner.
es: Hacer clic y arrastrar para cambiar la curvatura; Mayúsculas-clic para formar una cúspide; Ctrl-clic (PC) o Cmd-clic (Mac) para formar una esquina.

source: **To modify the bend of a stroke in manual mode:**
es: **Para modificar la curvatura de un trazo en modo manual:**

source: Activate the **Manual** option in the tool options bar.
es: Activar la opción **Manual** en la barra de opciones de herramientas.
