Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: es

source: The **Selection** tool (|selection|) allows you to edit, move, rotate, scale and distort a selection in a drawing.
es: La herramienta **Seleccionar** (|selection|) permite editar, mover, rotar, escalar y distorsionar una selección de un dibujo.

source: **Type:** has the options **Rectangular**, to select the area of the box you define by clicking and dragging; **Freehand**, to select the area you outline by clicking and dragging; and **Polyline**, to select the area you outline by defining a series of lines. In vector drawings, a vector stroke is selected only if it is fully included in the area you define.
es: **Tipo:** tiene las opciones **Rectangular**, para seleccionar el área incluida en el rectángulo definido al hacer clic y arrastrar; **Lazo**, para seleccionar el área delineada al hacer clic y arrastrar; y **Línea poligonal**, para seleccionar el área definida por una serie de líneas conectadas. En niveles vectoriales, un trazo es seleccionado si se encuentra completamente comprendido en el área definida.

source: **Mode:** has the options **Standard**, to select vectors; **Selected Frames**, to edit all the lines of selected frames at once; **Whole Level**, to transform all of the drawings of the current animation level; **Same Style**, to select at once all of the vectors painted with the same style in the current drawing; **Same Style on Selected Frames**, to select at once all of the vector strokes painted with the same style in the selected frames of the current animation level; **Same Style on Whole Level**, to select at once all of the vector strokes painted with the same style in all the drawings of the current animation level; **Boundary Strokes**, to select all the boundary strokes of the current drawing; **Boundary Strokes on Selected Frames**, to select all the boundary strokes of the selected frames; **Boundary Strokes on Whole Level**, to select all the boundary strokes of the whole level.This is available for Toonz Vector drawings only.
es: **Modo:** tiene las opciones **Estándar**, para seleccionar trazos vectoriales; **Fotogramas seleccionados**, para editar de una vez todas las líneas de los fotogramas seleccionados; **Todo el nivel**, para transformar todos los dibujos del nivel de animación actual; **Mismo estilo**, para seleccionar de una vez todos los trazos pintados con el mismo estilo en el dibujo actual; **Mismo estilo en fotogramas seleccionados**, para seleccionar de una vez todos los trazos pintados con el mismo estilo en los fotogramas seleccionados del nivel de animación actual; **Mismo estilo en todo el nivel**, para seleccionar de una vez todos los trazos pintados con el mismo estilo en todos los dibujos del nivel de animación actual; **Trazos limítrofes**, para seleccionar todos los trazos limítrofes del dibujo actual; **Trazos limítrofes en fotogramas seleccionados**, para seleccionar todos los trazos limítrofes en los fotogramas seleccionados; **Trazos limítrofes en todo el nivel**, para seleccionar todos los trazos limítrofes en todo el nivel. Se encuentra disponible sólo en niveles Vectorial de Toonz.

source: **Preserve Thickness** will preserve the original thickness of the drawing vectors while performing resizing operations. This is available for Toonz Vector drawings only.
es: **Preservar grosor** preservará el grosor original de los trazos vectoriales al realizar operaciones de redimensionamiento. Se encuentra disponible sólo en niveles Vectorial de Toonz.

source: **Scale H** and **V** set the horizontal and vertical scaling of the current selection.
es: **Escala H** y **V** permite definir la escala horizontal y vertical de la selección actual.

source: **Link** will maintain the proportion of the selection while draging over any of the Scale **H** or **V** letters in the tool options bar.
es: **Vinculado** mantendrá la proporción de la selección, mientras se arrastra sobre alguna de las letras de Escala **H** o **V** en la barra de opciones de herramientas.

source: **Rotation** sets the rotation of the current selection.
es: **Rotación** permite definir la rotación de la selección actual.

source: **Position X** and **Y** set a vertical and horizontal offset for the selection.
es: **Posición X** e **Y** permiten definir un desplazamiento horizontal o vertical para la selección.

source: **Thickness** sets the thickness of the selected vector strokes. In case the selected strokes have variable thickness, or different thickness values, the highest value is displayed, and any change will affect the other values accordingly. This is available for Toonz Vector drawings only.
es: **Grosor** permite definir el grosor de los trazos seleccionados. En caso de que los trazos seleccionados tengan un grosor variable, o distintos valores de grosor, se mostrará el valor más alto, y cualquier cambio afectará a los otros valores de forma proporcional. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Cap:** sets the shape of the ends of the selected vector strokes. Options are **Butt** for squared ends, **Round** for semicircular ends, and **Projecting** for squared ends extending beyond the end of the line, according to the stroke thickness. This is available for Toonz Vector drawings only.
es: **Extremos:** permite definir la forma de los extremos de los trazos seleccionados. Las opciones son **Rectos** para extremos rectos, **Redondeados** para extremos semicirculares, y **Proyectantes** para extremos rectos que se extienden más allá del final del trazo, de acuerdo al grosor de la línea. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: A butt cap, a round cap and a projecting cap.
es: Un extremo recto, uno redondeado y uno proyectante.

source: **Join:** sets the shape of the straight corners along the selected vector strokes. Options are **Miter** for pointed corners, **Round** for rounded corners, **Bevel** for squared corner. This is available for Toonz Vector drawings only.
es: **Esquinas:** permite definir la forma de las esquinas pronunciadas a lo largo del trazo seleccionado. Las opciones disponibles son: **En inglete** para esquinas en punta, **Redondeadas** para esquinas redondeadas, **Biseladas** para esquinas con un bisel recto. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: Miter joins, round joins and bevel joins.
es: Esquinas en inglete, redondeadas y biseladas.

source: **Miter:** sets the maximum length of a *Miter* join, that is computed multiplying the Miter value by the stroke thickness. If the length exceeds the maximum value, the *Miter* join is turned into a *Bevel* join. This is available for Toonz Vector drawings only, and only if the **Join:** option is set to **Miter**.
es: **Inglete:** permite definir la *longitud máxima* de las esquinas en inglete, que se calcula multiplicando este valor por el grosor del trazo. Si la longitud excede el valor máximo, la esquina *En inglete* se transformará en una esquina *Biselada*. Se encuentra disponible sólo para niveles Vectorial de Toonz, y sólo cuando la opción **Esquinas** está en **En inglete**.

source: **Modify Savebox** check box allows you to resize the *Savebox* of a drawing. The drawing part that, because of the editing, falls outside of the savebox will be erased. This is available for Toonz Raster drawings only.
es: **Modificar marco delimitador** permite redimensionar el *Marco delimitador* de un dibujo. La parte del dibujo que, producto de esta edición, quede fuera del marco delimitador será borrado. Se encuentra disponible sólo para niveles de Imagen de Toonz.

source: The *Savebox* size can be set automatically to the minimum size by activating the Preferences → Drawing → **Minimize Savebox after Editing** option.
es: Es posible restringir automáticamente el tamaño del *Marco delimitador* a un tamaño mínimo, activando la opción Preferencias → Dibujo → **Minimizar marco delimitador luego de editar**.

source: **No Antialiasing** when activated, the antialiasing is not applied when the selection is deformed or rotated. This is available on Toonz Raster and Raster drawings only.
es: **Sin suavizado de bordes** permite no aplicar suavizado de bordes al deformar o rotar la selección. Se encuentra disponible sólo para niveles de Imagen de Toonz e Imagen.

source: If the tool options bar is too short to display all the tool options, it can be scrolled by using the arrow buttons available at its ends.
es: Si la barra de opciones de herramientas es demasiado corta para mostrar todas las opciones, es posible desplazarla usando los botones con flechas disponibles en sus extremos.

source: When a selection is made, it is displayed with a bounding box with handles that allow you to perform the following transformations:
es: Al realizar una selección, la misma es mostrada con un marco delimitador con asas que permiten realizar las siguientes transformaciones:

source: **Move**, click and drag the inside of the raster selection, or any selected vector of a vector selection, to move it; by pressing the **Shift** key while dragging, the movement will be constrained on the horizontal or vertical direction.
es: **Mover**, para mover hacer clic y arrastrar dentro de la selección de la imagen o del trazo vectorial seleccionado; si se presiona la tecla **Mayúsculas** mientras se arrastra, el movimiento sólo podrá ser horizontal o vertical.

source: The keyboard arrow keys can be used as well to move the selection one pixel in any direction; if they are used while pressing the **Shift** key, the movement will be in 10 pixels steps.
es: También es posible usar las teclas de flechas del teclado para mover la selección de a 1 píxel en cualquier dirección; si además se mantiene presionada la tecla **Mayúsculas**, el movimiento se producirá en saltos de a 10 píxeles.

source: **Rotate**, click and drag outside any corner handle to rotate the selection.
es: **Rotar**, hacer clic y arrastrar en la parte exterior de cualquiera de las esquinas para rotar la selección.

source: **Scale**, click and drag any corner handle to scale the selection freely; by pressing the **Shift** key while dragging the scaling will be uniform; by pressing the **Alt** key the scaling will be applied from the center.
es: **Redimensionar**, hacer clic y arrastrar en cualquiera de las esquinas para redimensionar libremente la selección; si se mantiene presionada la tecla **Mayúsculas** mientras se arrastra, el redimensionamiento será uniforme; si se mantiene presionada la tecla **Alt** el redimensionamiento se aplicará desde el centro de la selección.

source: **Scale in one direction**, click and drag any side handle to scale the selection in one direction; by pressing the **Alt** key the scaling will be applied symmetrically from the center.
es: **Redimensionar en una sola dirección**, hacer clic y arrastrar en cualquiera de las asas laterales para redimensionar la selección en una dirección; si se mantiene presionada la tecla **Alt** el redimensionamiento será aplicado de forma simétrica desde el centro.

source: **Center**, click and drag the center handle to change the center of rotation, and the center used when Alt-scaling.
es: **Centro**, hacer clic y arrastrar el asa central para cambiar la posición del centro de rotación y redimensionamiento.

source: **Distort**, Ctrl-click (PC) or Cmd-click (Mac) any corner handle to distort the selection, or any side handle to shear it.
es: **Distorsionar**, hacer Ctrl-clic (PC) o Cmd-clic (Mac) en cualquiera de las esquinas para distorsionar la selección, o en cualquiera de las asas laterales para producir una inclinación.

source: Ctrl-click (PC) or Cmd-click (Mac) operations are not allowed in **Whole Level** modes (see above).
es: Las operaciones usando Ctrl-clic (PC) o Cmd-clic (Mac) no son permitidas en los modos de selección para **Todo el nivel** (ver más arriba).

source: **Thickness**, click the double arrow-head at the bottom right corner of the selection and drag up to increase the thickness of selected lines, down to decrease it. This option is available for Toonz Vector drawings only.
es: **Grosor**, hacer clic en el ícono que muestra dos flechas en la parte inferior derecha del marco de selección y arrastrar hacia arriba para aumentar el grosor de los trazos seleccionados o hacia abajo para disminuirlo. Esta opción sólo se encuentra disponible en niveles Vectorial de Toonz.

source: To apply the transformations you can click outside the selection.
es: Para aplicar las transformaciones basta con hacer clic fuera del marco de selección.

source: As you roll over the handles, the cursor changes shape to indicate the operations you may perform.
es: A medida que se pasa por encima de las asas, el puntero cambia su forma para indicar las operaciones que es posible realizar.

source: Selections can also be Cut, Copied, Pasted and Deleted by using the relevant command in the Edit menu. Cut or Copy and Paste also work from one drawing to another, or onto a new one. This allows you to copy or move a section of a drawing to another drawing, or split a drawing into several ones.
es: También es posible Cortar, Copiar, Pegar y Borrar las selecciones usando los comandos relevantes del menú Editar (o sus atajos de teclado). Cortar, Copiar y Pegar también funcionan de un dibujo a otro, o hacia un nuevo dibujo. Esto permite copiar o mover una selección de un dibujo a otro, o dividir un dibujo en varios.

source: When a drawing in a Toonz level, or a section of it is pasted to another one, the Styles of the pasted drawing are added to the palette of the target level, unless the same Styles are already available in the palette.
es: Cuando un dibujo o una selección de un dibujo en un nivel Toonz y es pegada en otro nivel Toonz, los Estilos del dibujo pegado son agregados a la paleta del nivel de destino, a menos que los mismos ya existieran allí previamente.

source: The selection can also be used to change the Style of vector strokes by choosing it in the palette, or by creating a new Style while selected. See :ref:`Editing Styles <editing_styles>` .
es: También es posible usar la herramienta de selección para cambiar el Estilo aplicado a trazos vectoriales, eligiendo un Estilo en la paleta o creando uno nuevo, mientras se mantiene seleccionado el trazo. Ver :ref:`Edición de trazos <editing_styles>` .

source: **To edit the drawing savebox:**
es: **Para editar el marco delimitador de un dibujo:**

source: Activate the **Modify Savebox** option to visualize the savebox around the drawing.
es: Activar la opción **Modificar marco delimitador** para visualizar el mismo alrededor del dibujo.

source: Use the handles to resize it.
es: Usar las asas para modificarlo.

source: Deactivate the **Modify Savebox** option to confirm the changes.
es: Desactivar la opción **Modificar marco delimitador** para confirmar los cambios.

source: **To select and transform an area in a Toonz Raster or Raster level:**
es: **Para seleccionar y transformar un área de un nivel de Imagen de Toonz o de Imagen:**

source: Select the area by doing one of the following:
es: Seleccionar el área haciendo una de las siguientes cosas:

source: Set the type to **Rectangular** and click and drag to define the box whose area you want to select.
es: Definir el tipo como **Rectangular**, hacer clic y arrastrar para definir el área rectangular que se desea seleccionar.

source: Set the type to **Freehand** and click and drag to outline the area you want to select.
es: Definir el tipo como **Lazo**, hacer clic y arrastrar para definir el contorno del área que se desea seleccionar.

source: Set the type to **Polyline** and click to outline the area you want to select by defining a series of lines.
es: Definir el tipo como **Línea poligonal**, hacer varios clics para definir el contorno del área que se desea seleccionar.

source: Do one of the following to make geometric transformations:
es: Hacer una de las siguientes cosas para realizar transformaciones geométricas:

source: Operate the handles available along the bounding box.
es: Hacer uso de las asas disponibles alrededor del marco delimitador de la selección.

source: Edit the scale, rotation and position values available in the tool options bar.
es: Editar los valores de posición rotación y escala, disponibles en la barra de opciones de la herramienta.

source: First define the area you want to select, then use the bounding box to make geometric transformations.
es: Definir en primera instancia el área que se desea seleccionar y luego usar el marco delimitador para realizar las transformaciones geométricas.

source: **To select and transform vectors in a Toonz Vector level:**
es: **Para seleccionar y transformar trazos en un nivel Vectorial de Toonz:**

source: Select the vectors by doing one of the following:
es: Seleccionar los vectores haciendo una de las siguientes cosas:

source: Click a stroke to select it.
es: Hacer clic sobre un trazo para seleccionarlo.

source: Shift-click to add a stroke to or remove it from the current selection.
es: Mayúsculas-clic para agregar o remover un trazo de la selección actual.

source: Set the type to **Rectangular** and **click and drag to the right** to define a box and select all the strokes that are *completely* included in the box; **click and drag to the left** to select all the strokes that are *partially* included in the box.
es: Definir el tipo como **Rectangular** y **hacer clic y arrastrar hacia la derecha** para definir un marco para seleccionar todos los trazos que estén *completamente* incluidos en el mismo; **hacer clic y arrastrar hacia la izquierda** para seleccionar todos los trazos que estén *parcialmente* incluidos en el marco.

source: Set the type to **Freehand** and click and drag to outline an area and select all the strokes that are completely included in the area.
es: Definir el tipo como **Lazo** y hacer clic y arrastrar para definir el contorno de un área para seleccionar todos los trazos que estén completamente incluidos en la misma.

source: Set the type to **Polyline** and click to outline an area by defining a series of lines and select all the strokes that are completely included in the area.
es: Definir el tipo como **Línea poligonal**, hacer varios clics para definir el contorno de un área para seleccionar todos los trazos que estén completamente incluidos en la misma.

source: Set the mode to **Same Style** and click to select automatically all the vectors painted with the same style used for the vector you select in the current drawing, or Shift-click to add them to or remove them from the selection.
es: Definir el modo en **Mismo estilo** y hacer clic para seleccionar automáticamente todos los trazos pintados con el mismo Estilo usado para el vector seleccionado en el dibujo actual, o hacer Mayúsculas-clic para agregar o remover trazos de la selección.

source: When clicking a stroke belonging to a group, the whole group is selected (see :ref:`Grouping and Ungrouping Vectors <grouping_and_ungrouping_vectors>` ).
es: Al hacer clic sobre un trazo perteneciente a un grupo, se seleccionará el grupo completo (ver :ref:`Uso de grupos en niveles vectoriales <grouping_and_ungrouping_vectors>` ).

source: Do one of the following to make a geometric transformations:
es: Hacer una de las siguientes cosas para realizar transformaciones geométricas:

source: Edit the scale, rotation, position and thickness values available in the tool options bar.
es: Editar los valores de posición rotación y escala, disponibles en la barra de opciones de la herramienta.

source: First select the vector strokes you want to transform, then use the bounding box to make geometric transformations.
es: Primero seleccionar los trazos vectoriales que se desea transformar, luego usar el marco delimitador de la selección para realizar transformaciones geométricas.

source: **To select and transform all the drawings of a Toonz Vector level:**
es: **Para seleccionar y transformar todos los dibujos de un nivel Vectorial de Toonz:**

source: Set the mode to **Whole Level** to automatically select all the strokes in all of the drawings of the current animation level.
es: Definir el modo en **Todo el nivel** para seleccionar automáticamente todos los trazos en todos los dibujos del nivel de animación actual.

source: Set the mode to **Same Style on Whole Level** and click to select at once all of the strokes painted with the same style used for the stroke you selected in all of the drawings of the current animation level, or Shift-click to add them to or remove them from the selection.
es: Definir el modo en **Mismo estilo en todo el nivel** y hacer clic para seleccionar de una vez todos los trazos pintados con el mismo estilo del trazo seleccionado en todos los dibujos del nivel de animación actual, o hacer Mayúsculas-clic para agregarlos o removerlos de la selección.

source: Do one of the following to make geometric transformations affecting all of the level drawings:
es: Hacer una de las siguientes cosas para realizar transformaciones geométricas que afecten a todos los dibujos de un nivel:

source: When working on the whole level the bounding box displayed in the current level drawing is double-lined.
es: Al trabajar en los modos que afectan a **Todo el nivel** el marco delimitador mostrado en el dibujo del nivel actual tiene una doble línea.

source: **To paste a selection in another existing drawing:**
es: **Para pegar una selección en otro dibujo ya existente:**

source: Make a selection in the current drawing.
es: Hacer una selección en el dibujo actual.

source: Copy/cut it.
es: Copiarlo o cortarlo.

source: Select the other drawing in the Level Strip or in the Xsheet/Timeline.
es: Seleccionar el otro dibujo en la Cinta de nivel o la Planilla/Línea de tiempo.

source: Paste the copied/cut selection.
es: Pegar la selección copiada/cortada.

source: Selections from Toonz Raster and Toonz Vector levels can be pasted in any other type of drawing, automatically converting the pasted selection to the appropriate type; selections from standard Raster levels can only be pasted in other Raster drawings.
es: Es posible pegar las selecciones de niveles de Imagen de Toonz o Vectorial de Toonz en cualquier otro tipo de nivel, convirtiendo de forma automática la selección pegada al tipo apropiado; las selecciones hechas en niveles de Imagen, sólo pueden ser pegadas en otros niveles del mismo tipo.

source: **To paste a selection in a new drawing:**
es: **Para pegar una selección en un nuevo dibujo:**

source: Select an empty frame in the level strip or an empty cell in the .
es: Seleccionar un dibujo vacío en la Cinta de nivel o una celda vacía en la Planilla/Línea de tiempo.

source: **To merge several drawings into one drawing:**
es: **Para fusionar varios dibujos en uno sólo:**

source: Select the area you want to merge and copy/cut it.
es: Seleccionar el área que se desea fusionar y luego copiarla/cortarla.

source: Select the drawing you want to paste the selection to.
es: Seleccionar el dibujo donde se desea pegar la selección.

source: Several raster animation levels can also be merged at once by using the related command (see :ref:`Merging Animation Levels <merging_animation_levels>` ).
es: Es posible fusionar varios niveles de Imagen al mismo tiempo usando los comandos apropiados (ver :ref:`Fusión de niveles de animación <merging_animation_levels>` ).

source: **To split a drawing into several drawings:**
es: **Para dividir un dibujo en varios otros:**

source: Select the area you want to use as a new drawing and copy/cut it.
es: Seleccionar el área que se desea usar como un dibujo nuevo y luego copiarla/cortarla.

source: Select an empty cell in the .
es: Seleccionar una celda vacía en la Planilla/Línea de tiempo.
