Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: es

source: In **Outline** mode *two vector strokes* are generated to define each line in the drawing, and areas filled with different colors are separated by a stroke. This means that, for example, to change the bend of a line you have to change the bend of the two strokes defining it, and to change the thickness you have to model one or both strokes defining it. *The thickness of all the strokes is set to 0, so that they won’t be visible in the final render*.
es: En el modo **Contornos** se generarán *dos trazos vectoriales* para definir cada línea del dibujo, además las áreas que estén rellenas con diferentes colores serán separadas por un trazo. Esto significa que, por ejemplo, para cambiar la curvatura de una línea se necesitará modificar la curvatura de los dos trazos que lo definen, y para cambiar el grosor será necesario modelar uno o los dos trazos que lo definen. *El grosor de todos los trazos vectoriales se establecerá en 0, para que no sean visibles en la imagen final*.

source: Parameters that are not considered necessary by the user can be hidden using the **Options** button (|option|) at the bottom right of the **Convert To vector Pop Up**.
es: Los parámetros que no sean considerados necesarios podrán ser ocultados usando el botón de **Opciones** (|option|) en la parte inferior derecha del diálogo **Opciones de vectorización**.

source: In **Outline** mode the following settings are available:
es: En el modo **Contornos** las siguientes opciones se encuentran disponibles:

source: **Accuracy** sets how much the vector strokes will follow the shape of the original drawing lines. High values create more precise strokes, but makes them more complex.
es: **Precisión** permite definir en qué medida seguirán los trazos vectoriales a la forma de las líneas originales. Valores altos crean trazos más precisos, aumentando la complejidad de los mismos.

source: **Despeckling** removes small spots or marks from the converted images. Its value expresses the size in pixels of the maximum area that has to be removed.
es: **Desmanchado** permite remover pequeñas manchas o marcas de las imágenes convertidas. Su valor expresa el tamaño en píxeles de las áreas máximas que podrán ser removidas.

source: **Preserve Painted Areas**, when activated, includes all the colors in the converted level.
es: **Preservar áreas pintadas**, al estar activada, esta opción permite preservar todas las áreas de relleno en niveles de Imagen de Toonz (TLV), o todas las áreas pintadas con colores distintos del color de las líneas, en niveles de Imagen.

source: **Adherence** sets how much smooth curves bend toward full corners.
es: **Respetar** permite definir qué tanto se acercarán los trazos a formar esquinas pronunciadas.

source: **Angle** sets the angular threshold below which full corners are inserted in the image
es: **Ángulo** permite definir el umbral por debajo del cual se insertarán esquinas pronunciadas en la imagen.

source: **Curve Radius** sets the measure of a curve's radius below which it is replaced by a smooth corner
es: **Radio de curva** permite definir la medida del radio de la curva, por debajo del cual será reemplazada por una esquina suave.

source: **Max Colors** defines the maximum number of colors that are considered in the Raster image and used in the vector one. The value has to be set taking care of the real number of colors used in the Raster image. High values increase the time needed for the conversion. This is relevant for Raster levels only.
es: **Cantidad máx. de colores** permite definir la cantidad máxima de colores que serán considerados en la imagen original para ser usados en el nivel vectorial creado. El valor debe ser definido tomando en cuenta la cantidad real de colores usados en la imagen original. Valores altos aumentan el tiempo necesario para efectuar la conversión. Esto es relevante sólo para niveles de Imagen.

source: **Transparent Color** defines the color that has to be set as the transparent background of the resulting vector level. This is relevant for Raster levels only.
es: **Color transparente** permite definir el color que debe ser considerado como fondo transparente al generar el nivel vectorial. Esto es relevante sólo para niveles de Imagen.

source: **Tone Threshold** sets the value of the darkest pixels to be taken into account to detect lines to be converted to vector; for low values only the darkest pixels are considered thus resulting in thinner lines; for high values lighter pixels are considered too, thus resulting in thicker lines. This is relevant for Toonz Raster levels only.
es: **Umbral de tono** permite establecer el valor de los píxeles más oscuros a ser tomados en consideración para detectar líneas a ser convertidas a trazos vectoriales; para valores bajos sólo los trazos más oscuros serán considerados, resultando en líneas más delgadas; para valores altos los píxeles más claros también serán considerados, resultando en líneas más gruesas. Esto es relevante sólo para niveles Imagen de Toonz.

source: In **Centerline** mode the following settings are available:
es: En el modo **Líneas** las siguientes opciones se encuentran disponibles:

source: **Threshold** sets the value of the darkest pixels to be taken into account to detect lines to be converted to vector strokes; for low values only the darkest pixels are considered thus resulting in thinner strokes; for high values lighter pixels are considered too, thus resulting in thicker strokes. For Toonz Raster levels (TLV files) the process examines only pixels belonging to the lines; for Raster levels it examines pixels of the whole image.
es: **Umbral** permite definir el valor de los píxeles más oscuros a ser considerados al detectar líneas a ser convertidas en trazos vectoriales; para valores bajos sólo los píxeles más oscuros serán considerados, resultando en trazos más delgados; para valores más altos los píxeles más claros serán también considerados, resultando en trazos más gruesos. En niveles de Imagen de Toonz (archivos TLV) el proceso examina sólo los píxeles pertenecientes a las líneas; en niveles de Imagen lo hace con la imagen completa.

source: **Accuracy** sets how much the vector stroke will follow the shape of the original drawing lines. High values create more precise strokes but makes them more complex.
es: **Precisión** permite definir en qué medida seguirán los trazos vectoriales a la forma de las líneas originales. Valores altos crean trazos más precisos, aumentando la complejidad de los mismos.

source: **Despeckling** ignores during the conversion small areas generated by the image noise; the higher the value, the larger the areas ignored.
es: **Desmanchado** permite remover pequeñas manchas o marcas de las imágenes convertidas. Su valor expresa el tamaño en píxeles de las áreas máximas que podrán ser removidas.

source: **Max Thickness** sets the maximum vector stroke thickness; if this value is low very thick lines will be converted in two centerline strokes defining the line outline; if this value is high, they will be converted in a single centerline stroke.
es: **Grosor máximo** permite definir el grosor máximo de los trazos vectoriales generados; cuando este valor sea muy bajo, las líneas de un grosor elevado serán convertidas usando dos trazos vectoriales para definir su contorno; cuando el valor sea más alto, serán convertidas usando un sólo trazo vectorial.

source: **Thickness Calibration Start:** and **End:** calibrates the vector stroke thickness defined according to the **Threshold** value; a low value will reduce the stroke thickness preserving its integrity. A different value inserted in the **Start** / **End** field determines an animation of the thickness along the length of the level.
es: **Calibración del grosor Inicial:** y **Final:** permite calibrar el grosor de los trazos vectoriales definidos de acuerdo al valor de **Umbral**; un valor bajo reducirá el grosor de los trazos, preservando su integridad. En caso de ingresar valores distintos en los campos **Inicial** y **Final** se determinará que exista una animación del grosor a lo largo de la duración del nivel.

source: **Preserve Painted Areas**, when activated, preserves all painted areas in Toonz Raster levels (TLV files) and all the areas painted with colors different from the line color in Raster levels.
es: **Preservar áreas pintadas**, al estar activada, esta opción permite preservar todas las áreas de relleno en niveles de Imagen de Toonz (TLV), o todas las áreas pintadas con colores distintos del color de las líneas, en niveles de Imagen.

source: **Add Border** adds a vector stroke along the image border in order to detect also areas bleeding off the image edge.
es: **Agregar borde** permite agregar un trazo vectorial alrededor del borde de la imagen, para poder detectar también las áreas que se escapen fuera de los límites de la imagen.

source: **Enhanced ink recognition**, when activated, allows to vectorize Raster images (such as TGA, TIF, PNG etc...) without antialiasing along the lines. An heuristic is used to recognize lines and painted areas creating a PLI level, where the lines are seen as ink and the painted areas as paint.
es: **Reconocimiento mejorado de tinta**, al estar activada, esta opción permite vectorizar niveles de Imagen (tales como TGA, TIF, PNG etc...) sin suavizado de bordes en sus líneas. En este caso se utiliza un procedimiento heurístico para reconocer líneas y áreas al crear el nivel vectorial, donde las líneas son vistas como tinta y las áreas pintadas como rellenos.

source: It's possible to select the images or the level frames that have to be converted directly in the Xsheet/Timeline.
es: Es posible seleccionar imágenes o fotogramas del nivel que se desea convertir, directamente en la Planilla/Línea de tiempo.

source: When a conversion is performed, a new level is created according to the selection you made, and exposed in the Xsheet/Timeline in the next column/layer to that containing the source level. The new file will have the same name of the starting one, but with a PLI extension, and a “v” suffix, and is saved in the **+drawings** default folder.
es: Al realizarse una conversión, se crea un nuevo nivel de acuerdo a las opciones escogidas, y es expuesto en la Planilla/Líneade tiempo en la siguiente columna/capa a la que contiene el original a convertir. El nuevo archivo tendrá el mismo nombre del original, con el sufijo “v” y la extensión PLI, guardado en la carpeta **+drawings** del proyecto.

source: In case a PLI level with the same name already exists, the name of the new file will be followed by a progressive number.
es: En caso de que ya existiera un nivel PLI con el mismo nombre, el nombre del nuevo archivo contendrá un número al final.

source: **To convert raster drawings into vectors:**
es: **Para convertir niveles de Imagen a vectorial:**

source: Select the level frames to convert in the Xsheet/Timeline.
es: Seleccionar en la Planilla/Línea de tiempo los fotogramas del nivel que se desee convertir.

source: Choose Level → Convert → **Convert to Vectors...**
es: Elegir Nivel → Conversión → **Convertir en vectorial...**

source: In the dialog set parameters for the conversion.
es: En el diálogo definir los parámetros para la conversión.

source: Click the **Convert** button.
es: Hacer clic en el botón **Convertir**.

source: Checking the Convert to Vectors Process
es: Comprobación del proceso de conversión a vectorial

source: At the bottom of the **Convert-to-Vectors Settings** window a preview area is available to display the drawing selected in the Xsheet/Timeline, as it will be after the conversion according to the defined settings. At the same time it allows you to compare the final result with the original Raster drawing that is displayed on the left side, and to highlight the vector strokes structure by clicking the **Centerlines Check** button (|check|).
es: En la parde inferior del diálogo **Opciones de vectorización** existe un área de previsualización donde es posible comprobar el dibujo seleccionado en la Planilla/Línea de tiempo, tal como quedará luego de la conversión, según los parámetros definidos. Al mismo tiempo permite comparar el resultado final con el dibujo original que se muestra del lado izquierdo, así como resaltar la estructura de los trazos vectoriales, en caso de que la opción **Comprobación de líneas** (|check|) se encuentre activada.

source: You can activate or deactivate it, resize it or navigate its content.
es: Es posible activar o desactivar la vista previa, redimensionarla o desplazar su contenido en cualquier dirección.

source: If you change any parameter in the **Convert-to-Vector Settings**, the previewed drawing automatically updates to display how the changes affect the result.
es: Si se modifica cualquier parámetro en el diálogo **Opciones de vectorización**, el dibujo previsualizado se actualizará para mostrar el resultado de esos cambios.

source: **To activate the preview area:**
es: **Para activar el área de previsualización:**

source: In the Xsheet/Timeline select the drawing you want to preview.
es: En la Planilla/Línea de tiempo seleccionar el dibujo que se desee previsualizar.

source: Click the **Preview** button (|preview|) in the bottom bar of the Convert-to-Vector Settings window.
es: Hacer clic en el botón **Ver muestra** (|preview|) en la parte inferior izquierda del diálogo **Opciones de vectorización**.

source: **To deactivate the preview area:**
es: **Para desactivar el área de previsualización:**

source: **To resize the preview area:**
es: **Para redimensionar el área de previsualización:**

source: Do any of the following:
es: Hacer alguna de las siguientes cosas:

source: Click and drag the horizontal separator.
es: Hacer clic y arrastrar el separador horizontal.

source: Click and drag the separator toward the window border to hide the preview area.
es: Hacer clic y arrastrar el separador hacia la parte inferior de la ventana para ocultar el área de previsualización.

source: Click and drag the separator collapsed to the window border toward the window center to display again the preview area.
es: Hacer clic y arrastrar el separador colapsado junto al borde inferior de la ventana y arrastrarlo hacia arriba para volver a mostrar el área de previsualización.

source: **To navigate the preview area:**
es: **Para navegar el área de previsualización:**

source: Use the mouse wheel, or the zoom shortcut keys (by default + and - keys) to zoom in and zoom out.
es: Usar la rueda del ratón o los atajos de zoom (de forma predefinida las teclas **+** y **-**) para acercar o alejar la vista.

source: Middle-click and drag to scroll in any direction.
es: Hacer clic central y arrastrar para desplazar en cualquier dirección.

source: Use the reset view shortcut (by default the 0 key) to display preview at its actual size
es: Hacer clic derecho y elegir la opción **Restablecer vista** (o su atajo de teclado: 0) desde el menú, para mostrar el área de previsualización a su tamaño real.

source: **To activate and deactivate the Centerlines Check:**
es: **Para activar o desactivar la Comprobación de líneas:**

source: Click the **Centerlines Check** button (|check|) in the bottom bar of the Convert-to-Vector Settings window.
es: Hacer clic en el botón **Comprobación de líneas** (|check|) en la parte inferior izquierda del diálogo Opciones de vectorización.

source: Saving and Loading Convert To Vector Settings
es: Guardado y carga de las opciones de vectorización

source: Convert To Vector settings can be saved as *tnzsettings* files in order to have different settings for each level and to be loaded back and used in a different scene.
es: Es posible guardar las opciones de vectorización en forma de archivos *tnzsettings* para poder definir diferentes juegos de opciones para cada nivel y luego poder cargarlas para su uso en otras escenas.

source: Loaded Convert To Vector settings can also become the default settings for the scene or for the project (see :ref:`Scene Settings and Project Default Settings <scene_settings_and_project_default_settings>` ).
es: Las opciones de vectorización cargadas pueden también convertirse en las opciones predefinidas para una escena o para todo un proyecto (ver :ref:`Opciones de escena y opciones predefinidas de proyecto <scene_settings_and_project_default_settings>` ).

source: **To save the Convert To Vector settings:**
es: **Para guardar las opciones de vectorización:**

source: Click the **Save Settings** button (|save|) in the bottom bar of the Convert-to-Vector Settings window.
es: Hacer clic en el botón **Guardar opciones** (|save|) en la parte inferior derecha del diálogo Opciones de vectorización.

source: In the browser that opens choose for the *tnzsettings* file a location and a name, and click the **Save** button.
es: En el Explorador que se abre elegir una ubicación y un nombre para el archivo *tnzsettings* y hacer clic en el botón **Guardar**.

source: **To load saved Convert To Vector settings:**
es: **Para cargar opciones de vectorización guardadas:**

source: Click the **Load Settings** button (|load|) in the bottom bar of the Convert-to-Vector Settings window.
es: Hacer clic en el botón **Cargar opciones** (|load|) en la parte inferior derecha del diálogo Opciones de vectorización.

source: In the browser that opens retrieve the *tnzsettings* file you want to load, and click the **Load** button.
es: En el Explorador que se abre elegir el archivo *tnzsettings* que se desee cargar y hacer clic en el botón **Cargar**.

source: **To reset the Convert To Vector settings to the scene default:**
es: **Para restablecer las opciones de vectorización a las opciones predefinidas de la escena:**

source: Click the **Reset Settings** button (|reset|) in the bottom bar of the Convert-to-Vector Settings window.
es: Hacer clic en el botón **Restablecer opciones** (|reset|) en la parte inferior derecha del diálogo Opciones de vectorización.

source: Changing the Canvas Size
es: Cambio del tamaño del lienzo

source: It's possible to change the size of Toonz Raster and Raster levels, in order to increase or decrease the area around the images of a level.
es: Es posible cambiar el tamaño del lienzo en los niveles de Imagen de Toonz y de Imagen, para agrandar o disminuir el área alrededor de las imágenes del nivel.

source: |canvas_size|
es: |canvas_size_es|

source: The new size can be set in any unit supported by OpenToonz, by using absolute or relative values. If the canvas is enlarged, some white transparent area is added; if the canvas is reduced, some cropping is applied to the level images.
es: Es posible especificar el nuevo tamaño, en cualquier unidad soportada por OpenToonz, usando tanto valores absolutos como relativos. Si el lienzo es agrandado, se agregará un área transparente de color blanco alrededor; si fuera reducido, se aplicará un recorte a las imágenes del nivel.

source: **To change the canvas size:**
es: **Para cambiar el tamaño del lienzo:**

source: Select the Toonz Raster or Raster level you want to modify in the Xsheet/Timeline.
es: Seleccionar el nivel de Imagen de Toonz o de Imagen al cual se desea modificar, en la Planilla/Línea de tiempo.

source: Choose Level → **Canvas Size...**, the Canvas Size dialog opens.
es: Elegir Nivel → **Tamaño del lienzo...**, se abrirá el diálogo Tamaño del lienzo.

source: In the dialog set the **Unit** to express the new size of the canvas, and set the **Width** and **Height** of the new canvas; activate the **Relative** option to define the new size by specifying only the size the canvas has to increase or decrease.
es: En el diálogo definir la **Unidades** para expresar el nuevo tamaño del lienzo y definir los nuevos valores de **Ancho** y **Altura** del mismo; activar la opción **Relativo**, si se desea definir el nuevo tamaño especificando sólo la magnitud a aumentar o disminuir con respecto al tamaño actual.

source: Use the **Anchor** diagram to decide the position of the current canvas in the new one: the arrows are a reference to see how the new size will increase or decrease the current canvas size.
es: Usar el diagrama de **Anclaje** para decidir cuál es la posición del lienzo actual con respecto al nuevo: las flechas son una referencia que permite visualizar de qué manera el nuevo tamaño aumentará o disminuirá al lienzo actual.

source: Click the **Resize** button.
es: Hacer clic en el botón **Redimensionar**.

source: In case the new canvas size is smaller than the current one, a confirmation dialog will open, asking you whether you want to crop the canvas.
es: En caso de que el nuevo tamaño de lienzo sea menor que el actual, se abrirá un diálogo de confirmación, consultando acerca de si realmente se desea recortar el mismo.

source: Editing Drawings
es: Edición de dibujos

source: Toonz Vector, Toonz Raster and Raster levels, can be manipulated in OpenToonz.
es: Los niveles Vectorial de Toonz, Imagen de Toonz e Imagen pueden ser manipulados en OpenToonz.

source: To edit a drawing, for example to copy a part of it, you have first to select it in the Xsheet/Timeline or in the Level Strip. When selected in the Xsheet/Timeline, the viewer displays the whole scene contents at the current frame, when selected in the Level Strip, the viewer displays the selected frame of the current animation level only, to let you work more easily on it.
es: Para editar un dibujo, por ejemplo para copiar una parte del mismo, primero es necesario seleccionarlo en la Planilla/Línea de tiempo o en la Cinta de nivel. Al seleccionarlo en la Planilla/Línea de tiempo, el Visor mostrará la escena completa en el fotograma actual; al seleccionarlo en la Cinta de nivel, el Visor sólo mostrará el fotograma seleccionado de ese nivel, para permitir trabajar más fácilmente con él.

source: Drawings can be also selected directly in the viewer: this allows you to work on the different drawings visible at a certain frame with no need to retrieve them in the Xsheet/Timeline or Level Strip.
es: Los dibujos también pueden ser seleccionados directamente en el Visor: esto permite trabajar en los distintos dibujos visibles en un determinado fotograma sin necesidad de seleccionarlos en la Planilla/Línea de tiempo o en la Cinta de nivel.

source: All the editing performed on drawings is not saved until you save the related level, or use the **Save All** command (see :ref:`Saving Levels <saving_levels>` ).
es: Las operaciones de edición realizadas sobre los dibujos permanecerán únicamente en memoria, hasta que dichos niveles sean guardados o se utilice el comando **Guardar todo** (ver :ref:`Guardado de niveles <saving_levels>` ).

source: **To select the drawing to edit:**
es: **Para seleccionar un dibujo a editar:**

source: Select it in the Xsheet/Timeline or Level Strip.
es: Seleccionarlo en la Planilla/Línea de tiempo o la Cinta de nivel.

source: Right-click in the viewer the drawing you want to edit and in the menu that opens choose the **Select** command related to the column containing the drawing you want to edit.
es: Hacer clic derecho sobre el dibujo que se desea editar en el Visor y en el menú elegir el comando **Seleccionar** relativo a la columna que contiene al dibujo que se desea editar.

source: The right-click menu first lists all the columns containing overlapping drawings, then the columns and objects that are hierarchically linked to the clicked one.
es: Dicho menú muestra en primer lugar todas las columnas/capas que contienen dibujos superpuestos en el lugar donde se activó el menú, a continuación las columnas/capas y objetos que estén vinculados jerárquicamente a los mismos.

source: Using the Selection Tool
es: Uso de la herramienta Seleccionar
