Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: es

source: **To Create an inbetween drawing using the Shift and Trace feature:**
es: **Para crear un dibujo intermedio usando la función Desplazar y calcar:**

source: Create the first key drawing.
es: Crear el primer dibujo clave.

source: Create the second key drawing.
es: Crear el segundo dibujo clave.

source: Select the cell where you want to create the inbetween drawing.
es: Seleccionar la celda donde se desee crear el dibujo intermedio.

source: Activate View → **Shift and Trace**.
es: Activar Ver → **Desplazar y calcar**.

source: Sketch the path of action line beteween your reference points.
es: Bocetar la curva de línea de acción entre los puntos de referencia.

source: Activate View → **Edit Shift** and edit the position of the reference drawings.
es: Activar Ver → **Editar desplazamiento** y editar la posición de los dibujos de referencia.

source: Create the inbetween drawing.
es: Crear el dibujo intermedio.
