Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: es

source: Use the reset view shortcut (by default the **Alt + 0** key) or right-click in the viewer and select **Reset View** from the menu that opens, to display the viewer at its actual size, centered on the absolute center with no rotation applied.
es: Usar el atajo de **Restablecer vista** (de forma predefinida **Alt + 0**) o hacer clic derecho en el Visor y seleccionar Restablecer vista > **Restablecer vista** en el menú para mostrar el Visor usando el tamaño real, centrado en el centro absoluto y sin ninguna rotación aplicada.

source: Right-click and choose **Fit to Window** to automatically zoom the viewer so that it fits the camera box.
es: Hacer clic derecho y elegir **Ajustar a ventana** para corregir el zoom para que se ajuste al encuadre de la cámara.

source: **To play the scene contents back:**
es: **Para reproducir el contenido de la escena:**

source: Use the **Play** button.
es: Usar el botón **Reproducir**.

source: Drag the frame bar cursor.
es: Arrastrar la barra de fotogramas.

source: **To set the current frame:**
es: **Para establecer el fotograma actual:**

source: Use the playback buttons.
es: Usar los botones de reproducción.

source: Type in the **Current Frame** field the number of the frame you want to view.
es: Ingresar en el campo **Fotograma actual** el número del fotograma que se desea visualizar.

source: **To set the playback frame rate:**
es: **Para establecer la velocidad de reproducción:**

source: Enter a value in the **FPS** field.
es: Ingresar un valor en el campo **FPS:**

source: Use the frame rate slider.
es: Usar el deslizador de velocidad de fotogramas.

source: Adjusting the Viewer Visualization
es: Ajuste de la visualización en el Visor

source: The way the viewer visualizes the scene content can be adjusted according to the task to perform.
es: La forma en que el Visor muestra el contenido de la escena puede ser ajustado de acuerdo a la tarea a realizar.

source: **Full Screen** mode can be entered to maximize the viewer to the monitor screen, hiding any interface window border. This is available only on the Windows platform.
es: El **Modo a pantalla completa** puede ser activado para maximizar el Visor hasta el tamaño de la pantalla, ocultando los bordes de las ventanas de la interfaz. Por el momento esto sólo está disponible en Windows.

source: Vector drawings, that can slow down the visualization performance when used in large amounts in a scene, can be visualized as raster drawings, faster to visualize, still preserving their vector nature, by using the **Visualize Vector As Raster** option.
es: Los dibujos vectoriales, que pueden enlentecer el rendimiento de la visualización cuando son usados en gran número, pueden ser visualizados como simples imágenes, que son más rápidas de mostrar, preservando igualmente su característica vectorial. Para esto se debe usar la opción Ver > **Ver vectorial como imagen**.

source: If the current level is vector-based, it will still be displayed as vector to allow any drawing/editing operation you may perform.
es: Si el nivel seleccionado es uno vectorial, será mostrado como vectorial para permitir la realización de operaciones de dibujo o edición vectorial que se necesite realizar sobre el mismo.

source: Raster drawings and images that usually are displayed in the viewer according to their DPI value, can be displayed at their actual pixel size, that is to say that one pixel from the image is displayed as one pixel of the screen monitor, to better examine them.
es: Los dibujos de imagen y otras imágenes que normalmente se muestran en el Visor teniendo en cuenta sus valores de PPP, pueden ser mostradas con su valor real de píxel, esto es que un píxel de la imagen represente un píxel en la pantalla, para poder examinarlas con más precisión.

source: Visualizing an image at its actual pixel size is different from zooming in because zooming always takes into account the image DPI information.
es: Visualizar una imagen usando su valor de píxel real es diferente a usar el zoom, porque el zoom siempre toma en cuenta la información de PPP.

source: **Windows only - To enter the viewer full screen mode:**
es: **Sólo Windows - Para ingresar al Modo a pantalla completa:**

source: Right-click the viewer and choose **Full Screen Mode** from the menu that opens.
es: Hacer clic derecho sobre el Visor y elegir: **Modo a pantalla completa** en el menú.

source: **Windows only - To exit the viewer full screen mode:**
es: **Sólo Windows - Para salir del Modo a pantalla completa:**

source: Right-click the viewer and choose **Exit Full Screen Mode** from the menu that opens.
es: Hacer clic derecho y elegir **Salir de pantalla completa** en el menú.

source: **To activate or deactivate the raster visualization for vector drawings:**
es: **Para activar o desactivar la visualización de niveles vectoriales como imágenes.**

source: Activate or deactivate the View → **Visualize Vector As Raster** option.
es: Activar o desactivar la opción Ver → **Ver vectorial como imagen**.

source: **To display raster drawings and images at their actual pixel size:**
es: **Para mostrar dibujos e imágenes a su tamaño real de píxel:**

source: In the Xsheet/Timeline select the level to which the drawing or image belongs so that it becomes the current level.
es: En la Planilla/Línea de tiempo seleccionar el nivel al cual pertenece el dibujo o imagen.

source: Select the drawing or image in the Level Strip in order to display it alone.
es: Seleccionar el dibujo o imagen en la Conta de nivel, para mostrarlo de forma aislada.

source: Use the Actual Pixel Size shortcut (by default the **N** key) or right-click in the viewer and choose **Actual Pixel Size** from the menu that opens.
es: Hacer clic derecho en el Visor y elegir **Tamaño real de píxel** desde el menú o usar su atajo (de forma predefinida **N**).

source: Customizing the Viewer
es: Personalización del Visor

source: The Viewer can be customized according to your needs: the background colors visible in the Viewer and inside the camera box can be changed; a Field Guide and a Safe Area can be displayed for reference; the Table and Camera Box can be hidden; Custom Guides can be added to help you in aligning objects or composing the elements of the scene for a particular frame. The View → **Inks Only** check allows to hide the painted areas of the levels, facilitating the drawing process.
es: El Visor puede ser personalizado de acuerdo a diferentes necesidades: es posible cambiar el Color del fondo visible tanto en la Mesa de trabajo como en la Vista de cámara; es posible mostrar una Guía de campos y Áreas de seguridad como referencia; es posible ocultar la Mesa y el Marco de la cámara; se pueden crear Guías personalizadas para ayudar al alinear objetos o durante la composición de elementos en la imagen. La opción Ver → **Ver sólo tinta** permite ocultar las áreas ya pintadas para facilitar el proceso de dibujo.

source: The set of buttons and information available in the bottom bar of the Viewer can be customized as well, so that only the elements you require are visible.
es: Es posible personalizar el conjunto de botones e informaciones disponibles en la barra inferior del Visor, de manera que sólo los elementos requeridos sean mostrados.

source: **To change the Viewer Background color:**
es: **Para cambiar el color de Fondo del Visor:**

source: Open the File → Preferences... → **Colors** dialog.
es: Abrir el diálogo Archivo → Preferencias... → **Colores**.

source: Define the **Viewer BG Color** by doing one of the following:
es: Definir el **Fondo del visor** haciendo una de las siguientes cosas:

source: Set the Red, Green and Blue values.
es: Definir los valores para rojo, verde y azul.

source: Click the color thumbnail and use the **Style Editor** to edit it (see :ref:`Plain Colors <plain_colors>` ).
es: Hacer clic en la miniatura de color y usar el **Editor de estilos** para editarlo (ver :ref:`Colores plenos <plain_colors>` ).

source: **To change the Camera Box Background color:**
es: **Para cambiar el color de Fondo de la cámara:**

source: Open the Xsheet → **Scene Settings...** dialog.
es: Abrir el diálogo Planilla → **Opciones de escena...**

source: Define the **Camera BG Color** by doing one of the following:
es: Definir el **Color de fondo de cámara:** haciendo una de las siguientes cosas:

source: Set the Red, Green, Blue and Alpha values.
es: Definir los valores de rojo, verde, azul y alfa.

source: **To show or hide the Table:**
es: **Para mostrar u ocultar la Mesa:**

source: Choose View → **Table** to show or hide the table.
es: Activar o desactivar la opción Ver → **Mesa**.

source: **To show or hide the Camera Box:**
es: **Para mostrar u ocultar el Marco de la cámara:**

source: Choose View → **Camera Box** to show or hide the camera box.
es: Activar o desactivar la opción Ver → **Marco de cámara**.

source: **To show or hide the Camera Background color:**
es: **Para mostrar u ocultar el color de Fondo de la cámara:**

source: Choose View → **Camera BG Color** to show or hide the camera box background color.
es: Activar o desactivar Ver → **Color de fondo de la cámara**.

source: **To show or hide the Field Guide:**
es: **Para mostrar u ocultar la Guía de campos:**

source: Choose View → **Field Guide** to show or hide the field guide.
es: Activar o desactivar la opción Ver → **Guía de campos**.

source: **To define the displayed Field Guide:**
es: **Para definir la apariencia de la Guía de campos:**

source: Define the **Field Guide Size:** and **A/R:**. **Size** is the number of width fields of the field guide (1 field is equal to 1 inch), and the **A/R** is the ratio between the field guide width and height.
es: En el diálogo Planilla > **Opciones de escena** definir los valores para **Tamaño de guía de campos** y **Proporción**. El primero es el número de campos de la guía a lo ancho de la imagen (1 campo es igual a 1 pulgada); el segundo es la proporción entre el ancho y la altura de los cuadros de la guía de campos.

source: **To show or hide the Safe Area:**
es: **Para mostrar u ocultar las Áreas de seguridad:**

source: Choose View → **Safe Area** to show or hide the safe area.
es: Activar o desactivar la opción Ver → **Áreas de seguridad**.

source: **To add a Custom Guide:**
es: **Para agregar una Guía personalizada:**

source: Click in the ruler: a click in the horizontal ruler will create a vertical guide, a click in the vertical ruler will create an horizontal guide.
es: Hacer clic en la regla: un clic en la regla horizontal creará una guía vertical, un clic en la vertical creará una guía horizontal.

source: **To move a Custom Guide:**
es: **Para mover una Guía personalizada:**

source: Drag the custom guide marker in the ruler.
es: Arrastrar el marcador de la guía en la regla.

source: **To delete a Custom Guide:**
es: **Para borrar una Guía personalizada:**

source: Right-click on the guide marker in the ruler.
es: Hacer clic derecho sobre el marcador de la guía en la regla.

source: Drag its marker outside of the Viewer, in the opposite direction of the guide itself.
es: Arrastrar su marcador hacia afuera del Visor, en la dirección opuesta a la de la guía (p.ej: en una guía vertical, hacia arriba o en una horizontal hacia la izquierda).

source: **To show or hide Custom Guides:**
es: **Para mostrar u ocultar las Guías personalizadas:**

source: Choose View → **Guides** to show or hide the guides.
es: Activar o desactivar la opción Ver → **Guías**.

source: **To show or hide the Rulers where Custom Guide markers are located:**
es: **Para mostrar u ocultar las Reglas donde se ubican los marcadores de las Guías personalizadas:**

source: Choose View → **Rulers** to show or hide the rulers.
es: Activar o desactivar la opción Ver → **Reglas**.

source: When the Viewer work area is rotated, guides are rotated as well, but rulers and guide markers will preserve their position and orientation. However the position of a guide will still be controlled by markers, even if they visually don’t match anymore.
es: Al rotar el área de trabajo del Visor, las guías también rotarán, sin embargo sus marcadores preservarán sus posiciones y orientación en las reglas. Dichos marcadores aún continuarán determinando las posiciones de las guías personalizadas en el Visor.

source: **To customize the set of buttons in the bottom bar of the viewer:**
es: **Para personalizar el conjunto de botones en la barra inferior del Visor:**

source: Click the option button (|option|) on the far left of the bottom area, and select the elements to show, or deselect those to hide, in the menu that opens.
es: Hacer clic en el botón de opciones (|option|) en el extremo izquierdo del área inferior y seleccionar en el menú los elementos a ser mostrados o deseleccionar aquellos a ocultar.

source: Drawing Tools
es: Herramientas de dibujo

source: You can draw by using the **Brush** (|brush|) and **Geometric** (|geometric|) tools. For both tools you can set the thickness of the line you are going to draw: values range from 0 to 100 for Toonz Vector levels, and from 1 to 100 for Toonz Raster and Raster levels.
es: Es posible dibujar usando las herramientas **Pincel** (|brush|) y **Geometría** (|geometric|). En ambas herramientas es posible establecer el grosor de la línea que se va a dibujar: los valores para el **Tamaño** van de 0 a 100 para niveles Vectorial de Toonz, y de 1 a 100 para niveles Imagen de Toonz e Imagen.

source: For Toonz Raster and Raster levels it's possible to set a Brush tool size higher than 100 by typing it in the Size value fields.
es: En niveles de Imagen de Toonz e Imagen es posible establecer el **Tamaño** en valores mayores de 100, ingresando el valor en el campo numérico correspondiente.

source: **Min** and **Max Size/Thickness** can be modified by either of these methods:
es: Los valores de **Tamaño Mín** y **Máx** pueden ser modificados por cualquiera de los siguientes métodos:

source: Pressing **Ctrl + Alt** and moving the mouse. *Moving horizontally* changes the **Max** value, while *moving vertically* changes the **Min** value.
es: Presionando **Ctrl + Alt** y moviendo el ratón. El *movimiento horizontal* cambia el valor **Máx**, mientras que el *movimiento vertical* cambiará el **Mín**.

source: Using the predefined keyboard shortcuts. **U** and **I** for respectively decreasing and increasing the **Max** value, or **H** and **J** for respectively decreasing and increasing the **Min** value.
es: Usando los atajos de teclado predefinidos: **U** e **I** para disminuir y aumentar respectivamente el valor **Máx**, o **H** y **J** para disminuir y aumentar respectivamente el valor **Mín**.

source: With the **Brush** tool (|brush|), you can take full advantage of the pressure sensitivity if you are using a pressure sensitive tablet. The more you press on the tablet, the thicker the line you draw.
es: Con la herramienta **Pincel** (|brush|), es posible aprovechar la sensibilidad a la presión, cuando se utiliza una tableta de dibujo. Cuanto más se ejerza la presión, más grueso será el trazo dibujado.

source: With the **Geometric** tool (|geometric|), the thickness value is constantly applied to the whole shape you draw.
es: Con la herramienta **Geometría** (|geometric|), el valor de **Tamaño** será aplicado de forma constante a la figura dibujada.

source: When creating vector drawings the size/thickness can also be set to 0 (zero): in this case vector strokes will only exist as a wireframe even if you zoom in or zoom out, and they will be not visible when the animation is rendered.
es: Al crear dibujos vectoriales, el **Tamaño** también puede ser puesto en 0 (cero): en este caso, los trazos vectoriales sólo existirán como una línea discontinua tenue, aún en caso de utilizar el zoom, ya que no serán visibles cuando la animación sea procesada.

source: For vector drawings, line thickness can be changed and tweaked afterwards by using other tools (see :ref:`Editing Drawings <editing_drawings>` ).
es: En los trazos vectoriales, el grosor puede ser modificado y retocado encualquier momento, mediante la utilización de otras herramientas (ver :ref:`Edición de dibujos <editing_drawings>` ).

source: Drawing with the Brush Tool
es: Dibujo con la herramienta Pincel

source: The **Brush** tool (|brush|) allows you to draw freehand lines with the current style.
es: La herramienta **Pincel** (|brush|) permite dibujar líneas a mano alzada con el estilo seleccionado.

source: When using a pressure sensitive tablet, and the **Pressure** option is activated, varying the pressure of the pen on the tablet will allow you to create variable-thickness lines that will make your drawings more expressive.
es: Al usar una tableta sensible a la presión, y si la opción **Presión** se encuentra activada, variar la presión de la pluma sobre la tableta permitirá crear líneas de un grosor variable, lo que hará posible obtener dibujos más expresivos.

source: When using the **Brush** tool (|brush|) on Toonz Raster and Raster drawings, the cursor displays the exact pixel area that will be affected by the brush: the inner jagged circle representing the **Minimum Size**, and the outer one the **Maximum Size** of the brush.
es: Al usar la herramienta **Pincel** (|brush|) en niveles de Imagen de Toonz o Imagen, el cursor muestra el área exacta de píxeles que será afectada por el pincel: el círculo interior representa al **Tamaño Mín**, mientras que el exterior representa al **Tamaño Máx** del pincel.

source: In the tool options bar you can set the following:
es: En la Barra de opciones de herramientas es posible controlar las siguientes opciones:

source: **Size Min** and **Max** sets the size of the brush; the size will vary between the two values if you're using a pressure sensitive tablet. If the two values are the same, your lines will have a constant thickness. When using a mouse to draw, the **Maximum** thickness value will be used.
es: **Tamaño Mín** y **Máx** permite definir el tamaño del pincel; el grosor del trazo dibujado podrá variar entre ambos valores si se está usando una tableta sensible a la presión. Si los dos valores son iguales, las líneas tendrán un grosor constante. Al dibujar con un ratón, se utilizará siempre el valor **Máx**.

source: **Accuracy** sets how accurate the generated line is compared to what you draw with the mouse or tablet pen: a high value will generate lines that completely preserves the movement you perform (even a trembling hand); a low value will simplify the line. This is available for Toonz Vector drawings only.
es: **Precisión** permite definir la precisión de la línea generada, en comparación con la dibujada: un valor alto producirá líneas que conservan más fielmente los movimientos trazados (inclusive una mano temblorosa); un valor bajo tenderá a simplificar la línea. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Smooth** allows for stroke stabilization while drawing. This is available for Toonz Vector and Toonz Raster drawings only.
es: **Estabilidad** permite estabilizar el dibujo de trazos. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Hardness** sets the amount of antialiasing along the line border. This is available for Toonz Raster and Raster drawings only.
es: **Dureza** permite controlar el grado de definición del suavizado de bordes del trazo. Se encuentra disponible sólo para niveles de Imagen de Toonz e Imagen.

source: **Opacity Min** and **Max** sets the opacity of the brush; the opacity will vary between the two values if you're using a pressure sensitive tablet. Overlapping areas are not considered while drawing a single line, but only when different lines are overlapping. This is available for Raster drawings only.
es: **Opacidad Mín** y **Máx** permite definir la opacidad del pincel; la misma variará entre ambos valores si se está usando una tableta sensible a la presión. Se encuentra disponible sólo para niveles de Imagen.

source: **Break** automatically breaks the drawn stroke into sections, if very sharp angles are drawn: in this way, drawn shapes may result simpler and easier to fill. This is available for Toonz Vector drawings only.
es: **Quebrar** quiebra automáticamente los trazos dibujados en secciones, cuando los trazos dibujados contengan curvas con ángulos muy pronunciados: de esta manera las formas dibujadas pueden resultar más simples y fáciles de rellenar. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Draw Order** allows to choose how new drawings will be ordered with respect to already drawn lines. The options are: **Over All**, **Under All** and **Palette Order**. When using **Palette Order** new lines will be drawn above or below already existing ones, using the relative indexes of the palette Styles as the sorting factor. This is available for Toonz Raster drawings only.
es: **Orden** permite elegir cómo se ordenarán las nuevas líneas dibujadas, con respecto a las ya presentes en el dibujo. Las opciones son: **Por encima**, **Por debajo** y **Según paleta**. Al usar **Según paleta** las nuevas líneas serán dibujadas por encima o por debajo de las ya existentes, usando sus respectivos números de Estilo en la paleta, como factor de ordenamiento. Se encuentra disponible sólo para niveles de Imagen de Toonz.

source: **Pencil** mode draws lines without antialiasing, that is with jagged edges. This is available for Toonz Raster drawings only.
es: **Lápiz** permite el dibujo de trazos sin suavizado de bordes, produciendo bordes dentados. Se encuentra disponible sólo para niveles de Imagen de Toonz.

source: **Pressure** detects, in case you are using a graphic tablet, the pressure of the pen on the tablet, allowing the creation of variable-thickness lines.
es: **Presión** permite detectar y aplicar variaciones en la presión, al usar una tableta de dibujo, para producir trazos de grosor variable.

source: **Range** allows for the automatic creation of a series of in-between strokes, by drawing just the extremes of the animation on subsequent frames of a level, in the Level Strip, or subsequent exposed cells of a level in the Xsheet/Timeline. By pressing **Ctrl** key, you can draw intermediate strokes to form a more complex animation sequence. This method is similar to the one used by the **Inbetween** command (see :ref:`Using the In-betweener with Vector Drawings <using_the_in-betweener_with_vector_drawings>` ). This is available for Toonz Vector drawings only.
es: **Rango** permite la creación automática de una serie de trazos intermedios, dibujando solamente los extremos de la animación en fotogramas subsiguientes de un nivel, en la Cinta de nivel, o en celdas subsiguientes de un nivel en la Planilla/Línea de tiempo. Presionando la tecla **Ctrl**, se podrá dibujar trazos intermedios para conformar una secuencia de animación más compleja. Este método es similar al usado por el comando **Intermediar** (ver :ref:`Uso del comando Intermediar con dibujos vectoriales <using_the_in-betweener_with_vector_drawings>` ). Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Snap** allows for the snapping of the cursor to other already drawn strokes of the same level, while drawing a new stroke. It has three levels of sensitivity: **Low**, **Med** and **High**. This is available for Toonz Vector drawings only.
es: **Adherencia** permite adherir el cursor a otros trazos ya dibujados en el mismo nivel, mientras se dibuja un nuevo trazo. Tiene tres niveles de sensibilidad: **Baja**, **Media** y **Alta**. Se encuentra disponible sólo para niveles Vectorial de Toonz.
