Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: es

source: **Preset:** let you choose a brush preset in the option menu on the right. You can add or remove a preset clicking the **+** and **-** buttons. A presets list is created *for each level type* and each added preset will be available for next use.
es: **Ajustes:** permiten elegir un ajuste prestablecido de pincel en el menú de la derecha. Es posible agregar o eliminar un ajuste haciendo clic en los botones **+** y **-**. Las listas de ajustes prestablecidos son independientes *para cada tipo de nivel* y los ajustes creados permanecerán disponibles para futuros usos.

source: **Cap** option sets the shape of the ends of the stroke you are going to draw. Options are **Butt** for squared ends, **Round** for semicircular ends, and **Projecting** for squared ends extending beyond the end of the line, according to the vector thickness. This is available for Toonz Vector drawings only.
es: **Extremos** permite definir la forma de los extremos de los trazos a dibujar. Las opciones disponibles son: **Rectos** crea extremos rectos, **Redondeados** crea extremos semicirculares, y **Proyectantes** crea extremos rectos que se extienden más allá del final del trazo, de acuerdo al grosor del mismo. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Join** option sets the shape of the straight corners along the stroke you are going to draw. Options are **Miter** for pointed corners, **Round** for rounded corners, **Bevel** for squared corner. This is available for Toonz Vector drawings only.
es: **Esquinas** permite definir la forma de las esquinas pronunciadas a lo largo de los trazos a dibujar. Las opciones disponibles son: **En inglete** crea esquinas en punta, **Redondeadas** crea esquinas redondeadas, **Biseladas** crea esquinas con un bisel recto. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Miter:** sets the maximum length of a miter join, that is computed multiplying the miter value by the stroke thickness. If the length exceeds the maximum value, the *Miter* join is turned into a *Bevel* join. This is available for Toonz Vector drawings only, and only if the **Join** option is set to miter.
es: **Inglete:** permite definir la *longitud máxima* de las esquinas en inglete, que se calcula multiplicando este valor por el grosor del trazo. Si la longitud excede el valor máximo, la esquina *En inglete* se transformará en una esquina *Biselada*. Se encuentra disponible sólo para niveles Vectorial de Toonz, y sólo cuando la opción **Esquinas** está en **En inglete**.

source: If the tool options bar is too short to display all the tool options, it can be scrolled by using arrow buttons available at its ends.
es: Si la barra de opciones de herramientas es demasiado corta para mostrar todas las opciones, puede ser desplazada usando los botones con flechas en sus extremos.

source: **To add a new brush preset:**
es: **Para agregar un nuevo ajuste prestablecido de pincel:**

source: Click the **+** button on the right of the presets list.
es: Hacer clic en el botón **+** a la derecha de la lista de ajustes.

source: **To remove a new brush preset:**
es: **Para eliminar un ajuste prestablecido de pincel:**

source: Click the **-** button on the right of the presets list.
es: Hacer clic en el botón **-** a la derecha de la lista de ajustes.

source: Drawing with the Geometric Tool
es: Dibujo con la herramienta Geometría

source: The **Geometric** tool (|geometric|) allows you to draw rectangles, circles, ellipses, regular polygons, polylines and arcs.
es: La herramienta **Geometría** (|geometric|) permite dibujar curvas Bézier, arcos y formas geométricas predefinidas como: rectángulos, círculos, elipses y polígonos regulares.

source: **Thickness** sets the size of the brush used to draw the geometric shapes.
es: **Tamaño/Grosor** permite definir el tamaño del pincel, usado para dibujar las figuras geométricas.

source: **Hardness** sets the amount of antialiasing along the shape border. This is available for Toonz Raster and Raster drawings only.
es: **Dureza** permite controlar el grado de definición del suavizado de bordes de la figura. Se encuentra disponible sólo para niveles de Imagen de Toonz e Imagen.

source: **Opacity** sets the opacity of the shape border. Overlapping areas are not considered while drawing over the same shape, but only when different shapes are overlapping. This is available for Raster drawings only.
es: **Opacidad** permite definir la opacidad de los bordes de la figura. Las áreas superpuestas no serán consideradas dentro de una misma figura, sino sobre otras figuras distintas. Se encuentra disponible sólo para niveles de Imagen.

source: **Shape:** sets the type of shape you want to draw. Available options are: Rectangle, Circle, Ellipse, Line, Polyline, Arc and Polygon. In case you want to draw a **Polygon**, the **Polygon Sides:** lets you set the number of sides.
es: **Forma**: permite elegir el tipo de forma que se desea crear. Las opciones son: **Rectángulo**, **Círculo**, **Elipse**, **Línea**, **Curva Bézier**, **Arco** y **Polígono**. En caso de elegir **Polígono**, el parámetro **Lados:** permite definir la cantidad de lados del polígono a crear.

source: **Auto Group** automatically defines any drawn closed shape (i.e. rectangles, circles, ellipses, polygons and closed polylines) as a group, *thus creating a new layer that is placed in front of the other drawing vectors*, without intersecting them (see :ref:`Grouping and Ungrouping Vectors <grouping_and_ungrouping_vectors>` ). This is available for Toonz Vector drawings only.
es: **Agrupar automáticamente** permite definir automáticamente cada figura cerrada (rectángulo, círculo, elipse, polígono o curva Bézier cerrada) que se cree como un grupo, creando así dentro del dibujo *una nueva capa, ubicada delante de los otros trazos del dibujo*, evitando de esa manera intersectarse con ellos y facilitando su relleno (ver :ref:`Agrupar y desagrupar trazos vectoriales <grouping_and_ungrouping_vectors>` ). Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Auto Fill** automatically paints the area defined by any drawn closed shape (i.e. rectangles, circles, ellipses, polygons and closed polylines) with the same style used for drawing. This is available for Toonz Vector drawings only.
es: **Rellenar automáticamente** permite rellenar automáticamente las figuras cerradas creadas (rectángulos, círculos, elipses o curvas Bézier cerradas) usando el mismo estilo de la paleta usado para dibujar las líneas. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Snap** allows for the snapping of the cursor to other already drawn strokes of the same level, while drawing the shape. It has three levels of sensitivity: **Low**, **Med** and **High**. This is available for Toonz Vector drawings only.
es: **Adherencia** permite adherir el cursor a otros trazos ya dibujados en el mismo nivel, mientras se dibuja la figura. Tiene tres niveles de sensibilidad: **Baja**, **Media** y **Alta**. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Selective** allows the drawing operations not to affect already drawn lines. This is available for Toonz Raster drawings only.
es: **Selectivo** permite que las operaciones de dibujo no afecten a líneas ya pintadas del dibujo. Se encuentra disponible sólo para niveles de Imagen de Toonz.

source: **Pencil** mode draws geometric shapes without antialiasing, that is with jagged edges. This is available for Toonz Raster drawings only.
es: **Lápiz** permite el dibujo de figuras geométricas sin suavizado de bordes, produciendo bordes dentados. Se encuentra disponible sólo para niveles de Imagen de Toonz.

source: **Cap** option sets the shape of the ends of open shapes you are going to draw. Options are **Butt** for squared ends, **Round** for semicircular ends, and **Projecting** for squared ends extending beyond the end of the line, according to the vector thickness. This is available for Toonz Vector drawings only.
es: **Extremos** permite definir la forma de los extremos de las figuras abiertas a dibujar. Las opciones disponibles son: **Rectos** crea extremos rectos, **Redondeados** crea extremos semicirculares, y **Proyectantes** crea extremos rectos que se extienden más allá del final del trazo, de acuerdo al grosor del mismo. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Join** option sets the shape of the straight corners along the shapes you are going to draw. Options are **Miter** for pointed corners, **Round** for rounded corners, **Bevel** for squared corner. This is available for Toonz Vector drawings only.
es: **Esquinas** permite definir la forma de las esquinas pronunciadas a lo largo de las figuras a dibujar. Las opciones disponibles son: **En inglete** crea esquinas en punta, **Redondeadas** crea esquinas redondeadas, **Biseladas** crea esquinas con un bisel recto. Se encuentra disponible sólo para niveles Vectorial de Toonz.

source: **Miter:** sets the maximum length of a miter join, that is computed multiplying the miter value by the stroke thickness. If the length exceeds the maximum value, the *Miter* join is turned into a *Bevel* join. This is available for Toonz Vector levels only, and only if the **Join** option is set to **Miter**.
es: **Inglete:** permite definir la *longitud máxima* de las esquinas en inglete, que se calcula multiplicando este valor por el grosor del trazo. Si la longitud excede el valor máximo, la esquina *En inglete* se transformará en una esquina *Biselada*. Se encuentra disponible sólo para niveles Vectorial de Toonz, y sólo cuando la opción **Esquinas** está en **En inglete**.

source: While **Rectangles** and **Ellipses** are defined by a (bounding) box, **Circles** and **Polygons** are defined by a center and radius; **Polylines** can be used to create open or closed shapes by defining a series of lines; **Arcs** let you set the end points of a curve, and then the bend.
es: Mientras que los **Rectángulos** y **Elipses** son definidos por un marco (delimitador), los **Círculos** y **Polígonos** son definidos por un centro y un radio; las **Curvas Bézier** pueden ser usadas para crear figuras abiertas o cerradas mediante la definición de una serie de segmentos de curva; los **Arcos** permiten definir primero los extremos de una curva y luego la curvatura de la misma.

source: **To draw a rectangle or an ellipse:**
es: **Para dibujar un rectángulo o una elipse:**

source: Click to define the upper left corner, drag, and release to define the bottom right corner. If you press the **Shift** key while dragging, the shape will be regular, i.e. a square or a circle; if you press the **Alt** key, shapes will be drawn starting from their center. It's possible to press both keys at the same time.
es: Hacer clic para definir su primera esquina, arrastrar, soltar para definir la esquina opuesta. Si se presiona **Mayúsculas** mientras se arrastra, la figura será regular (un cuadrado o un círculo); si se presiona la tecla **Alt** el primer punto donde se hizo clic será el centro de la figura, en vez de una de sus esquinas. Es posible presionar ambas teclas al mismo tiempo.

source: **To draw a circle:**
es: **Para dibujar un círculo:**

source: Click to define the center, drag and release to define the radius.
es: Hacer clic para definir el centro, arrastrar para definir el radio y soltar.

source: **To draw a polygon:**
es: **Para dibujar un polígono:**

source: Set the number of sides in the **Polygon Sides:** field.
es: Definir la cantidad de lados con la opción **Lados:**

source: Click to define the center, drag and release to define the radius of a circle bounding the polygon.
es: Hacer clic para definir el centro, arrastrar para definir el radio del círculo delimitador del polígono y soltar.

source: **To draw a polyline:**
es: **Para dibujar una curva Bézier:**

source: **Click** to define the first point as a corner point.
es: Hacer **clic** para definir el primer punto como lineal.

source: **Click and drag** to define the first point as a control point; while dragging you can set the control point handles.
es: Hacer **clic y arrastrar** para definir el primer punto como un punto de control Bézier; al arrastrar se definen las tangentes del punto de control.

source: **Click** to define the end point of the line as a corner point. If you press the **Shift** key, you will draw a vertical, horizontal or 45° line.
es: Hacer **clic** para definir otro punto de la curva como un punto lineal. Si se presiona la tecla **Mayúsculas** se podrán dibujar líneas horizontales, verticales o a 45°.

source: **Click and drag** to define the end point of the line as a control point; while dragging you can set the control point handles.
es: Hacer **clic y arrastrar** para definir otro punto de la curva como un punto de control Bézier; al arrastrar se definen las tangentes del punto de control.

source: **Click** or **click and drag** again to define the end point of another line connected to the end point of the previous line.
es: Hacer **clic** o **clic y arrastrar** nuevamente para definir otros segmentos la curva.

source: **Double click** to define the last point of an open shape.
es: Hacer **doble clic** para definir el último punto de una curva abierta.

source: **Click** or **click and drag** again on the first point you defined to draw a closed shape.
es: Hacer **clic** o **clic y arrastrar** nuevamente sobre el primer punto para cerrar la figura.

source: Press the **Ctrl** key to add a linear point after a Nonlinear one.
es: Presionar la tecla **Ctrl** para agregar un punto lineal, luego de uno curvo.

source: Press the **ESC** key to cancel the creation of the polyline.
es: Presional la tecla **Esc** para cancelar la creación de una curva.

source: **To draw an arc:**
es: **Para dibujar un arco:**

source: Click to define the first end point.
es: Hacer clic para definir el primer extremo del arco.

source: Click to define the second endpoint.
es: Hacer clic para definir el otro extremo del arco.

source: Drag to set the bend, and click to draw the arc.
es: Arrastrar para definir una curvatura y hacer clic para dibujar el arco.

source: Adding Text
es: Incorporación de Textos

source: Text can be added by using the **Type** tool (|type|).
es: Es posible agregar textos a un nivel usando la herramienta **Texto** (|type|).

source: It is also possible to work with editable and animatable text in OpenToonz through the use of the **Text Iwa** effect. For more information, please see :ref:`Text Iwa <text_iwa>` .
es: También es posible trabajar con texto editable y animable en OpenToonz, usando el efecto **Text Iwa**. Para más información, por favor ver :ref:`Text Iwa <text_iwa>` .

source: **Font:** to be used, taken from a list based on the Operating System default fonts folder.
es: **Tipografía:** a ser usada, elegida de la lista de tipografías instaladas en el Sistema Operativo.

source: **Style:**, for the chosen font.
es: **Estilo:** de la tipografía elegida.

source: **Size:**, for the chosen font.
es: **Tamaño:** de la tipografía elegida.

source: Already written text can be resized by using the **Selection** tool (|selection|) (see :ref:`Editing Drawings <editing_drawings>` ).
es: El texto puede ser redimensionado usando la herramienta **Seleccionar** (|selection|) (ver :ref:`Edición de dibujos <editing_drawings>` ).

source: **Vertical Orientation**, lets you place the text vertically, one letter under another, instead of horizontally.
es: **Orientación vertical**, permite escribir el texto de forma vertical, una letra bajo la otra.

source: The *current* palette Style is applied to the text you type. The palette style can be changed while typing text, thus you can have characters with different styles in the same text editing session (see :ref:`Editing Styles <editing_styles>` ).
es: El texto es escrito usando el Estilo *actual* de la paleta. El estilo de la paleta puede ser cambiado mientras se escribe el texto, obteniendo caracteres con distintos estilos en la misma sesión de edición de texto (ver :ref:`Edición de estilos <editing_styles>` ).

source: For vector levels, as soon as the text is committed, it's converted into vector outlines, and can no longer be edited as text.
es: En niveles vectoriales, tan pronto como se finaliza el ingreso del texto, el mismo es convertido a contornos vectoriales, que ya no podrán ser editados como texto.

source: **To add text:**
es: **Para agregar texto:**

source: Select the **Type** tool (|type|) and click in the viewer where you want to start writing.
es: Seleccionar la herramienta **Texto** (|type|) y hacer clic en el visor donde se desee comenzar a escribir.

source: Choose options **Font**, **Style**, **Size** and **Vertical Orientation**. These options can be changed as long as you are in text editing mode.
es: Elegir las opciones deseadas **Tipografía**, **Estilo**, **Tamaño** y **Orientación vertical**. Estas opciones podrán ser modificadas mientras se esté dentro del modo de edición de texto.

source: Change the current color Style in the palette, if you want to use more than one style in the same text editing session.
es: Cambiar el Estilo de color seleccionado en la paleta, si se desea usar más de un estilo en la misma sesión de edición de texto.

source: Click inside the text editing area to change the text insertion point.
es: Hacer clic dentro del área de edición de texto para cambiar el punto de inserción de texto.

source: Click outside the text editing area, or select a different tool, to commit the text.
es: Hacer clic fuera del área de edición de texto o seleccionar una herramienta diferente para finalizar la edición del texto.

source: Using the Eraser
es: Uso del Borrador

source: The **Eraser** tool (|eraser|) allows you to partially erase lines, both in vector and raster drawings.
es: La herramienta **Borrador** (|eraser|) permite borrar parcialmente líneas, tanto en dibujos vectoriales como de imagen.

source: **Size** sets the eraser size.
es: **Tamaño** permite definir el tamaño del borrador.

source: **Hardness** sets the amount of antialiasing along the eraser border. This is available for Toonz Raster and Raster drawings only.
es: **Dureza** permite controlar el grado de suavizado del borde el borrador. Se encuentra disponible sólo para niveles de Imagen de Toonz e Imagen.

source: **Opacity** set the opacity of the eraser; passing twice on an area is not considered while performing a single erasing operation, but only when performing different erasing operations. This is available for Raster drawings only.
es: **Opacidad** permite definir la opacidad del borrador; pasar dos veces sobre la misma área no se toma en cuenta al calcular el efecto de la opacidad en un mismo trazo de borrado, sino sólo al realizar diferentes operaciones de borrado. Se encuentra disponible sólo para niveles de Imagen.

source: **Type:** has the options **Normal**, to use the standard eraser; **Rectangular**, to perform the erasing inside the box you define; **Freehand**, to perform the erasing inside the area you outline by clicking and dragging; and **Polyline**, to perform the erasing inside the area you outline by defining a series of lines. In vector drawings, a stroke is erased only if it is fully included in the area you define.
es: **Tipo:** contiene las opciones **Normal**, para usar el modo estándar del borrador; **Rectangular**, para realizar el borrado dentro del rectángulo definido; **Lazo**, para realizar el borrado dentro del área definida a mano alzada; y **Línea poligonal**, para realizar el borrado dentro del área definida por una serie de segmentos de recta. En niveles vectoriales, los distintos trazos serán borrados sólo si quedan completamente incluidos en el área definida.

source: **Mode:** has the options **Areas**, to erase only areas, **Lines**, to erase only the drawing outline, and **Lines & Areas**, to perform both the operations. This is available only for Toonz Raster drawings.
es: **Modo:** contiene las opciones **Áreas**, para borrar sólo áreas de relleno, **Líneas**, para borrar sólo los trazos de un dibujo, y **Líneas y áreas**, para realizar ambas operaciones a la vez. Se encuentra disponible sólo para niveles de Imagen de Toonz.

source: **Selective** allows you to erase only lines or areas made with the current style. This is available only for Toonz Vector and Toonz Raster drawings.
es: **Selectivo** permite borrar sólo líneas o áreas hechos con el Estilo actual. Se encuentra disponible sólo para niveles Vectorial de Toonz e Imagen de Toonz.

source: **Invert** performs the erasing on the outside of the area defined with the Rectangular, Freehand or Polyline options. In vector drawings, a stroke is erased only if it is fully outside of the area you define.
es: **Invertir** permite realizar la operación de borrado en el exterior del área definida al usar las opciones **Rectangular**, **Lazo** o **Línea poligonal**. En dibujos vectoriales, un trazo será borrado sólo si se encuentra completamente por fuera del área definida.

source: **Frame Range** allows you to perform Rectangular, Freehand and Polyline erasing on a range of frames, by defining an area in the first and then in the last frame of the range.
es: **Rango de fotogramas** permite realizar la operación de borrado de tipo **Rectangular**, **Lazo** o **Línea poligonal** en un rango de fotogramas, definiendo un área en el primer y el último fotograma de dicho rango.

source: **Pencil** mode erases lines without antialiasing, that is with jagged edges. This is available for Toonz Raster drawings only.
es: **Lápiz** permite borrar usando trazos sin suavizado de bordes, produciendo bordes dentados. Se encuentra disponible sólo en niveles Imagen de Toonz.

source: The **Eraser** tool (|eraser|) can be automatically selected by *using the eraser of the tablet pen*.
es: La herramienta **Borrador** (|eraser|) puede ser automáticamente seleccionada *usando el borrador de la pluma de una tableta*.

source: Converting Raster Drawings to Vectors
es: Conversión de dibujos de imagen en vectoriales

source: Scanned drawings and raster ones, i.e. drawings not based on vectors, can be converted into Toonz Vector levels.
es: Es posible convertir dibujos escaneados o cargados (aquellos no basados en vectores) en niveles de tipo Vectorial de Toonz.

source: Two main conversion modes are available: **Centerline** and **Outline**. The choice between the two modes depends on which conversion best fits your needs.
es: Existen dos modos de conversión disponibles: **Líneas** y **Contornos**. La elección entre ambos modos dependerá de cuál método sea más adecuado a las necesidades del caso.

source: In **Centerline** mode a *single vector stroke with a variable thickness* is generated for each line in the drawing. This means that the converted drawing can be edited like vector-based drawings made directly in OpenToonz, for example you can change the bend of a stroke with the **Pinch** (|pinch|) or **Control Point Editor** tools, and the thickness with the **Pump** tool (|pump|).
es: En el modo **Líneas** se generará *un trazo vectorial de grosor variable* para cada línea del dibujo. Esto significa que será posible editar el dibujo convertido, tal como los dibujos creados directamente en OpenToonz, por ejemplo se podrá cambiar la curvatura de un trazo usando las herramientas **Pellizcar** (|pinch|) o **Editar puntos de control**, o el grosor con la herramienta **Inflar** (|pump|).
