Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: es

source: Drawing Animation Levels
es: Dibujo de niveles de animación

source: In OpenToonz it is possible to create and draw **Toonz Vector** levels (PLI format), **Toonz Raster** levels (TLV format) and standard **Raster** levels (TIF format) directly in the viewer. Drawing tools can also be used for touch-up in cleaned up drawings, and loaded raster images.
es: En OpenToonz es posible crear, dibujando directamente en el Visor, tres tipos de nivel: **Vectorial de Toonz** (formato PLI), **Imagen de Toonz** (formato TLV) e **Imagen** estándar (formato TIF). Las herramientas de dibujo también pueden ser usadas para retoques en dibujos escaneados y limpiados, así como en imágenes cargadas.

source: Drawing In OpenToonz
es: Dibujo en OpenToonz

source: To draw an animation level, first you have to define its type: Toonz Vector, Toonz Raster or Raster; and its settings like its name, the number of frames it's made of and the way its drawings are numbered.
es: Para dibujar un nivel de animación, primero se debería definir de qué tipo será: Vectorial de Toonz, Imagen de Toonz o Imagen, así como sus propiedades como nombre, cantidad de fotogramas que lo componen y la forma en que sus dibujos serán numerados.

source: Toonz Vector levels are defined by drawing of vector strokes; strokes and areas defined by strokes can be painted by using the styles available in the level palette. Toonz Vector levels have an unlimited size and resolution, as they are vector-based. They are saved as PLI files.
es: Los niveles Vectoriales de Toonz se definen dibujando trazos vectoriales; los trazos y las áreas definidas por éstos, pueden ser pintados usando los estilos disponibles en la paleta del nivel. Los niveles Vectoriales de Toonz pueden tener un tamaño y resolución ilimitados, ya que están basados en vectores. Son almacenados como archivos PLI.

source: Toonz Raster levels are defined by drawing bitmap lines; lines and areas defined by lines can be painted by using the styles available in the level palette. Toonz Raster levels have a specified size and resolution, defined when they are created. They are saved as TLV files.
es: Los niveles de Imagen de Toonz se definen dibujando líneas en una imagen de mapa de bits; las líneas y las áreas definidas por éstas pueden ser pintadas usando los estilos disponibles en la paleta del nivel. Los niveles de Imagen de Toonz tienen un tamaño y resolución específicos, definido en el momento de su creación. Son almacenados como archivos TLV.

source: Raster levels are defined by drawing bitmap lines using the styles available in the **Raster Drawing Palette**, that is shared by all of the Raster levels of the same project (see :ref:`Project Default Folders <project_default_folders>` ). Raster levels have a specified size and resolution, defined when they are created. They are saved as sequences of individual TIF files, one per level frame.
es: Los niveles de Imagen se definen dibujando líneas en una imagen de mapa de bits, usando los estilos disponibles en la paleta **Raster Drawing Palette**, que es compartida por todos los niveles de Imagen del mismo proyecto (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ). Los niveles de Imagen de Toonz tienen un tamaño y resolución específicos, definido en el momento de su creación. Son almacenados como secuencias de imágenes TIF, una por cada fotograma del nivel.

source: When an animation level is defined, you can select any of its frames in the Xsheet/Timeline or in the Level Strip, and start drawing in the viewer. You can do this both, when you want to create a drawing from scratch, and when you want to edit a previously made drawing.
es: Una vez que un nivel de animación es definido, es posible seleccionar cualquiera de sus fotogramas en la Planilla/Línea de tiempo o en la Cinta de nivel y comenzar a dibujar en el Visor. Es posible hacer esto tanto cuando se desea crear un dibujo desde cero, como cuando se desea editar uno ya existente.

source: When selected in the Xsheet/Timeline, the viewer displays the whole scene content at the current frame; when selected in the Level Strip, the viewer displays the selected frame of the current animation level only, to let you work more easily on it.
es: Cuando es seleccionado en la Planilla/Línea de tiempo, el Visor muestra el contenido completo de la escena en el fotograma actual; cuando se selecciona en la Cinta de nivel, el Visor muestra únicamente el fotograma actual del nivel seleccionado, para permitir trabajar en él de una manera más simple.

source: Setting the Default Type of Level to Draw
es: Configurar el tipo de nivel predefinido a dibujar

source: It's possible to define the default level type that will be created when you draw inside OpenToonz.
es: Es posible establecer el tipo de nivel predefinido que será creado cuando se dibuje en OpenToonz en un fotograma donde no exista previamente uno.

source: By default Toonz Vector and Toonz Raster levels are saved in the **+drawing** folder of the current project when the scene is saved, while Raster levels are saved in the **+extras** folder (see :ref:`Project Default Folders <project_default_folders>` ).
es: De forma predefinida los niveles Vectorial de Toonz e Imagen de Toonz son almacenados en la carpeta **+drawing** del proyecto activo, cuando la escena es guardada, mientras que los niveles de Imagen son guardados en la carpeta **+extras** (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).

source: **To define the Default Type of Level to Draw:**
es: **Para definir el Tipo Predefinido de nivel a dibujar:**

source: Open File → Preferences... → Drawing.
es: Abrir Archivo → Preferencias... → Dibujo.

source: Choose the level type you want to use as default from the **Default Level Type:** option menu. **Width**, **Height** and **DPI** fields are available for **Toonz Raster Level** and **Raster Level** options.
es: Elegir el tipo de nivel deseado en el menú de la opción **Tipo de nivel predefinido**. Los campos **Ancho**, **Altura** y **PPP** están únicamente disponibles cuando se eligen las opciones **Nivel de imagen de Toonz** o **Nivel de imagen**.

source: The Width, Height and DPI values set in the File → Preferences... → Drawing section will also be used as default for the **New Level** dialog.
es: Los valores Ancho, Altura y PPP de la sección Archivo → Preferencias... → Dibujo también serán usados como valores predefinidos para el diálogo **Nuevo nivel**.

source: Animation levels can be created in the following ways:
es: Es posible crear niveles de animación de las siguientes formas:

source: Using the **New Level** dialog.
es: Usando el diálogo **Nuevo nivel**.

source: Setting the Autocreation option to **Enabled**.
es: Eligiendo **Habilitada** en la opción **Creación automática**.

source: Setting the Autocreation option to **Use Xsheet as Animation Sheet**.
es: Eligiendo **Usar la planilla como planilla de animación** en la opción **Creación automática**.

source: Using the New Level Dialog
es: Uso del diálogo Nuevo nivel

source: New animation levels can be defined by using a dialog that lets you set the number of drawings the level is made of, the animation step used to expose the frames in the Xsheet/Timeline, and the increment, that sets the way the level drawings are numbered. For example, a **Step** 2 repeats each drawing twice in the Xsheet column or Timeline layer, while an **Increment** 2 will number its drawings as 1, 3, 5, etc. The dialog also allows you to choose a destination folder, different from the default one, by using the **Save In** field.
es: Los nuevos niveles de animación pueden ser creados usando un diálogo que permite establecer la cantidad de dibujos que lo componen, la cadencia de su exposición en la Planilla/Línea de tiempo y el incremento, que define cómo se numeran sus dibujos. Por ejemplo, una **Exposición** de 2 repetirá cada dibujo dos veces en las columnas de la Planilla (o las capas de la Línea de tiempo), mientras que un **Incremento** de 2 numerará a sus dibujos 1, 3, 5, etc. El diálogo también permite elegir una carpeta de destino del archivo, distinta de la predefinida, usando el campo **Guardar en**.

source: In case you define a Toonz Raster or a Raster level, you can set its **Width**, **Height** and **DPI** values, according to the way you want to use it in the scene.
es: En caso de crear un nivel de Imagen de Toonz o de Imagen, es posible definir sus valores de **Ancho**, **Altura** y **PPP**, de acuerdo a la forma en que se desee usar en la escena.

source: Settings like the length of the level and the numbering order can be edited later, as you are free to arrange the images composing an animation level the way you prefer (see :ref:`Editing Animation Levels <editing_animation_levels>` ).
es: Parámetros como la longitud del nivel o el orden de su numeración pueden ser editados con posterioridad, ya que existe total libertad de acomodar las imágenes que componen un nivel de animación como sea necesario (ver :ref:`Edición de niveles de animación <editing_animation_levels>` ).

source: When a new level is created in an empty column, the color of that column header and the cells where the new level gets exposed are colored denoting the type of level: **light yellow** for Toonz Vector levels, **light green** for Toonz Raster levels, and **light blue** for Raster levels (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>` ).
es: Cuando se crea un nivel en una columna/capa vacía, el color del encabezado de la misma y de las celdas donde el nuevo nivel quede expuesto, serán coloreados según el tipo de nivel del que se trate: **amarillo claro** para niveles Vectoriales de Toonz, **verde claro** para niveles de Imagen de Toonz y **celeste** para niveles de Imagen (ver :ref:`Trabajo con columnas de la planilla <working_with_xsheet_columns>` ).

source: The New Level dialog inherits the **Default Level Type** settings defined in Preferences... → Drawing.
es: El diálogo de Nuevo nivel hereda las opciones de **Tipo de nivel predefinido** definidas en Preferencias... → Dibujo.

source: **To create a new animation level to draw:**
es: **Para crear un nivel de animación:**

source: Do one of the following:
es: Hacer una de las siguientes cosas:

source: Select a cell in the Xsheet/Timeline where you want to place your animation level and choose Level → New → **New Level...**
es: Seleccionar una celda en la Planilla/Línea de tiempo donde se desee ubicar el nivel de animación y elegir Nivel → Nuevo → **Nuevo nivel...**

source: Right-click the cell in the Xsheet/Timeline where you want to place your animation level and choose **New Level...** from the menu that opens.
es: Hacer clic derecho en una celda en la Planilla/Línea de tiempo donde se desee ubicar el nivel de animación y elegir **Nuevo nivel...** en el menú.

source: (If the Xsheet/Timeline toolbar is visible) Click any of the three **New Level buttons** at the leftmost part of it.
es: (Si la barra de herramientas de la Planilla/Línea de tiempo se encontrara visible) Hacer clic en uno de los **botones de Nuevo nivel** en su extremo izquierdo.

source: Choose the type of level: Toonz Vector, Toonz Raster or Raster, from the **Type:** option menu and define its settings, then click the OK button.
es: Elegir el tipo de nivel: Vectorial de Toonz, Imagen de Toonz o Imagen, desde el menú de la opción **Tipo:** y definir sus propiedades, luego hacer clic en el botón Aceptar.

source: When using the Xsheet/Timeline's toolbar buttons to create a new level, the corresponding level type is already preselected in the dialog's dropdown menu.
es: Al crear un nivel usando los botones de la barra de herramientas de la Planilla/Línea de tiempo, el tipo de nivel correspondiente al botón usado ya estará preseleccionado en la opción **Tipo:**.

source: If a level is already exposed in the cell column, the new level will be created in an empty column.
es: Si ya hubiera un nivel expuesto en la celda de la columna, el nuevo nivel se creará en una columna vacía.

source: **To define the saving location for the level you want to draw:**
es: **Para definir la ubicación de guardado de un nuevo nivel:**

source: In the **New Level** dialog type in the **Save In:** field, or use the **Browser button**, to set the path for the saving location.
es: En el diálogo **Nuevo nivel** ingresarla en el campo **Guardar en:** o usar el **botón Explorar** para definir la ruta de la ubicación de guardado.

source: If in the browser you choose any project folder, in the path field the full path will be replaced by the correspondent *folder alias* (see :ref:`Project Default Folders <project_default_folders>` ).
es: Si en el Explorador se elige alguna carpeta del proyecto, en el campo **Guardar en:** su ruta completa se reemplazará por la referencia correspondiente a esa carpeta del proyecto (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).

source: Using the Autocreation Option
es: Uso de la opción Creación automática

source: When in Preferences → Drawing the **Autocreation:** option is set to **Enabled**, it is possible to create new drawings automatically by using drawing tools in the viewer. If the currently selected cell is empty, a new level will be automatically created and named with the first available letter of the alphabet; if the currently selected cell is the one **right after** one containing a level drawing (either in the Xsheet/Timeline or the Level Strip) a new drawing will be added to that level.
es: Cuando la opción Preferencias → Dibujo → **Creación automática** se encuentre **Habilitada**, será posible crear automáticamente nuevos dibujos al usar las herramientas de dibujo en el Visor. Si la celda seleccionada se encontrara vacía, se creará un nuevo nivel y se nombrará usando la primera letra disponible del alfabeto; si la celda seleccionada fuera la primera **a continuación** de otra que contenga un dibujo de un nivel (tanto en la Planilla/Línea de tiempo como en la Cinta de nivel) se agregará un nuevo dibujo a dicho nivel.

source: The level type will be the one defined in Preferences... → Drawing as **Default Level Type**.
es: El tipo de nivel será el indicado en Preferencias... → Dibujo como **Tipo de nivel predefinido**.

source: Using the Xsheet as Animation Sheet
es: Uso de la Planilla/Línea de tiempo como planilla de animación

source: When in Preferences... → Drawing the **Autocreation:** option is set to **Use the Xsheet as Animation Sheet**, it's possible to create new drawings automatically by using drawing tools in the viewer. If the currently selected cell is empty and belongs to an empty column, a new level will be automatically created and named with the first available letter of the alphabet; if the currently selected cell is **anywhere after** one containing a level drawing, a new drawing will be added to that level. In both cases the drawings will take its number from the scene current frame ; if that drawing number already existed in the level, a letter will be added to its number (e.g. A.0001a.ext).
es: Cuando en Preferencias... → Dibujo la opción **Creación automática** está en **Usar la Planilla como planilla de animación**, será posible crear nuevos dibujos automáticamente usando las herramientas de dibujo en el Visor. Si la celda seleccionada se encontrara vacía y perteneciera a una columna/capa vacía, se creará automáticamente un nuevo nivel, al cual se le asignará como nombre la primera letra disponible del alfabeto; si la celda seleccionada se encontrara *en cualquier posición posterior* a una celda que exponga un dibujo de un nivel, el nuevo dibujo a ser creado se agregará a dicho nivel. En ambos casos el nuevo dibujo tomará su número del fotograma actual de la escena; si ese número ya estuviera en uso en ese nivel, se anexará una letra a la derecha del número (p.ej: A.00001a).

source: This working method allows you to work as a traditional animator: you can start creating the *key drawings*, and then add *breakdown drawings*, and then *inbetween drawings*. You can quickly check your animation flipping it in the viewer.
es: Este método permite trabajar como un animador tradicional: es posible comenzar creando los *dibujos clave*, luego agregar los *intermedios principales* y finalmente el resto de *intermedios*. Es posible comprobar la animación rápidamente usando las funciones del Visor.

source: When you add a new drawing it will be repeated as a *hold* along the column/layer up to the following one.
es: Al agregar un nuevo dibujo éste será repetido en la columna/capa hasta el siguiente dibujo existente y, en caso de existir celdas vacías entre el dibujo anterior y el nuevo, el dibujo anterior también será repetido hasta el nuevo. Esto último no sucederá en caso de que en Preferencias > Dibujo la opción **Exposición automática del dibujo anterior** se encontrara desactivada.

source: It's also possible to create a new drawing in a cell that contains a *hold*: the new drawing will replace the hold up to the following drawing. Drawings can also be duplicated creating a copy with a different number.
es: También es posible crear un nuevo dibujo en una celda que contenga una *repetición de mantenimiento* de un dibujo; el nuevo dibujo reemplazará a esa y todas las repeticiones siguientes hasta el siguiente dibujo.

source: Once the animation is completed you can renumber the whole sequence according to the Xsheet/Timeline frame numbering.
es: Una vez que la animación se ha completado, es posible renumerar toda la secuencia de acuerdo a la numeración de los fotogramas de la Planilla/Línea de tiempo.

source: **To create a new animation level**
es: **Para crear un nuevo nivel de animación:**

source: Click an empty cell in the Xsheet/Timeline and start drawing using a drawing tool in the viewer.
es: Hacer clic en una celda vacía de la Planilla/Línea de tiempo y comenzar a dibujar en el Visor, usando alguna herramienta de dibujo.

source: **To add a drawing to an existing level**
es: **Para agregar un dibujo en un nivel ya existente:**

source: Click an empty cell in the column/layer containing the existing level and start drawing using a drawing tool in the viewer.
es: Hacer clic en una celda de una columna/capa que ya contenga un nivel y comenzar a dibujar en el Visor, usando alguna herramienta de dibujo.

source: **To automatically renumber the drawings**
es: **Para renumerar automáticamente los dibujos:**

source: Select the cells with the drawings you want to renumber.
es: Seleccionar las celdas que contengan los dibujos que se desee renumerar.

source: Choose the Cells → **Autorenumber** command.
es: Elegir el comando Celdas → **Renumeración automática**.

source: The **Autorenumber** command is also available in the menu that opens when right-clicking in a cell.
es: El comando **Renumeración automática** también se encuentra disponible en el menú contextual al hacer clic derecho sobre una celda.

source: Using the Viewer
es: Uso del Visor

source: In the viewer, it's possible to use the tools available in the toolbar to draw, paint, edit and model drawings. The work area of the viewer is endless and you can scroll, zoom in, zoom out and rotate it.
es: En el Visor es posible usar las herramientas disponibles en la barra de herramientas para dibujar, pintar, editar y modificar los dibujos. El área de trabajo del Visor es infinita y es posible desplazarla, acercarla o alejarla y rotarla.

source: In the title bar you can find information about what is currently displayed and selected, the zoom percentage, and a set of buttons that lets you set the view mode (see :ref:`Using the Viewer <using_the_viewer>` ).
es: En la barra de título es posible encontrar información acerca de los que se está mostrando y lo que está seleccionado, el porcentaje de zoom y un conjunto de botones que permiten cambiar el modo de visualización (ver :ref:`Uso del Visor <using_the_viewer>` ).

source: At the bottom of the viewer another customizable set of buttons is available.
es: En la parte inferior del Visor hay otro conjunto de botones personalizables disponible.

source: The frame bar and the playback buttons let you set the current frame and move through animation frames. The set frame rate is visualized, and, in case the playback is activated, the actual frame rate is displayed on its left.
es: La barra de fotogramas permite establecer el fotograma actual y los botones de reproducción permiten moverse entre los fotogramas de la animación. El fotograma actual es visualizado y, en caso de que la reproducción esté activada, la velocidad de fotogramas real es mostrada a la derecha en el parámetro **FPS**.

source: The other buttons are relevant only using the Animate tool (|animate|) to animate objects and when previewing the animation in the viewer (see :ref:`Animating Objects <animating_objects>` and :ref:`Previewing the Animation <previewing_the_animation>` ).
es: Los otros botones son relevantes sólo al usar la herramienta **Animar** (|animate|) para animar objetos y al previsualizar la animación en el visor (ver :ref:`Animación de objetos <animating_objects>` y :ref:`Previsualización de la animación <previewing_the_animation>` ).

source: If the bottom bar is too short to display all the options, it can be scrolled by using arrow buttons available at its ends.
es: Si la barra inferior fuera muy corta para mostrar todas las opciones, ésta puede ser desplazada usando los botones con flechas en sus extremos.

source: In case a frame range is defined by playback markers, the playback buttons operate on the defined range only (see :ref:`Using the Playback Markers <using_the_playback_markers>` ).
es: En caso de que haya definido un rango de fotogramas de reproducción, los botones de reproducción operarán dentro del rango definido (ver :ref:`Uso de marcadores de reproducción <using_the_playback_markers>` ).

source: **To navigate the work area:**
es: **Para navegar el área de trabajo:**

source: Use the **Zoom** tool (|zoom|): to zoom in, click and drag up; to zoom out, click and drag down. The point where you click is the center of the zooming action.
es: Usar la herramienta **Zoom** (|zoom|): para acercar, arrastrar hacia arriba; para alejar, hacia abajo. El punto donde se hace clic será el centro de la acción del zoom.

source: Use the zoom shortcut keys (by default + and - keys) to zoom in and zoom out at specific steps (e.g. 50%, 100%, 200%, etc.).
es: Es posible usar los atajos de zoom (de forma predefinida **+** y **-**) para acercar o alejar de a saltos específicos (p.ej: 50%, 100%, 200%, etc.).

source: Use the mouse wheel to zoom in and zoom out.
es: Usar la rueda del ratón para acercar o alejar.

source: Middle-click and drag or use the **Hand** tool (|hand|) to scroll in any direction.
es: Arrastrar con el botón central para usar la herramienta **Desplazar** (|hand|) para desplazar en cualquier dirección.

source: Use the **Rotate** tool (|rotate|) to rotate the viewer: an *horizon line* is displayed to let you understand the amount of rotation; the center of rotation is the absolute center of the work area.
es: Usar la herramienta **Rotar** (|rotate|) para rotar el visor: se mostrará una *línea de horizonte* para ayudar a entender el grado de rotación; el centro de rotación es el centro absoluto del área de trabajo.
