Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: es

source: Change the length of the segment affected by the tool by doing one of the following:
es: Cambiar la longitud del segmento a ser afectado por la herramienta, haciendo una de las siguientes cosas:

source: Set the **Size** value in the tool options bar.
es: Definir el valor para el **Tamaño** en la barra de opciones de herramientas.

source: Click and drag the small square at one end of the handle displayed along the highlighted stroke.
es: Hacer clic y arrastrar lateralmente sobre el cuadrado del manipulador interactivo.

source: Click, Shift-click, or Ctrl-click (PC) or Cmd-click (Mac) and drag to modify the bend of the highlighted segment.
es: Hacer clic, Mayúsculas-clic, o Ctrl-clic (PC) o Cmd-clic (Mac) y arrastrar para modificar la curvatura del segmento resaltado.

source: **To eliminate a corner point from a segment:**
es: **Para borrar un punto en esquina de un segmento:**

source: Click and drag the point until the smooth segment is formed again.
es: Hacer clic y arrastrar el punto hasta que se forme nuevamente un segmento suave.

source: Click and drag to correct the bend of the newly smoothed segment.
es: Hacer clic y arrastrar para corregir la curvatura del nuevo segmento suave.

source: Using Other Modifier Tools
es: Uso de otras herramientas de modificación

source: To modify the thickness of a stroke you can use the **Pump** tool (|pump|). You can use it anywhere you want on the stroke to increase or decrease the thickness locally. When the tool is selected, a segment of the closest stroke is highlighted: the segment shows the length of the stroke that will be affected by the tool. To modify this length you can change the **Size** value in the tool options bar.
es: Para modificar el grosor de un trazo es posible usar la herramienta **Inflar** (|pump|). Es posible usarla en cualquier lugar del trazo donde se desee aumentar o disminuir el grosor localmente. Cuando la herramienta se encuentra seleccionada, un segmento del trazo más cercano queda resaltado: el segmento muestra la longitud del trazo que será afectado por la herramienta. Para modificar esta longitud es posible cambiar el valor del parámetro **Tamaño** en la barra de opciones de herramientas.

source: It's possible to modify the thickness of a stroke, a stroke selection, or strokes in all of the level drawings, by using the **Selection** tool (|selection|) and its related options (see :ref:`Using the Selection Tool <using_the_selection_tool>` ).
es: Es posible modificar el grosor de un trazo, una selección de trazos o los trazos en todos los dibujos del nivel, usando la herramienta **Seleccionar** (|selection|) y sus opciones (ver :ref:`Uso de la herramienta Seleccionar <using_the_selection_tool>` ).

source: To distort more than one stroke at once, you can use the **Magnet** tool (|magnet|). The tool affects all stroke included in a circular area and allows you to distort them in the direction of your dragging. Highlighted segments will show the strokes that will be affected. To modify the action range of the tool, represented by a circle, you can change the tool size in the tool options bar.
es: Para distorsionar más de un trazo de una vez, es posible usar la herramienta **Imantar** (|magnet|). La herramienta afecta a todos los trazos incluidos en un área circular y permite distorsionarlos en la dirección en que se arrastre. Los segmentos resaltados mostrarán los trazos que serán afectados. Para modificar el rango de acción de la herramienta, representado por un círculo, es posible cambiar el **Tamaño** de la herramienta en la barra de opciones de herramientas.

source: To bend a part of a drawing, for example a character’s arm, you can use the **Bender** tool (|bender|). The tool allows you to define a line and then bend all the strokes intersected by the segment. While bending you can see the affected strokes assuming their position after the transformation. The bending can be performed in both clockwise and counterclockwise direction; once you start dragging you cannot change the bend direction.
es: Para curvar una parte de un dibujo, por ejemplo el brazo de un personaje, es posible usar la herramienta **Doblar** (|bender|). La herramienta permite definir una línea y luego permite doblar, todos los trazos intersectados por la misma, una determinada magnitud. Mientras se está produciendo el doblez, es posible ver el resultado del mismo. El doblez puede ser realizado tanto en forma horaria como antihoraria; una vez que se comenzó a arrastrar ya no es posible cambiar la dirección del doblez.

source: If you move the cursor far from the bending center, you will be able to set with more precision the amount of bend you want to apply to the strokes.
es: Si se mueve el cursor lejos del centro en el que se basa el doblez, será posible controlarlo con una mayor precisión.

source: To smooth a stroke, you can use the **Iron** tool (|iron|). When used again and again on the same stroke, it increasingly flatten the bends of the stroke. When the tool is selected, the cursor snaps to the closest stroke to indicate where you are going to operate.
es: Para suavizar un trazo es posible usar la herramienta **Planchar** (|iron|). Al ser usada una y otra vez sobre el mismo trazo, tenderá a planar sucesivamente sus curvas. Cuando la herramienta se encuentra seleccionada, el cursor se adherirá al trazo más cercano para indicar dónde es que va a operar.

source: **To modify the thickness of a stroke:**
es: **Para modificar el grosor de un trazo:**

source: Select the **Pump** tool (|pump|).
es: Seleccionar la herramienta **Inflar** (|pump|).

source: Set the **Size:** value in the tool options bar.
es: Definir el valor de **Tamaño:** en la barra de opciones de herramientas.

source: Click the point of the stroke where you want to modify the thickness and drag up to increase it, or down to decrease it.
es: Hacer clic en el lugar del trazo en donde se desee modificar el grosor y arrastrar hacia arriba para aumentarlo o hacia abajo para disminuirlo.

source: Using the Pump tool to change the thickness of drawn strokes.
es: Uso de la herramienta Inflar para cambiar el grosor de los trazos ya dibujados.

source: **To distort several strokes at once:**
es: **Para distorsionar varios trazos al mismo tiempo:**

source: Select the **Magnet** tool (|magnet|).
es: Seleccionar la herramienta **Imantar** (|magnet|).

source: Click in the Viewer: all the strokes included in the circle will be affected by the tool.
es: Hacer clic en el Visor: todos los trazos incluidos en el círculo serán afectados por la herramienta.

source: Drag to distort the strokes in the direction of your dragging.
es: Arrastrar para distorsionar los trazos en esa dirección.

source: **To bend one or several strokes:**
es: **Para doblar uno o varios trazos:**

source: Select the **Bender** tool (|bender|).
es: Seleccionar la herramienta **Doblar** (|bender|).

source: Click on one side of the strokes you want to bend to set the center of the bend.
es: Hacer clic a un lado de los trazos que se desee doblar, para definir el centro de la curvatura a aplicar.

source: Click on the opposite side of the strokes: all strokes intersected by the defined line will be affected by the bending.
es: Hacer clic del lado opuesto de los trazos: todos los trazos intersectados por la línea definida por ambos puntos serán afectados por el doblez.

source: Drag in the direction you want to bend strokes.
es: Arrastrar en la dirección en que se desee curvar los trazos.

source: **To smooth a stroke:**
es: **Para suavizar un trazo:**

source: Select the **Iron** tool (|iron|).
es: Seleccionar la herramienta **Planchar** (|iron|).

source: Click and drag along the stroke you want to smooth. By dragging over and over the stroke will increasingly flatten.
es: Hacer clic y arrastrar a lo largo del trazo que se desee suavizar. Al arrastrar una y otra vez sobre el trazo, éste se aplanará progresivamente.

source: Joining and Splitting
es: Unión y división de trazos

source: To join the ends of two different vector strokes, you can use the **Tape** tool (|tape|). This way it will be possible to handle them as a single stroke, for instance for modifying their bend, or thickness, as a whole.
es: Para unir los extremos de dos trazos vectoriales diferentes, es posible usar la herramienta **Cinta** (|tape|). Con ella será posible manejarlos como un único trazo, por ejemplo para modificar su curvatura o su grosor como si fueran uno solo.

source: When the tool is used, the pointer snaps to the closest detected stroke endpoint in order to make the operation easier.
es: Al usar la herramienta, el puntero se adherirá al extremo más cercano detectado del trazo, para facilitar su operación.

source: The **Tape** tool (|tape|) can also be used to close gaps along the drawing outline for painting purposes (see :ref:`Closing Gaps in Drawing Outline <closing_gaps_in_drawing_outline>` ).
es: La herramienta **Cinta** (|tape|) también puede ser usada para cerrar huecos a lo largo del contorno de un dibujo que se desea pintar (ver :ref:`Cierre de huecos en contornos de dibujos <closing_gaps_in_drawing_outline>` ).

source: To do the contrary, that is to say splitting a stroke in two sections, you can use the **Cutter** tool (|cutter|).
es: Para dividir un trazo en dos secciones, es posible usar la herramienta **Cortar** (|cutter|).

source: **To join two open ends of one or two strokes:**
es: **Para unir los extremos abiertos de uno o dos trazos:**

source: Select the **Tape** tool (|tape|), and activate the **Join Vectors** option; activate also the **Smooth** option if you want a smooth joining with no corners.
es: Seleccionar la herramienta **Cinta** (|tape|) y activar la opción **Unir vectores**; activar también la opción **Suavizar** si se desea obtener una unión suave, sin esquinas.

source: Set the type to **Normal** and the mode to **Endpoint to Endpoint**, click a stroke endpoint and drag to a different endpoint; the pointer snaps to the closest detected stroke endpoint.
es: Definir el tipo como **Normal** y el modo en **Extremo a extremo**, hacer clic en el extremo de un trazo y arrastrar hasta otro extremo; el puntero se adherirá al extremo más cercano detectado.

source: Set the type to **Rectangular**, and click and drag to define a box including the endpoints you want to connect; the endpoints will be automatically joined according to the set **Distance** value.
es: Definir el tipo como **Rectangular**, hacer clic y arrastrar para definir un marco que incluya a los extremos que se desee conectar; los extremos se unirán automáticamente de acuerdo al valor fijado para la opción **Distancia**.

source: If the strokes you are going to join have different Styles, the Style of the first vector where you click on will be assigned to the second one after joining.
es: Si los trazos que se desea unir usaran distintos Estilos, el Estilo del primer trazo será asignado al segundo, luego de la unión.

source: **To split a stroke:**
es: **Para dividir un trazo:**

source: Select the **Cutter** tool (|cutter|): the pointer snaps to the closest stroke indicating, with a small highlighted segment, the point where you are going to split the stroke.
es: Seleccionar la herramienta **Cortar (|cutter|): el puntero se adherirá al trazo más cercano indicando, con un segmento perpendicular al trazo, el punto en donde se producirá su división.

source: Click to split the stroke at the highlighted point.
es: Hacer clic para dividir el trazo en el punto deseado.

source: Cleaning up Strokes Intersections
es: Limpieza de intersecciones de trazos

source: Vector strokes intersections may be a weak point in drawings to be painted, because if a gap occurs, drawing areas cannot be painted properly.
es: Las intersecciones de trazos vectoriales pueden ser un punto débil en dibujos que deban ser pintados, debido a que si se produjeran huecos, las áreas del dibujo no podrán ser rellenadas apropiadamente.

source: The best solution for this kind of issue is to overlap the final section of strokes, in order to define clear intersections, then automatically remove the sections that overflow.
es: La mejor solución para esta clase de problema es superponer las secciones finales de los trazos, de manera de que las intersecciones queden bien definidas, luego remover automáticamente las secciones que sobresalen usando la función **Corregir intersecciones de trazos**.

source: **To cleanup vector intersections:**
es: **Para limpiar intersecciones de trazos:**

source: Use the **Selection** tool (|selection|) to select the strokes whose intersections you want to cleanup.
es: Usar la herramienta **Seleccionar** (|selection|) para seleccionar los trazos cuyas intersecciones se desea limpiar.

source: Choose Level → Optimize → **Remove Vector Overflow**.
es: Elegir Nivel → Optimización → **Corregir intersecciones de trazos**.

source: Right-click the selection and choose **Remove Vector Overflow** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Corregir intersecciones de trazos** en el menú.

source: Animation Techniques
es: Técnicas de animación

source: Besides drawing frame by frame, one image at a time, until you achieve the animation you want, some other techniques are easier to achieve thanks to OpenToonz features.
es: Además de poder animar cuadro a cuadro, una imagen a la vez, hasta lograr la animación que se busca, existen algunas otras técnicas más sencillas que OpenToonz permite usar.

source: Whatever the technique is, you can control your work and how smooth the animation is by using the onion skin, that allows you to view more than one image in the viewer at the same time as reference.
es: Cualquiera sea la técnica, es posible controlar qué tan pulida queda la animación, usando la piel de cebolla, que permite ver más de una imagen en el Visor al mismo tiempo, como referencia.

source: Modelling a Vector Drawing
es: Modelado de dibujos vectoriales

source: Instead of animating a level by starting every time from a blank frame, you can duplicate a vector drawing and make subsequent modifications. You can do it even if the drawings are painted, because the styles used to paint will automatically follow the shape of the areas you modify (see :ref:`Editing Drawings <editing_drawings>` ).
es: En vez de animar un nivel, comenzando cada vez desde un fotograma en blanco, es posible duplicar un dibujo vectorial existente y realizarle modificaciones con posterioridad. Es posible realizar esto, aún en el caso de que los dibujos ya estuvieran pintados, yaque los Estilos usados para la pintura seguirán automáticamente la forma de las áreas, a medida que son modificadas (ver :ref:`Edición de dibujos <editing_drawings>` ).

source: The sequence of the animation level drawings can be easily controlled in the Level Strip.
es: Es posible controlar la secuencia de los dibujos de un nivel de animación usando la Cinta de nivel.

source: You can use both the Cells → **Duplicate Drawing** command and the standard **Copy** and **Paste** commands to make a copy of a drawing that you can later modify to create slight movements.
es: Es posible usar tanto el comando Celdas → **Duplicar dibujo** como los comandos **Copiar** y **Pegar** para hacer una copia de un dibujo y modificarla posteriormente para crear movimientos sutiles.

source: When you use the **Duplicate Drawing** command, the selected drawing is duplicated in the following frame. If the following frame already contains a drawing, it's shifted down in order to insert the duplicated drawing in the sequence.
es: Al usar el comando **Duplicar dibujo**, el dibujo seleccionado será duplicado en el siguiente fotograma del nivel. Si el siguiente fotograma ya contuviera un dibujo, será desplazado hacia abajo para poder insertar el dibujo duplicado.

source: When you use the **Copy** and **Paste** commands, you can also decide the frame of the Level Strip where you want to paste the drawing.
es: Al usar los comandos **Copiar** y **Pegar**, es posible decidir el fotograma de la Cinta de nivel donde se desea pegar el dibujo.

source: Once finished, you can make a copy of the modified drawing, and modify it in its turn. You can go on duplicating and modifying drawings until you complete the animation level.
es: Una vez terminado, es posible hacer una copia del dibujo modificado y a su vez modificarlo. Es posible continuar duplicando y modificando dibujos hasta completar el nivel de animación.

source: **To create an animation level by modelling vector drawings:**
es: **Para crear un nivel de animación modelando dibujos vectoriales:**

source: In the Viewer, select a drawing of the vector animation level you want to edit.
es: En el Visor, seleccionar un dibujo del nivel vectorial de animación que se desea editar.

source: In the Level Strip, select the drawing you want to duplicate.
es: En la Cinta de nivel, seleccionar el dibujo que se desee duplicar.

source: Copy the selected drawing in the following frame by doing one of the following:
es: Copiar el dibujo seleccionado en el fotograma siguiente haciendo una de las siguientes cosas:

source: Choose Cells → **Duplicate Drawing**.
es: Elegir Celdas → **Duplicar dibujo**.

source: Choose Edit → **Copy**, then select the following frame and choose **Paste**.
es: Elegir Editar → **Copiar**, luego seleccionar el siguiente fotograma y elegir **Pegar**.

source: Select the new drawing in the Level Strip.
es: Seleccionar el nuevo dibujo en la Cinta de nivel.

source: Use modifier tools to modify the drawing.
es: Usar las herramientas de modificación para alterar el dibujo.

source: Go on duplicating and modifying drawings until you complete the animation level.
es: Continuar modificando y modificando dibujos hasta completar el nivel de animación.

source: Using the In-betweener with Vector Drawings
es: Uso del comando Intermediar con dibujos vectoriales

source: An animation technique reserved to vector animation levels is the use of the **Inbetween** command. Inbetween creates in-between drawings from the two extremes of a range of selected frames in the Level Strip.
es: Una técnica de animación reservada a niveles vectoriales de animación es el uso del comando **Intermediar**. **Intermediar** es capaz de crear dibujos intermedios, entre dos dibujos no consecutivos de la Cinta de nivel.

source: When more than two frames are selected in the Level Strip, a vertical strip labeled **INBETWEEN** is displayed on the right of each frame. By clicking on it, all frames between the first and the last selected, will be overwritten by images interpolating from the first to the last drawings.
es: Cuando se seleccionan más de dos fotogramas en la Cinta de nivel, se muestra una banda vertical rotulada **INBETWEEN** en la parte derecha de cada fotograma. Al hacer clic sobre una de estas bandas, todos los fotogramas intermedios entre los dos extremos serán sobrescritos por nuevas imágenes que serán una interpolación entre el primer y último dibujo.

source: Duplicate a drawing; modify it; insert blank frames; select the frame range, then click the INBETWEEN vertical bar.
es: Duplicar un dibujo; modificarlo; insertar fotogramas en blanco; seleccionar el rango de fotogramas, luego hacer clic en la banda vertical rotulada INBETWEEN.

source: The interpolated drawings are created by taking into account the number of the strokes, and the strokes' direction. This means that the result will depend on the way drawings were made. For example if the first image is a single shape drawn clockwise, and the last is another shape, you will get different results depending on the way it was drawn, clockwise or counterclockwise.
es: Los dibujos interpolados son creados tomando en cuenta el número y dirección de cada trazo. Esto significa que el resultado dependerá de la manera en que los dibujos hayan sido hechos. Por ejemplo, si la primer imagen es una figura simple, dibujada en sentido horario, y la última imagen es otra figura, se obtendrán diferentes resultados dependiendo de si ésta última fue dibujada en sentido horario o antihorario.

source: To obtain the best results with complex drawings, copy the drawing you want to interpolate from, and paste it in another frame of the level strip. Modify the pasted drawing without adding and deleting strokes, but only distorting and moving existing strokes (see :ref:`Editing Drawings <editing_drawings>` ). Select the whole range and then perform the interpolation.
es: Para obtener el mejor resultado con dibujos complejos, es mejor copiar el dibujo desde el cual se desea interpolar y pegarlo en otro fotograma de la Cinta de nivel. Luego modificarlo, sin agregar o borrar trazos, sino únicamente distorsionando o moviéndolos (ver :ref:`Edición de dibujos <editing_drawings>` ). Seleccionar todo el rango y realizar la interpolación.

source: The interpolation acceleration can be controlled in the dialog that opens prior to performing in-betweening. Options are the following:
es: Es posible controlar la aceleración de la interpolación usando el diálogo que se abre antes de realizar la interpolación. Sus opciones son las siguientes:

source: **Linear**, for a constant interpolation.
es: **Lineal**, para una interpolación constante.

source: **Ease In**, for an interpolation starting slowly, then getting faster.
es: **Aceleración suave**, para una interpolación que comience acelerando suavemente y luego sea más rápida.

source: **Ease Out**, for an interpolation starting quickly, then getting slower.
es: **Desaceleración suave**, para una interpolación que comience rápidamente y luego desacelere suavemente.

source: **Ease In / Ease Out**, for an interpolation starting slowly, getting faster, then getting slower again.
es: **Aceleración y desaceleración suave**, para una interpolación que comience acelerando suavemente, se haga más rápida y luego desacelere suavemente.

source: If you want the interpolation to happen slower or faster, you can insert frames, or cut them, and use the in-betweener again.
es: Si se desea que la interpolación suceda más lento o más rápido, es posible insertar o borrar fotogramas y luego volver a usar el comando **Intermediar**.

source: **To create in-between drawings:**
es: **Para crear dibujos intermedios:**

source: Select the level where you want to perform interpolation.
es: Seleccionar el nivel donde se desea realizar la interpolación.

source: In the Level Strip select the frame range, from the drawing you want to interpolate from, to the one you want to interpolate to. If you want the interpolation to last more frames, make room for more drawings with the Edit → **Insert** command.
es: Enla Cinta de nivel seleccionar el rango de fotogramas a lo largo del cual se desea realizar la interpolación. Si se desea que la interpolación dure más fotogramas, se debe hacer espacio para más fotogramas usando el comando Editar → **Insertar**.

source: Click the vertical strip labeled **INBETWEEN** displayed on the right of the frame range selection.
es: Hacer clic en la banda vertical rotulada **INBETWEEN** que aparece a la derecha de los fotogramas del rango seleccionado.

source: Select the **Interpolation:** mode among **Linear**, **Ease In**, **Ease Out**, **Ease In / Esase Out**, and click the **Inbetween** button.
es: Seleccionar el modo de **Interpolación:** de entre las opciones: **Lineal**, **Aceleración suave**, **Desaceleración suave** y **Aceleración y desaceleración suave**, luego hacer clic en el botón **Intermediar**.

source: **To optimize the in-betweening process:**
es: **Para optimizar el proceso de interpolación:**

source: Create and paint the drawing you want to interpolate from.
es: Crear y pintar el dibujo desde el que se desea interpolar.
