Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: es

source: **Copy** and **Paste** it in another frame of the Level Strip, considering the number of in-between drawings you want to achieve.
es: **Copiar** y **Pegar** el dibujo en otro fotograma de la Cinta de nivel, considerando la cantidad de fotogramas intermedios que se desea obtener.

source: **Duplicate** it and insert as many empty frames as the number of in-between drawings you want to achieve.
es: **Duplicar** el dibujo e insertar tantos fotogramas vacíos intermedios como la cantidad de intermedios que se pretenda lograr.

source: Modify the pasted or duplicated drawing using the modifier tools, to create the final drawing of the interpolation.
es: Modificar el dibujo pegado o duplicado usando las herramientas de modificación, para crear el dibujo final de la interpolación.

source: Select the frame range from the drawing you want to interpolate from, to the one you want to interpolate to.
es: Seleccionar el rango de fotogramas, desde el dibujo inicial hasta el final.

source: Click the vertical **INBETWEEN** strip displayed on the right of the frame range selection.
es: Hacer clic en la banda vertical rotulada **INBETWEEN** que se muestra a la derecha de los fotogramas seleccionados.

source: Rotoscoping
es: Rotoscopía

source: Rotoscoping consists of tracing drawings taking a live clip as reference.
es: La Rotoscopía consiste en calcar dibujos, tomando un video filmado como referencia.

source: Using the rotoscoping technique to trace the movement of a hand.
es: Usando la técnica de Rotoscopía para calcar el movimiento de una mano.

source: As you can import clips and image sequences in a scene, you can simply load them, and create an animation level by drawing in the Viewer, while the frames of the clips are visible underneath. See :ref:`Using the File Browser <using_the_file_browser>` .
es: Ya qye es posible importar clips de video y secuencias de imágenes, es posible cargarlas y crear un nivel de animación dibujando en el Visor, mientras los fotogramas del video están visibles como referencia en el fondo. Ver :ref:`Uso del Explorador de archivos <using_the_file_browser>` .

source: The way to obtain best results is not trying to reproduce with fidelity the clip, but to use its frames just as a reference to better understand the movement or the transformation of the clip’s subject. In this way you can take advantage, for example, of a natural movement represented in the clip, without renouncing an expressive drawing style.
es: La forma de obtener el mejor resultado es no intentar reproducir el video con fidelidad, sino usar sus imágenes sólo como una referencia para entender mejor el movimiento o la transformación del objeto de interés en el video. De esta forma es posible sacar ventaja, por ejemplo, de un movimiento natural representado en el video, sin renunciar al uso de un estilo de dibujo expresivo.

source: **To perform rotoscoping:**
es: **Para realizar una rotoscopía:**

source: Load a video clip or image sequence in an Xsheet column (or Timeline layer).
es: Cargar un clip de video o una secuencia de imágenes en una columna de la Planilla (o capa de la Línea de tiempo).

source: In the Xsheet/Timeline select a cell in a column on the right of the column (or in a layer on top of the layer) containing the clip you loaded. The image of the clip placed at the same frame of the cell you selected will be visible in the Viewer while you're drawing.
es: En la Planilla/Línea de tiempo seleccionar una celda de una columna hacia la derecha de la columna (o de una capa por encima de la capa) que contiene el clip cargado.

source: Create a new animation level and use tools to trace the first drawing in the Viewer.
es: Crear un nuevo nivel de animación y usar herramientas de dibujo para calcar el primer fotograma en el Visor. La imagen del video quedará por debajo del dibujo que se está trazando.

source: Move to subsequent frames, and trace the next drawings.
es: Recorrer los fotogramas subsiguientes y seguir con el proceso de calcado de los siguientes dibujos.

source: Cloning Levels
es: Clonación de niveles

source: Sometimes it may be useful to create a clone of a level, or a part of it, in order to edit it without affecting the original one. For example you may want to create a new animation level starting from the drawings of another level, in order to have two sequences similar but not identical.
es: A veces puede resultar útil crear un clon de un nivel, o de una parte del mismo, para poder editarlo sin afectar el nivel original. Por ejemplo, es posible que se desee crear un nuevo nivel de animación a partir de los dibujos de uno ya existente, para obtener dos secuencias similares, pero no idénticas.

source: The **Clone Cells** command allows you to create an independent copy of the selected cells, preserving the numbering order and assigning a new name to it. The **_clone** suffix appended to the name of the level is the default.
es: El comando **Clonar celdas** permite crear una copia independiente de las celdas seleccionadas, preservando el orden de numeración y asignándole un nombre al nuevo nivel creado. De forma predefinida se anexará el sufijo **_clone** al nombre del nuevo nivel.

source: The cloned level will contain *only drawings exposed in the selected cells*, even if the original level is composed of more drawings; they will be automatically exposed in the column on the right (or layer on top) of the selection, shifting the following columns/layers.
es: El nivel clonado contendrá *sólo los dibujos expuestos en las celdas seleccionadas*, aunque el nivel original esté compuesto de más dibujos; el mismo será automáticamente expuesto en la columna a la derecha (o la capa superior) de la selección original de celdas, desplazando las columnas/capas siguientes, si existieran.

source: The new level will be available in the Scene Cast as a new element; it will be saved in the **+drawings** or **+extras** default folder, according to the format of the original file, as soon as you save it with the **Save Level** command, or you save the scene.
es: El nuevo nivel estará disponible como un nuevo elemento en el panel Componentes de la escena; y será guardado en la carpeta predefinida **+drawings** o **+extras**, de acuerdo al formato del archivo original, tan pronto como sea usado el comando **Guardar nivel**, o se guarde la escena.

source: The cell selection can also spread over several columns/layers: in this case the same number of new columns/layers will be inserted to make room for the cloning result. If more than one level is selected, the same number of new levels will be created and it's not possible to assign a name to the cloned levels.
es: La selección de celdas también puede extenderse a lo largo de varias columnas/capas: en este caso se insertará la misma cantidad de nuevas columnas/capas para contener los niveles clonados. Cuando haya más de un nivel seleccionado, se creará la misma cantidad de nuevos niveles y no será posible asignar un nombre personalizado a los mismos.

source: **To clone levels:**
es: **Para clonar niveles:**

source: Select the cells you want to clone.
es: Seleccionar las celdas que se desea clonar.

source: Choose Cells → **Clone Cells**.
es: Elegir Celdas → **Clonar celdas**.

source: Enter a **Level Name:** and press **OK** to confirm.
es: Ingresar el **Nombre del nivel:** y presionar el **Aceptar** para confirmar.

source: Using Onion Skin
es: Uso de piel de cebolla

source: If you want to view more than one level drawing at the same time in the Viewer as reference when you create drawings, or you want to check the animation, you can activate the Onion Skin mode.
es: Si se desea ver más de un dibujo de un nivel al mismo tiempo en el Visor, como referencia al crear dibujos, o se desea comprobar la animación, es posible activar el modo **Piel de cebolla**.

source: The Onion Skin is available both in the Xsheet/Timeline and in the Level Strip, according to where the cursor showing the current frame is displayed, as the onion skin can be activated starting from the cursor and managed in the frame number column/bar.
es: La Piel de cebolla se encuentra disponible tanto en la Planilla/Línea de tiempo como en la Cinta de nivel, de acuerdo a donde se encuentre visible el cursor de tiempo, ya que la función puede ser activada desde el propio cursor y administrada desde la columna/barra de fotogramas.

source: A column animation displayed with the relative Onion Skin set for 6 previous frames, step two, and an absolute Onion Skin set at frame 35.
es: La animación de una columna con Piel de cebolla relativa, mostrando los 6 fotogramas anteriores, a fotograma doble, y con el fotograma 35 marcado como absoluto.

source: When a frame of the Level Strip is selected, the onion skin applies to the *current level* only, referring to the sequence of the full animation level as it was created.
es: Cuando un fotograma de la Cinta de nivel se encuentra seleccionado, la piel de cebolla se aplica sólo al *nivel actual*, haciendo referencia a la secuencia completa del nivel de animación, tal como fue creado.

source: When a cell of the Xsheet/Timeline is selected, the onion skin applies to the current level, according to how the drawing sequence is exposed in the scene, including movements and transformations performed thanks to the object animation (see :ref:`Animating Objects <animating_objects>` ), while the rest of the scene in the current frame will be visible as usual. If you want, you can also extend the onion skin to the whole content of the Xsheet/Timeline, to allow references to all of the animated or moving elements in the scene as well.
es: Cuando una celda de la Planilla/Línea de tiempo se encuentra seleccionada, la piel de cebolla se aplica sólo al nivel actual, de acuerdo a cómo la secuencia de dibujos se encuentre expuesta en la escena, incluyendo movimientos y transformaciones realizadas gracias a la animación de parámetros de la columna/capa (ver :ref:`Animación de objetos <animating_objects>` ), mientras que el resto de la escena en el fotograma actual será visible normalmente. Si se desea, también es posible extender la piel de cebolla a todo el contenido de la Planilla/Línea de tiempo, para permitir también tener referencias de todos los elementos animados o en movimiento en la escena.

source: The *relative* Onion Skin mode displays frames in relation to the position of the current frame. For instance you can activate the frame previous to the current one, and every time you change the current frame, the previous frame will be displayed.
es: El modo *relativo* de la Piel de cebolla muestra fotogramas en relación con la posición del fotograma actual. Por ejemplo, es posible activar el fotograma anterior al actual, y cada vez que el fotograma actual cambie, el fotograma anterior al mismo será mostrado.

source: The *fixed* Onion Skin mode displays the selected frame independently from the current frame. For instance you can activate frame 5, and every time you change the current frame, frame 5 will be displayed in Onion Skin mode.
es: El modo *absoluto* (o fijo) de la Piel de cebolla muestra los fotogramas seleccionados independientemente de cual sea el fotograma actual. Por ejemplo, es posible activar el fotograma 5, y cada vez que el fotograma actual cambie, el fotograma 5 será mostrado en modo Piel de cebolla.

source: The way images are displayed in Onion Skin mode can be customized in the Preferences... → Onion Skin section. It's possible to define the **Paper Thickness**, to set an independent color correction for previous and following frames, and to **Display Lines Only** for Toonz Vector and Toonz Raster.
es: Es posible personalizar la forma en que las imágenes son mostradas en el modo Piel de cebolla, desde el panel de Preferencias... → Piel de cebolla. Allí es posible definir el **Grosor del papel**, definir colores independientes para los fotogramas anteriores y siguientes, así como **Sólo mostrar líneas** para niveles Vectorial de Toonz e Imagen de Toonz.

source: **To activate or deactivate frames in Relative Onion Skin mode:**
es: **Para activar o desactivar fotogramas de Piel de cebolla en modo Relativo:**

source: In the Xsheet, click the small romboid markers available to the left of the frames column (or above the frame bar in the Timeline). Click and drag automatically activates or deactivates a series of frames.
es: En la Planilla, hacer clic sobre los pequeños marcadores romboides a la izquierda de la columna de fotogramas (o encima de la barra de fotogramas en la Línea de tiempo). Si se hace clic y se arrastra se activará automáticamente una serie de fotogramas.

source: In the Level Strip, click the small circular markers available to the left of the strip frames. Click and drag automatically activates or deactivates a series of frames.
es: En la Cinta de nivel, hacer clic en los pequeños marcadores circulares a la izquierda de los fotogramas de la cinta. Si se hace clic y se arrastra se activará automáticamente una serie de fotogramas.

source: **To activate or deactivate frames in Fixed Onion Skin mode:**
es: **Para activar o desactivar fotogramas de Piel de cebolla en modo Absoluto:**

source: In the Xsheet, click the small ghosted romboid markers available to the very left of the frames column (or above the frame bar in the Timeline). Click and drag automatically activates or deactivates a series of frames.
es: En la Planilla, hacer clic sobre los pequeños marcadores romboides atenuados en el extremo izquierdo de la columna de fotogramas (o encima de la barra de fotogramas en la Línea de tiempo). Si se hace clic y se arrastra se activará automáticamente una serie de fotogramas.

source: In the Level Strip, click the small ghosted circular markers available to the very left of the strip frames. Click and drag automatically activates or deactivates a series of frames.
es: En la Cinta de nivel, hacer clic en los pequeños marcadores circulares atenuados en el extremo izquierdo de los fotogramas de la cinta. Si se hace clic y se arrastra se activará automáticamente una serie de fotogramas.

source: **To Deactivate (or Activate again) the Onion Skin mode:**
es: **Para desactivar (o volver a activar) el modo Piel de cebolla:**

source: Double-click over the big circle to the left of the current frame cursor. Double-click again to activate it back.
es: Hacer doble clic sobre el círculo grande a la izquierda del cursor de tiempo en la Planilla (o encima del mismo en la Línea de tiempo). Hacer doble clic nuevamente para volver a activarlo.

source: Right-click in the Viewer or in the frames column/bar of the Xsheet/Timeline, and choose **Deactivate Onion Skin** or **Activate Onion Skin** in the menu that opens.
es: Hacer clic derecho en el Visor o en la columna/barra de fotogramas en la Planilla/Línea de tiempo y elegir la opción **Desactivar piel de cebolla** o **Activar piel de cebolla** en el menú.

source: The first time you activate Onion Skin mode by Right-clicking in the Viewer or the Xsheet/Timeline frames column/bar, a default relative onion skin mode activates, showing the previous three frames.
es: La primera vez que se activa el modo Piel de cebolla haciendo clic derecho en el Visor o la columna/barra de fotogramas de la Planilla/Línea de tiempo, se activa un modo relativo predefinido, que muestra los tres fotogramas anteriores.

source: **To Extend the onion skin to the Whole Scene Content:**
es: **Para extender la piel de cebolla para mostrar todo el contenido de la escena:**

source: Activate the onion skin in the Xsheet/Timeline.
es: Activar la Piel de cebolla en la Planilla/Línea de tiempo.

source: Right-click in the Viewer or in the frame column/bar of the Xsheet/Timeline, and choose **Extend Onion Skin to Scene** from the menu that opens.
es: Hacer clic derecho en el Visor o en la columna/barra de fotogramas de la Planilla/Línea de tiempo y elegir la opción **Extender piel de cebolla a toda la escena** en el menú.

source: **To Limit the onion skin to the Current Level:**
es: **Para limitar la Piel de cebolla al nivel actual:**

source: Right-click in the Viewer or in the frame column/bar of the Xsheet/Timeline, and choose **Limit Onion Skin to Level** from the menu that opens.
es: Hacer clic derecho en el Visor o en la columna/barra de fotogramas de la Planilla/Línea de tiempo y elegir la opción **Limitar piel de cebolla a este nivel** en el menú.

source: **To customize the way images are displayed in onion skin mode:**
es: **Para personalizar la forma en que las imágenes son mostradas en el modo Piel de cebolla:**

source: Choose File → Preferences... → **Onion Skin**.
es: Elegir Archivo → Preferencias... → **Piel de cebolla**.

source: Set a value for the **Paper Thickness** parameter; the lower the value, the more transparent the drawings displayed in Onion Skin mode will be.
es: Definir un valor para el parámetro **Grosor del papel**; cuanto menor sea el mismo, más transparente se mostrarán los dibujos en el modo Piel de cebolla.

source: Use the **Previous Frames Correction** to set a color for displaying previous frames.
es: Usar **Fotogramas anteriores:** para definir un color para mostrar los fotogramas anteriores.

source: Use the **Following Frames Correction** to set a color for displaying following frames.
es: Usar **Fotogramas siguientes:** para definir un color para mostrar los fotogramas siguientes.

source: Activate the **Display Lines Only** option to display Toonz Vector or Toonz Raster levels with lines only.
es: Activar la opción **Sólo mostrar líneas** para mostrar sólo las líneas en los niveles Vectorial de Toonz e Imagen de Toonz.

source: Using Shift and Trace
es: Uso de Desplazar y calcar

source: The **Shift and Trace** function can help you in the creation of animated levels as if you were drawing on paper using a light table; in fact it allows you to use the previous and next key drawings as references, while you insert an inbetween or a break down.
es: La función **Desplazar y calcar** puede ser de ayuda al crear niveles de animación, de forma similar a cuando se dibuja en papel usando una mesa retroiluminada. Esta función permite usar los dibujos clave *anterior* y *siguiente* como referencias, mientras se está dibujando un nuevo intermedio.

source: It's possible to temporary move and rotate the drawings you want to use as reference, to fit the position where you want to draw the inbetween. It's also possible to automatically set the position of the reference drawings creating and editing a path of action line.
es: Es posible mover y rotar temporalmente los dibujos usados como referencia, para ajustarlos a la posición donde se desea dibujar el intermedio. También es posible establecer la posición de los dibujos de referencia de forma automática, creando y editando una curva de línea de acción.

source: To better check the new drawing and the animation, you can toggle the Shift and Trace visualization on or off the Viewer.
es: Para poder revisar más fácilmente el nuevo dibujo y la animación, es posible apagar y encender la visualización de la función Desplazar y calcar en el Visor.

source: **To enter the Shift and Trace view:**
es: **Para entrar al modo Desplazar y calcar:**

source: Position the frame cursor on the frame where you want to draw the inbetween drawing.
es: Posicionar el cursor de tiempo en el fotograma donde se desee dibujar el nuevo intermedio.

source: Enable View → **Shift and Trace**; the previous and next drawings will be visualized.
es: Habilitar la opción Ver → **Desplazar y calcar**; se visualizarán los fotogramas anterior y siguiente.

source: **To Edit the Position of the reference drawings:**
es: **Para editar la posición de los dibujos de referencia:**

source: Position the frame cursor where you want to draw the inbetween drawing and sketch the path of action line beteween your reference points.
es: Posicionar el cursor de tiempo donde se desee dibujar el intermedio y bocetar la curva de línea de acción entre los puntos de referencia.

source: Activate View → **Edit Shift**.
es: Activar Ver → **Editar desplazamiento**.

source: Click on the drawing you want to reposition in the Viewer, or use the **Previous Drawing** / **Following Drawing** options in the tool options bar; the related reference drawing bounding box will be displayed.
es: Hacer clic sobre el dibujo que se desee reposicionar en el Visor, o usar las opciones **Dibujo anterior** / **Dibujo siguiente** en la Barra de opciones de herramientas; se mostrará el marco delimitador del dibujo de referencia correspondiente.

source: Click and drag *inside the bounding box* to **move** the reference drawing.
es: Hacer clic y arrastrar *dentro del marco* para **mover** el dibujo de referencia.

source: Click and drag *outside the bounding box* to **rotate** the reference drawing.
es: Hacer clic y arrastrar *fuera del marco* para **rotar** el dibujo de referencia.

source: Click and drag *the center handle* to change the **center of rotation**.
es: Hacer clic y arrastrar *el círculo central* para cambiar el **centro de rotación** del dibujo de referencia.

source: Click and drag *any corner handle of the bounding box* to **scale** the reference drawing from its center.
es: Hacer clic y arrastrar *cualquier esquina del marco* para **escalar** el dibujo de referencia desde su centro.

source: Repeat the same steps on the second reference drawing.
es: Repetir los mismos pasos con el segundo dibujo de referencia.

source: **To automatically Edit the Position of the reference drawings:**
es: **Para editar automáticamente la posición de los dibujos de referencia:**

source: Ctrl-click and drag to create a path, from the reference point in the first drawing, to the reference point in the second one. The starting and the ending points will be overlapped at the center of the path.
es: Hacer Ctrl-clic y arrastrar para crear una curva desde el punto de referencia del primer dibujo hasta el del segundo. Los puntos inicial y final quedarán superpuestos en el centro de la curva.

source: Click and drag the handle along the path to change its shape; the reference drawings will move according to the handle position and rotate according to the path shape modification.
es: Hacer clic y arrastrar el asa central para cambiar su forma; los dibujos de referencia se moverán y rotarán de acuerdo a la modificación realizada a la curva.

source: If needed, use the bounding box handles to fix the rotation of the reference drawing.
es: Si fuera necesario, es posible rotar los dibujos de referencia desde fuera del marco delimitador.

source: Clicking and dragging one of the reference drawings will remove the path of action line.
es: Al hacer clic y arrastrar uno de los dibujos de referencia la curva de línea de acción será eliminada.

source: **To Toggle the Shift and Trace visualization:**
es: **Para apagar y encender la visualización de la función Desplazar y calcar:**

source: Activate View → **No Shift** to toggle the visualization of the reference drawings back to their original position.
es: Activar Ver → **Ver sin desplazamiento** para alternar la visualización de los dibujos de referencia de vuelta a sus posiciones originales.

source: **To Reset the position of the reference drawings:**
es: **Para restablecer la posición de los dibujos de referencia:**

source: Choose the View → **Reset Shift** command.
es: Elegir el comando Ver → **Restablecer desplazamiento**.

source: **To Reset the transformations of one of the reference drawings:**
es: **Para restablecer las transformaciones de uno de los dibujos de referencia:**

source: In the tool options bar click on either **Reset Previous** or **Reset Following** buttons.
es: En la barra de opciones de herramientas hacer clic en el botón **Restablecer anterior** o **Restablecer siguiente**.
