Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_curves_and_numerical_columns.po
Languages: es

source: Type the frame number in the **Frame** text box, or use the **Next Frame** and **Previous Frame** buttons available in the top bar of the editor.
es: Ingresar el número de fotograma en el campo de **Fotograma** o usar los botones **Fotograma anterior** o **Fotograma siguiente** en la barra superior del editor.

source: Move the current frame cursor in the Xsheet/Timeline.
es: Mover el cursor de tiempo en la Planilla/Línea de tiempo.

source: Use the frame bar or the playback buttons in the bottom bar of the main viewer.
es: Usar la barra de fotogramas o los botones de reproducción en la sección inferior del Visor.

source: **To add a keyframe:**
es: **Para agregar un fotograma:**

source: Click the **Set Key** button (|key|) to add a keyframe at the current frame.
es: Hacer clic en el botón **Marcar fotograma clave** (|key|) para agregar un fotograma clave en el fotograma actual.

source: Type a value in the **Value** text box to add a keyframe at the current frame.
es: Ingresar un valor en el campo **Valor** para agregar un clave en el fotograma actual.

source: Right-click and choose **Set Key** from the menu that opens.
es: Hacer clic derecho y elegir **Marcar fotograma clave** en el menú.

source: **Ctrl-click** (PC) or **Cmd-click** (Mac) the curve where you want to add the keyframe point to it.
es: Hacer **Ctrl-clic** (PC) o **Cmd-clic** (macOS) sobre la curva donde se desee agregar un fotograma clave.

source: **To remove a keyframe:**
es: **Para eliminar un fotograma clave:**

source: Select the keyframe to remove and choose Edit → **Delete**.
es: Seleccionar el fotograma clave a eliminar y elegir Editar → **Borrar**.

source: Set the current frame where a keyframe is and click the **Set Key** button (|key|).
es: Definir el fotograma donde se encuentre el clave a eliminar como el fotograma actual y hacer clic en el botón **Marcar fotograma clave** (|key|).

source: **To select keyframes:**
es: **Para seleccionar fotogramas clave:**

source: Click to select a keyframe.
es: Hacer clic para seleccionarlo.

source: Shift-click to add a keyframe to or remove it from the selection.
es: Hacer Mayúsculas-clic para agregar o quitar un fotograma clave a la selección.

source: Click and drag to select all of the keyframes that are in the area you define.
es: Hacer clic y arrastrar para seleccionar todos los fotogramas clave dentro del área definida.

source: **To select curve segments:**
es: **Para seleccionar un segmento de una curva:**

source: Select the segment or the control points at the ends of the segment.
es: Seleccionar el segmento o los puntos de control en los extremos del mismo.

source: **To move the selection:**
es: **Para mover la selección:**

source: Click and drag any of the selected control points.
es: Hacer clic y arrastrar cualquiera de los puntos de control seleccionados.

source: **To edit curves:**
es: **Para editar curvas:**

source: Use the **Copy** command: the selected segments will be kept in memory for further operations.
es: Usar el comando **Copiar** para mantener los segmentos seleccionados en memoria para operaciones futuras.

source: Use the **Cut** command: the selected segments will be removed from the curve and will be kept in memory for further operations.
es: Usar el comando **Cortar** para eliminar los segmentos seleccionados de la curva y mantenerlos en memoria para operaciones futuras.

source: Use the **Paste** command: the segments kept in memory will be pasted starting from the selected keyframe, preserving any other previously defined keyframes not replaced by the new ones.
es: Usar el comando **Pegar** para pegar los segmentos en memoria, a partir del fotograma seleccionado y preservando cualquier otro fotograma de la curva no reemplazado por los nuevos.

source: Use the **Delete** command: the selection will be deleted.
es: Usar el comando **Borrar** para borrar los fotogramas clave seleccionados.

source: **To navigate keyframes for the current curve:**
es: **Para recorrer los fotogramas clave de la curva actual:**

source: Use the **Next Key** (|next_key|) and **Previous Key** buttons (|prevkey|) available at the sides of the **Set Key** button.
es: Usar los botones **Clave anterior** (|prevkey|) y **Clave siguiente** (|next_key|) disponibles a los lados del botón **Marcar fotograma clave**.

source: **To cycle previously created keyframes:**
es: **Para repetir los fotogramas clave de una curva:**

source: Right-click the dashed line after the end of the curve and choose **Activate Cycle** from the menu that opens.
es: Hacer clic derecho sobre la línea punteada al final de la curva y elegir **Activar ciclo** en el menú.

source: **To disable the cycle:**
es: **Para deshabilitar la repetición de una curva:**

source: Right-click the curve and choose **Deactivate Cycle** from the menu that opens.
es: Hacer clic derecho sobre la línea punteada al final de la curva y elegir **Desactivar ciclo** en el menú.

source: Only keyframes included in the selection are considered when performing copy, cut and paste operations.
es: Sólo los fotogramas clave incluidos en la selección será incluidos al realizar las operaciones copiar, cortar y pegar.

source: All the **Edit** menu commands are also available in the menu that opens when right-clicking in the Xsheet/Timeline cells.
es: Todos los comandos del menú **Editar** también se encuentran disponibles en el menú contextual que se invoca al hacer clic derecho sobre las celdas de la Planilla/Línea de tiempo.

source: Setting Segment Interpolations
es: Definición de la interpolación de segmentos

source: A transformation segment, that is to say the section between two keyframes, can have different interpolations affecting the way the value changes from one key to another. The set interpolation will be displayed graphically in the Graph Editor, and as a series of values, one for each frame, in the Spreadsheet.
es: Cada segmento de una transformación animada (es decir cada sección entre dos fotogramas clave), tendrá un tipo de interpolación elegido de entre varios disponibles, que afectará la forma en que el valor cambiará al pasar de un clave al otro. La interpolación definida será mostrada de forma visual en las curvas del Editor de gráficas y como una serie de valores (uno para cada fotograma) en la Planilla de tiempos.

source: Available interpolations are the following: **Linear**, **Speed In / Speed Out**, **Ease In / Ease Out**, **Ease In / Ease Out %**, **Exponential**, **Expression**, **File**, **Constant** and **Similar Shape**. The Default Interpolation option can be set in the Preferences... → Animation dialog section, but it can be changed at any time in the interpolation area of the Function Editor, on the top right of the window.
es: Los tipos de interpolación disponibles son los siguientes: **Lineal**, **Bezier**, **Suave**, **Suave %**, **Exponencial**, **Expresión**, **Archivo**, **Constante** y **Forma similar**. El tipo predefinido de interpolación puede ser definido en el diálogo Archivo → Preferencias... → Animación, pero luego podrá ser modificado en cualquier momento en el área de interpolación del Editor de funciones, situada en la parte superior derecha del panel.

source: In the same area it is also possible to define an interpolation **Step**, that is to say the number of frames for which the interpolation values have to be repeated, for instance to match a movement with an animation level exposed at a specific step. The default animation step can be set in the Preferences... → Animation dialog section.
es: En la misma área también será posible definir la **Exposición** a la cual simulará funcionar la interpolación, esto es la cantidad de veces que deberán repetirse los fotogramas interpolados, para hacerlos coincidir con el movimiento de un nivel de animación que use un nivel de exposición específico. Es posible definir la exposición predefinida en el diálogo Archivo → Preferencias... → Animación.

source: **To set the type of interpolation for a segment in the Spreadsheet:**
es: **Para definir el tipo de interpolación para un segmento en la Planilla de tiempos:**

source: Move the current frame cursor to a frame belonging to a segment.
es: Mover el cursor de tiempo hasta un fotograma perteneciente al segmento deseado.

source: Choose the interpolation from the option menu available in the **Interpolation:** area of the Function Editor.
es: Elegir la interpolación usando el menú desplegable disponible en el área de **Interpolación** del Editor de funciones.

source: Click the **Apply** button to apply the desired change.
es: Hacer clic en el botón **Aplicar** para aplicar el cambio deseado.

source: **To set the type of interpolation for multiple segments in the Spreadsheet:**
es: **Para definir el tipo de interpolación para varios segmentos en la Planilla de tiempos:**

source: Make a cell selection that encompases multiple keyframe segments.
es: Realizar una selección de celdas que abarque varios segmentos de claves.

source: Right click on one of the selected cells and choose the desired interpolation type in the menu that opens.
es: Hacer clic derecho sobre una de las celdas seleccionadas y elegir el tipo de interpolación deseado en el menú.

source: **To set the type of interpolation for a segment in the Graph Editor:**
es: **Para definir el tipo de interpolación para un segmento en el Editor de gráficas:**

source: Set the segment by doing one of the following:
es: Definir el segmento realizando una de las siguientes acciones:

source: Click a segment to select it.
es: Hacer clic sobre un segmento para seleccionarlo.

source: Move the **Current Frame Marker** to a frame belonging to a segment.
es: Mover el **Cursor de tiempo** hasta un fotograma perteneciente al segmento deseado.

source: Choose the interpolation from the dropdown menu available in the **Interpolation:** area of the Function Editor.
es: Elegir el tipo de interpolación, usando el menú desplegable disponible en el área de **Interpolación** del Editor de funciones.

source: The interpolation options are also available when right-clicking a segment.
es: Las opciones de interpolación también se encuentran disponibles al hacer clic derecho sobre un segmento.

source: **To set the Step of the interpolation:**
es: **Para definir la Exposición de la interpolación:**

source: Specify the **Step** value in the interpolation area of the Function Editor.
es: Especificar el valor **Exposición** en el área de Interpolación del Editor de funciones.

source: Using Linear Interpolations
es: Uso de interpolación Lineal

source: When the interpolation is *Linear* the curve segment turns to a straight line and the speed of the transformation is constant.
es: Cuando la interpolación es *Lineal* el segmento de curva se torna en una línea recta y la velocidad de la transformación será constante.

source: **To set a Linear interpolation:**
es: **Para definir una interpolación Lineal:**

source: Choose **Linear** from the option menu available in the Interpolation area of the Function Editor and click the **Apply** button.
es: Elegir **Lineal** en el menú de opciones en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Right-click the curve segment you want to set the interpolation for, and choose **Linear Interpolation** from the menu that opens.
es: Hacer clic derecho sobre el segmento de curva para el que se desee definir la interpolación y elegir **Interpolación lineal** en el menú.

source: Using Speed In / Speed Out Interpolations
es: Uso de interpolación Bézier

source: When the interpolation is Speed In / Speed Out, both control points at the ends of the segment have handles whose direction and length define the slope of the curve, therefore the speed of the transformation. The handles direction and length can be set by entering values in the Interpolation area of the Function Editor, or by dragging the handles themselves.
es: Cuando la interpolación es *Bézier* los puntos de control del segmento de curva tendrán tangentes, cuya dirección y longitud definirá la pendiente de la curva y, por lo tanto, la velocidad de la transformación. La dirección de las tangentes y su longitud podrán ser establecidas ingresando valores en el área de Interpolación del Editor de funciones o arrastrando las propias tangentes en el Editor de gráficas.

source: By default the handles are linked, making their degree of movement dependent on adjacent segments in order to define a smooth curve, but the link can be broken in order to move the handle freely. For example if subsequent segments have the Speed In / Speed Out interpolation, the handles of the shared points share the same direction, but breaking the link each handle can have a different direction.
es: De forma predefinida las tangentes se encontrarán vinculadas, haciendo que su grado de movimiento sea dependiente de los segmentos adyacentes, de forma de producir curvas suaves, pero es posible romper dicho vínculo para poder moverlas de forma independiente. Por ejemplo, cuando dos segmentos consecutivos tuvieran una interpolación de tipo Bézier y las tangentes de su punto de control compartido tuvieran la misma dirección, será posible romper el vínculo entre ellas para poder darle a cada una una dirección distinta.

source: Handles can also be collapsed in control points in order to turn them into corner points; in this case to retrieve the handles it is possible to reset their length and direction.
es: También es posible colapsar las tangentes hacia sus puntos de control, para transformarlos en esquinas; en este caso para obtener nuevamente las tangentes será posible restablecer su longitud y dirección.

source: **To set a Speed In / Speed Out interpolation:**
es: **Para definir una interpolación Bézier:**

source: Choose **Speed In / Speed Out** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
es: Elegir **Bézier** en el menú de opciones en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Right-click the curve segment you want to set the interpolation for, and choose **Speed In / Speed Out Interpolation** from the menu that opens.
es: Hacer clic derecho sobre el segmento de curva para el que se desee definir la interpolación y elegir **Interpolación Bézier** en el menú.

source: **To set the speed of the interpolation:**
es: **Para definir la velocidad de la interpolación:**

source: Select the keyframe at the beginning or at the end of the curve segment you want to edit, or the curve segment itself.
es: Seleccionar un fotograma clave, perteneciente al comienzo o final del segmento de curva que se desee editar, o el propio segmento.

source: Set the slope of the curve after or before the keyframe by doing one of the following:
es: Definir la pendiente de la curva después o antes del fotograma clave realizando una de las siguientes acciones:

source: Enter the **Speed In** and **Speed Out** direction and length values in the Interpolation area of the Function Editor and click the **Apply** button.
es: Ingresar valores de dirección y longitud para las **Tangentes** de la **Velocidad inicial** y **Velocidad final**, en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Click and drag the end of the handles to move them freely.
es: Hacer clic y arrastrar las tangentes para moverlas de forma libre.

source: **Shift-click** and drag the end of the handles to move them with a constraint in the horizontal or vertical direction.
es: Hacer **Mayúsculas-clic** y arrastrar las tangentes para moverlas en los ejes horizontal o vertical.

source: **To move a control point handle free from the adjacent segments:**
es: **Para mover la tangente de un punto de control, libremente con respecto a la del segmento adyacente:**

source: Right-click the control point and choose **Unlink Handles** from the menu that opens.
es: Hacer clic derecho sobre el punto de control y elegir **Desvincular tangentes** en el menú.

source: **To link back handles to adjacent segments:**
es: **Para vincular nuevamente las tangentes de segmentos adyacentes:**

source: Right-click the control point and choose **Link Handles** from the menu that opens.
es: Hacer clic derecho sobre el punto de control y elegir **Vincular tangentes** en el menú.

source: **To turn a control point into a corner point:**
es: **Para transformar un punto de control en una esquina:**

source: Select the control point.
es: Seleccionar el punto de control.

source: Move the handle ends to the control point, in order to collapse them.
es: Mover sus tangentes hasta el punto de control, para colapsarlas.

source: **To retrieve handles from a corner point:**
es: **Para recuperar las tangentes de un punto de control:**

source: Right-click the control point and choose **Reset Handles** from the menu that opens.
es: Hacer clic derecho sobre el punto de control y elegir **Restablecer tangentes** en el menú.

source: Using Ease In / Ease Out Interpolations
es: Uso de interpolación Suave

source: When the interpolation is Ease In / Ease Out, the segment is divided into three sections by two vertical lines: the first section is an acceleration, the second is at constant speed, the third is a deceleration. The duration in frames of each section can be set by entering values in the Interpolation area of the Function Editor, or by dragging the vertical lines available on the segment.
es: Cuando la interpolación es *Suave*, dos líneas verticales dividirán el segmento de curva en tres secciones: la primera sección será de aceleración, la segunda de velocidad constante y la tercera de desaceleración. Será posible definir la duración en fotogramas de cada sección, ingresando valores en el área de Interpolación del Editor de funciones, o arrastrando las líneas verticales disponibles sobre el segmento de la curva, en el Editor de gráficas.

source: **To set an Ease In / Ease Out interpolation:**
es: **Para definir una interpolación Suave:**

source: Choose **Ease In / Ease Out** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
es: Elegir **Suave** en el menú de opciones en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Right-click the curve segment you want to set the transformation for, and choose **Ease In / Ease Out Interpolation** from the menu that opens.
es: Hacer clic derecho sobre el segmento de curva para el que se desee definir la interpolación y elegir **Interpolación suave** en el menú.

source: **To set the Ease In / Ease Out of the interpolation:**
es: **Para definir la aceleración y desaceleración de la interpolación:**

source: Select the keyframe before or after the Ease In / Ease Out curve segment you want to edit, or the curve segment itself.
es: Seleccionar un fotograma clave, perteneciente al comienzo o final del segmento de curva que se desee editar, o el propio segmento.

source: Enter the **Ease In** and **Ease Out** values in the Interpolation area of the Function Editor and click the **Apply** button.
es: Ingresar los valores de **Aceleración suave:** y **Desaceleración suave:**, en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Move the vertical line setting the Ease In or Ease Out section of the segment, to change the curve after or before the keyframe.
es: Mover las líneas verticales que permiten definir las secciones de Aceleración suave o Desaceleración suave de un segmento de curva, para cambiar la curva después o antes de un fotograma clave.

source: Using Ease In / Ease Out % Interpolations
es: Uso de interpolación Suave %

source: The Ease In / Ease Out % interpolation is similar to the Ease In / Ease Out one, but the Ease In and Ease Out sections of the segments are expressed as a percentage of the segment frame duration.
es: La interpolación **Suave %** es similar a la interpolación **Suave**, pero definiendo las secciones de aceleración y desaceleración como porcentajes de la duración del segmento.

source: **To set an Ease In / Ease Out % interpolation:**
es: **Para definir una interpolación Suave %:**

source: Choose **Ease In / Ease Out %** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
es: Elegir **Suave %** en el menú de opciones en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Right-click the curve segment you want to set the transformation for, and choose **Ease In / Ease Out % Interpolation** from the menu that opens.
es: Hacer clic derecho sobre el segmento de curva para el que se desee definir la interpolación y elegir **Interpolación suave (%)** en el menú.

source: **To set the Ease In / Ease Out % of the interpolation:**
es: **Para definir el porcentaje de aceleración y desaceleración de la interpolación Suave:**

source: Move the vertical line setting the Ease In or Ease Out section of the curve segment, to change the curve after or before the keyframe.
es: Mover las líneas verticales que permiten definir las secciones de Aceleración suave o Desaceleración suave de un segmento de curva, para cambiar la curva después o antes de un fotograma clave.

source: Using Exponential Interpolations
es: Uso de interpolación Exponencial

source: When the interpolation is **Exponential** the curve segment turns to a curve that continually becomes steeper, because of that, the higher the frame, the faster the related value grows. Only positive values are significant for this interpolation.
es: Cuando la interpolación es **Exponencial** el segmento de curva se volverá progresivamente más inclinado, debido a eso, cuánto mayor sea el fotograma, más rápido crecerá el valor correspondiente. Únicamente los valores positivos son significativos para este tipo de interpolación.

source: **To set an Exponential interpolation:**
es: **Para definir una interpolación Exponencial:**

source: Choose **Exponential** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
es: Elegir **Exponencial** en el menú de opciones en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Right-click the curve segment you want to set the transformation for, and choose **Exponential Interpolation** from the menu that opens.
es: Hacer clic derecho sobre el segmento de curva para el que se desee definir la interpolación y elegir **Interpolación exponencial** en el menú.

source: Using Interpolations Based on Expressions
es: Uso de interpolación basada en una Expresión

source: When the interpolation is defined by an Expression, the segment values come from a *mathematical formula* that can be typed by using algebra notations. In this case the keyframes at both ends of the segment may change as well, according to the typed expression.
es: Cuando la interpolación se encuentre definida por una **Expresión**, los valores del segmento de curva provendrán de una *fórmula matemática* que podrá ser ingresada usando una notación algebraica. En este caso, es posible que los fotogramas de ambos extremos del segmento también cambien, de acuerdo a la expresión ingresada.
