Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_curves_and_numerical_columns.po
Languages: es

source: If in the Browser you choose any project default folder, in the path field the full path will be replaced by the related default folder alias (see :ref:`Project Default Folders <project_default_folders>` ).
es: Si en el Explorador se escogiera cualquier carpeta predefinida del proyecto activo, en el campo **Ruta:** la ruta completa será reemplazada por la referencia a la carpeta predefinida correspondiente (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).

source: Using Constant Interpolations
es: Uso de interpolación Constante

source: When an interpolation is **Constant**, the segment values are always equal to the value of the first key defining the segment.
es: Cuando la interpolación es **Constante**, el valor en cada fotograma del segmento de curva será igual al del primer fotograma clave del mismo.

source: **To set a Constant interpolation:**
es: **Para definir una interpolación Constante:**

source: Choose **Constant** from the option menu available in the Interpolation area of the Function Editor and click the **Apply** button.
es: Elegir **Constante** en el menú de opciones en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Right-click the curve segment you want to set the interpolation for, and choose **Constant Interpolation** from the menu that opens.
es: Hacer clic derecho sobre el segmento de curva para el que se desee definir la interpolación y elegir **Interpolación constante** en el menú.

source: Using Interpolations Based on Similar Shapes
es: Uso de interpolación basada en una Forma similar

source: When the interpolation is based on a Similar Shape, the segment values changes according to the shape of the curve you specify as reference (see :ref:`Using Transformation References <using_transformation_references>` ). As soon as the interpolation is set, whenever the reference curve is edited, the segment will change accordingly.
es: Cuando la interpolación esté basada en una Forma similar, los valores del segmento de curva cambiarán de acuerdo a la forma de la curva que se especifique como referencia (ver :ref:`Uso de referencias a transformaciones <using_transformation_references>` ). Una vez la interpolación se haya definido, cuando la curva de referencia sea editada, el segmento cambiará correspondientemente.

source: This interpolation proves useful when you want to control at once several curves: if all of them share the same reference curve, by modifying the reference curve you will modify automatically all the curves referring to it.
es: Este tipo de interpolación puede ser útil cuando se desee controlar varias curvas a la vez: si todas ellas compartieran la misma curva de referencia, al modificar esta última, se modificarán automáticamente todas las que hagan referencia a ella.

source: It is also possible to set a **Frame Offset** value so that the interpolation will refer not to the same frame range of the reference curve, but to a different one.
es: También será posible establecer en la opción **Desplazamiento de fotogramas:** un valor de desplazamiento, para que la interpolación no se refiera al fotograma actual en la curva de referencia, sino a otro más adelante o atrás en el tiempo.

source: **To set an interpolation based on a Similar Shape:**
es: **Para definir una interpolación basada en una Forma similar:**

source: Choose **Similar Shape** from the option menu available in the Interpolation area of the Function Editor and click the **Apply** button.
es: Elegir **Forma similar** en el menú de opciones en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Right-click the curve segment you want to set the transformation for, and choose **Similar Shape Interpolation** from the menu that opens.
es: Hacer clic derecho sobre el segmento de curva para el que se desee definir la interpolación y elegir **Interpolación mediante forma similar** en el menú.

source: **To set the reference curve:**
es: **Para definir la curva de referencia:**

source: Set the **Reference Curve:** in the Interpolation area of the Function Editor by typing the reference to an object or an effect transformation by using the appropriate syntax (see :ref:`Using Transformation References <using_transformation_references>` ).
es: Definir la **Curva de referencia:** en el área de Interpolación del Editor de funciones, ingresando una referencia a la transformación un objeto o efecto, usando la sintaxis apropiada (ver :ref:`Uso de referencias a transformaciones <using_transformation_references>` ).

source: Set a **Frame Offset** in the Interpolation area of the Function Editor if you want the interpolation to refer not to the same frame range of the reference curve, but to a different one.
es: Definir un **Desplazamiento de fotogramas:** en el área de Interpolación del Editor de funciones, si se deseara que la interpolación no se refiera al fotograma actual de la referencia, sino a otro distinto.

source: Controlling Several Function Curves at the Same Time
es: Control de varias curvas de función a la vez

source: It's possible to control the keys and the interpolations of all the function curves visualized in the Function Editor by using widgets available in a horizontal strip at the top of the **Graph Editor** area, below the frame ruler.
es: Será posible controlar los fotogramas clave y las interpolaciones de todas las curvas visualizadas en el Editor de funciones, utilizando los controles disponibles en la banda horizontal en la parte superior del **Editor de gráficas**, debajo de la regla.

source: This allows you to define keys and control the interpolation speed for different curves at the same time, such as a camera truck and pan, or an effect animation and a pegbar movement.
es: Esto permitirá definir fotogramas clave y controlar la velocidad de la interpolación para varias curvas a la vez, tales como: el avance y el paneo de la cámara, o la animación de un efecto y el movimiento de una barra de sujeción.

source: With respect to keys, a keyframe is visible in the strip for each keyframe defined for any curve visible in the Graph Editor; a line connects the keyframes for all the frames where there is an animation going on. The strip keyframe can be moved, automatically moving the keyframes it refers to; in case the strip keyframe refers to keyframes at the same frame in several curves, all the keyframes will move along.
es: Con respecto a los fotogramas clave, en la banda se mostrará un fotograma clave por cada fotograma clave de cualquiera de las curvas visibles en el Editor de gráficas; una línea conectará estos fotogramas clave. Los claves de la banda podrán ser movidos, desplazando automáticamente a los claves de las curvas a los que estos representen; en caso de que un clave de la banda represente a varios claves en distintas curvas, todos ellos se moverán en conjunto.

source: With respect to interpolation, if all the visible curves have a key at the same specific frame, and the segment on the side of the key has the same **Ease In / Ease Out** value or the same **Speed In / Speed Out** horizontal component, a marker will be visible in the strip on the side of the strip keyframes. The marker shaped as an *opening square bracket* is for the segment to the right of the keyframe, the one shaped like a *closing square bracket* is for the segment on the left of the keyframe. The markers can be moved, automatically changing the **Ease In / Ease Out** or the **Speed In / Speed Out** values of all the segments they refer to.
es: Con respecto a la interpolación, si todas las curvas visibles contuvieran un clave en el mismo fotograma, y el segmento tuviera el mismo valor de *Aceleración suave** o **Desaceleración suave** o el mismo componente horizontal de su interpolación **Bézier** en todas las curvas, se visualizarán en dicho segmento de la banda superior unos marcadores. El marcador con forma de *paréntesis recto de apertura* se usará para controlar la interpolación al inicio del segmento, mientras que el que tiene forma de *paréntesis recto de cierre* se usará para controlar la interpolación hacia el final del mismo. Será posible mover estos marcadores, cambiando automáticamente los valores de Aceleración/Desaceleración suave o de las tangentes Bézier, en los segmentos correspondientes.

source: **To set which curves have to be controlled:**
es: **Para definir qué curvas deberán ser controladas:**

source: Display the curves in the Graph Editor (see :ref:`Using the Graph Editor <using_function_curves>` ).
es: Mostrar las curvas en el Editor de gráficas (ver :ref:`Uso del Editor de curvas <using_function_curves>` ).

source: Ctrl-click (PC) or Cmd-click (Mac) the frame ruler where you want to add the keyframe: a keyframe will be added to all the visible curves.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) sobre la regla de tiempo donde se desee agregar un fotograma clave: un clave será agregado a todas las curvas visibles.

source: Click and drag the strip keyframe: all the keyframes it refers to will move along.
es: Hacer clic y arrastrar el clave de la banda superior: todos los fotogramas a los que éste se refiera se moverán junto con él.

source: **To control the speed of the interpolation:**
es: **Para controlar la velocidad de la interpolación:**

source: Move the markers visible on the sides of the strip keyframes.
es: Mover los marcadores con forma de paréntesis recto a los lados de los claves en la banda superior.

source: Example expressions
es: Expresiones de ejemplo
