Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_curves_and_numerical_columns.po
Languages: es

source: While typing the expression, if the syntax is recognized, a menu automatically opens suggesting you the possible terms: from the menu you can select the term both to display in a tooltip box its correct syntax, and to insert it in the expression.
es: Mientras se ingresa una expresión, si la sintaxis es reconocida emergerá un menú automáticamente, sugiriendo posibles términos: será posible seleccionar desde dicho menú términos, tanto para mostrar una descripción de su sintaxis, como para insertarlo en la expresión.

source: As soon as terms are recognized, different colors are used to highlight them: **operators and functions** are displayed in *dark blue*, **variables** in *light blue*, **constants** in *green*. When the expression is entered, any **syntax error** will be displayed in *red*.
es: Tan pronto como los términos son reconocidos, se utilizarán distintos colores para resaltarlos: los **operadores y funciones** serán mostrados en *azul oscuro*, las **variables** en *azul claro*, las **constantes** en *verde*. Cuando la expresión haya sido ingresada, cualquier **error de sintaxis** será mostrado en color *rojo*.

source: The **Unit** used for the function is displayed in a box next to the expression; in case the unit refers to a movement, the default unit can be changed, and the values will be automatically converted to the default one.
es: Las **Unidades** usadas en la expresión serán mostradas en un campo, bajo la misma; en caso de que la unidad se refiera a un movimiento, será posible cambiar la unidad predefinida y los valores serán automáticamente convertidos a la unidad predefinida.

source: Apart from the standard operators and functions, some variables and predefined functions can also be used in expressions.
es: Además de los operadores y funciones estándar, también será posible usar algunas variables y funciones predefinidas, en las expresiones.

source: Supported terms are the following:
es: Los siguientes son los términos soportados:

source: **Operators**
es: **Operadores**

source: Addition, Subtraction, Multiplication, Division
es: Adición, Sustracción, Multiplicación, División

source: Modulus: ``10%6=4`` .
es: Módulo: ``10%6=4`` .

source: Exponentiation: ``a^2`` means ``a*a`` ; ``a^0.5`` is square root of ``a`` .
es: Exponenciación: ``a^2`` significa ``a*a`` ; ``a^0.5`` es la raíz cuadrada de ``a`` .

source: **Math Functions**
es: **Funciones matemáticas**

source: Angles are expressed in degrees.
es: Los ángulos se expresan en grados.

source: Hyperbolic functions.
es: Funciones hiperbólicas.

source: ``floor(value)``
es: ``floor(valor)``

source: The greatest whole number less or equal than ``value`` .
es: El mayor número entero menor o igual que ``valor`` .

source: ``ceiling(value)``
es: ``ceiling(valor)``

source: The smallest whole number less or equal than ``value`` .
es: El menor número entero menor o igual que ``valor`` .

source: ``round(value)``
es: ``round(valor)``

source: The integer closest to ``value`` .
es: El número entero más cercano al ``valor`` .

source: Absolute value: ``abs(a)`` is ``a`` without the sign.
es: Valor absoluto: ``abs(a)`` es ``a`` sin el signo.

source: ``sign(value)``
es: ``sign(valor)``

source: Returns 0 if ``value`` is 0; -1 if negative; 1 if positive.
es: Devuelve 0 si ``valor`` es 0; -1 si es negativo; 1 si es positivo.

source: ``sqrt(value)``
es: ``sqrt(valor)``

source: Returns square root of ``value`` .
es: Devuelve la raíz cuadrada de ``valor`` .

source: Returns argument with minimum value.
es: Devuelve el menor valor.

source: Returns argument with maximum value.
es: Devuelve el mayor valor.

source: ``clamp(value,min,max)``
es: ``clamp(valor,mín,máx)``

source: Returns ``min`` if ``value`` is less than ``min`` ; ``max`` if ``value`` is greater than ``max`` ; otherwise it returns ``value`` .
es: Devuelve ``mín`` si ``valor`` es menor que el ``mín`` ; ``máx`` si ``valor`` es mayor que el ``máx`` ; en otros casos devuelve el propio ``valor`` .

source: ``crop(value,min,max)``
es: ``crop(valor,mín,máx)``

source: ``step(value,min)``
es: ``step(valor,mín)``

source: Returns 0 if ``value`` is less than ``min`` , otherwise it returns 1.
es: Devuelve 0 si ``valor`` es menor que el ``mín`` , en otros casos devuelve 1.

source: ``smoothstep(value,min,max)``
es: ``smoothstep(valor,mín,máx)``

source: Returns 0 if ``value`` is less than ``min`` , 1 if ``value`` is greater than or equal to ``max`` , and perform a smooth interpolation between 0 and 1 in interval ``min`` to ``max`` .
es: Devuelve 0 si ``valor`` es menor que el ``mín`` , 1 si ``valor`` es mayor o igual que el ``máx`` , y realizará una interpolación suave entre 0 y 1 para el intervalo entre el ``mín`` y el ``máx`` .

source: **Logical Operators**
es: **Operadores lógicos**

source: Less
es: Menor.

source: Less or equal.
es: Menor o igual.

source: More
es: Mayor.

source: More or equal.
es: Mayor o igual.

source: Equal.
es: Igual.

source: Not equal.
es: Distinto.

source: **Boolean Operators**
es: **Operadores booleanos**

source: And.
es: Y

source: Or.
es: O

source: Not.
es: NO

source: **Conditional Expression**
es: **Expresión condicional**

source: ``(logical_expression)?value1:value2``
es: ``(expresión_lógica)?valor1:valor2``

source: If ``logical_expression`` is true, it returns ``value1`` , otherwise it returns ``value2`` .
es: Si la ``expresión_lógica`` es verdadera, devuelve el ``valor1`` , de otro modo devuelve el ``valor2`` .

source: Ranges from 0.0 to 1.0 along the transition allowing position/lenght-independent transitions.
es: Va entre 0.0 y 1.0 a lo largo de la transición, permitiendo obtener transiciones que sean independientes de la posición/longitud.

source: The current frame number.
es: El número del fotograma actual.

source: It is relative to the transition.
es: Fotograma relativo a la transición.

source: **Constants**
es: **Constantes**

source: numeric constant
es: constante numérica

source: E.g. 1, 2, 4.3.
es: P.ej: 1, 2, 4.3.

source: **Predefined Functions**
es: **Funciones predefinidas**

source: ``cycle(period)``
es: ``cycle(período)``

source: Cycles the transition of the ``period`` previous frames.
es: Repite la transición de los ``período`` fotogramas anteriores.

source: ``pulse(pos)`` , ``pulse(pos,length)``
es: ``pulse(pos)`` , ``pulse(pos,longitud)``

source: Generates a pulse ranging from 0.0 to 1.0 set at position ``pos`` , with a different breadth depending on the ``length`` of the pulse itself.
es: Genera un pulso entre 0.0 y 1.0 en la posición ``pos`` , con una amplitud distinta dependiente de la ``longitud`` del pulso en sí misma.

source: ``bump(pos)`` , ``bump(pos,length)``
es: ``bump(pos)`` , ``bump(pos,longitud)``

source: Generates a bump ranging from 0.0 to 1.0 set at position ``pos`` , with a different breadth depending on the ``length`` of the bump itself.
es: Genera un salto entre 0.0 y 1.0 en la posición ``pos`` , con una amplitud distinta dependiente de la ``longitud`` del salto en sí misma.

source: Generates random sequences between 0.0 and 1.0.
es: Genera una secuencia aleatoria entre 0.0 y 1.0.

source: ``random(max)``
es: ``random(máx)``

source: Generates a random number between 0.0 and ``max`` .
es: Genera una secuencia aleatoria entre 0.0 y ``máx`` .

source: ``random(min,max)``
es: ``random(mín,máx)``

source: Generates a random number between ``min`` and ``max`` .
es: Genera una secuencia aleatoria entre ``mín`` y ``máx`` .

source: ``random_s(seed)``
es: ``random_s(semilla)``

source: Works like random, but allows the user to specify the ``seed`` to modify the value of the ``random`` function.
es: Funciona de forma similar a random, pero permite especificar una ``semilla`` para modificar el valor de la función ``random`` .

source: ``random_s(seed,max)``
es: ``random_s(semilla,máx)``

source: Like above, with ``max`` as the maximum value of the transition.
es: Igual que la de arriba, con el valor ``máx`` como máximo de la transición.

source: ``random_s(seed,min,max)``
es: ``random_s(semilla,mín,máx)``

source: Like above, with ``min`` and ``max`` as the minimum and maximum values of the transition.
es: Igual que la de arriba, con los valores ``míx`` y ``máx`` como mínimo y máximo de la transición.

source: ``saw(length)`` , ``saw(length,height)``
es: ``saw(longitud)`` , ``saw(longitud,amplitud)``

source: Generates a periodic sawtooth shaped curve according to the ``length`` and ``height`` values; if ``height`` is not expressed it is assumed to be equal to ``length`` .
es: Genera una curva periódica con forma de diente de sierra, de acuerdo a los valores ``longitud`` y ``amplitud`` ; si ``amplitud`` no estuviera especificada se asumirá como igual a la ``longitud`` .

source: ``sawtooth(length)`` , ``sawtooth(length,height)``
es: ``sawtooth(longitud)`` , ``sawtooth(longitud,amplitud)``

source: ``wave(length)``
es: ``wave(longitud)``

source: The same as ``sin(f*2*pi/length)`` .
es: Equivalente a ``sin(f*2*pi/longitud)`` .

source: The predefined function ``saw`` , ``wave`` and ``pulse`` use implicitly a variable independent from the frame number. You can provide explicitly a variable using the form: ``fun (var; argument...)`` .
es: Las funciones predefinidas ``saw`` , ``wave`` y ``pulse`` usan de forma implícita una variable independiente del número de fotograma. Es posible proveer una variable de forma explícita, usando la forma: ``función(variable; argumento...)`` .

source: **To set an interpolation based on an Expression:**
es: **Para definir una interpolación basada en una Expresión:**

source: Choose **Expression** from the dropdown menu available in the Interpolation area of the Function Editor and click the **Apply** button.
es: Elegir **Expresión** en el menú de opciones en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Right-click the curve segment you want to set the transformation for, and choose **Expression Interpolation** from the menu that opens.
es: Hacer clic derecho sobre el segmento de curva para el que se desee definir la interpolación y elegir **Interpolación mediante expresión** en el menú.

source: **To set the expression:**
es: **Para definir la expresión:**

source: Type the expression in the Interpolation area of the Function Editor. As you type, if the syntax is recognized, a menu automatically opens suggesting you the possible terms.
es: Ingresar la expresión en el área de Interpolación del Editor de funciones. A medida que se ingresa el texto, si la sintaxis es reconocida, aparecerá un menú automáticamente con sugerencias de posibles términos.

source: Press **Enter** to submit the expression and check its syntax.
es: Presionar **Intro** para aceptar la expresión y comprobar su sintaxis.

source: If the expression refers to a movement, change the unit if needed.
es: Si la expresión se refiriera a un movimiento, será posible cambiar las unidades, si fuera necesario.

source: Press the **Apply** button to apply the desired change.
es: Presionar el botón **Aplicar** para aplicar el cambio deseado.

source: **To select a suggested term:**
es: **Para seleccionar uno de los términos sugeridos:**

source: Use the **Up Arrow** and **Down Arrow** keys to select the term in the menu that opens, then press **Enter**.
es: Usar las teclas de **flecha arriba** y **flecha abajo** para seleccionar el término en el menú emergente, luego presionar **Intro** para aceptar.

source: Click the term in the menu that opens.
es: Hacer clic sobre el término en el menú emergente.

source: When selecting a term with the Arrow keys a tooltip box displays the term correct syntax.
es: Al seleccionar un término usando las teclas de flechas, aparecerá una descripción indicando la sintaxis correcta del término.

source: Using Transformation References
es: Uso de referencias a transformaciones

source: It is possible to use in expressions references to any *object*, *effect* or *Plastic vertex* transformation. In this way, expressions can be used to create relationships between different transformations belonging to different items that can be of any of the aforementioned types.
es: Es posible usar en las expresiones referencias a las transformaciones de cualquier *objeto*, *efecto* o *vértice de la herramienta Plástico*. De esta forma, será posible usar expresiones para crear relaciones entre las distintas transformaciones pertenecientes a varios elementos de los tipos antes mencionados.

source: The syntax to create a reference to an object transformation is the following:
es: La sintaxis para crear una referencia a la transformación de un objeto es la siguiente:

source: ``object.transformation`` or ``object.transformation(delta)``
es: ``objeto.transformación`` o ``objeto.transformación(delta)``

source: where ``object`` is the ID name of a *camera*, *column*, *pegbar* or the *table*, as can be read in the Stage and FX Schematic nodes' tooltips; ``transformation`` can be any of its available transformations; and ``delta`` is the difference between the target frame and the current one.
es: donde ``objeto`` es el nombre identificatorio predefinido de una *cámara*, *columna*, *barra de sujeción* o la *mesa*, tal como se pueda apreciar en la descripción de los nodos del Diagrama de escenario o de efectos; ``transformación`` puede ser cualquiera de las transformaciones disponibles, y ``delta`` es la diferencia entre el fotograma que se desee referenciar y el actual.

source: For example ``camera1.y`` refers to the Y position of the Camera1. Whereas ``camera1.y(f-5)`` refers to the Y position of the Camera1, 5 frames before the current frame.
es: Por ejemplo: ``camera1.y`` se refiere a la posición Y de la cámara 1 (cualquiera sea el nombre personalizado que se le hubiera asignado a ésta en la escena). Mientras que ``camera1.y(f-5)`` se refiere a la posición Y de la cámara 1, 5 fotogramas antes del fotograma actual.

source: **Objects**
es: **Objetos**

source: Refer to the camera ``n`` .
es: Se refiere a la cámara ``n`` .

source: Refers to the column ``n`` .
es: Se refiere a la columna ``n`` .

source: Refer to the pegbar ``n`` .
es: Se refiere a la barra de sujeción ``n`` .

source: Refer to the table.
es: Se refiere a la mesa.

source: **Transformations**
es: **Transformaciones**

source: Refer to the horizontal and vertical position.
es: Se refiere a la posición horizontal y vertical.

source: Refer to the position along the motion path.
es: Se refiere a la posición a lo largo de la trayectoria de movimiento.

source: Refers to the rotation around the z axis.
es: Se refiere a la rotación en torno al eje Z.

source: Refer to the global, horizontal and vertical scaling.
es: Se refiere a la escala global, horizontal y vertical.

source: Refer to the horizontal and vertical shear.
es: Se refiere a la inclinación horizontal y vertical.

source: Refers to the position along the z axis.
es: Se refiere a la posición a lo largo del eje Z.

source: The syntax to create a reference to an effect parameter is the following:
es: La sintaxis para crear una referencia al parámetro de un efecto es la siguiente:

source: ``fx.name.parameter`` or ``fx.name.parameter(delta)``
es: ``fx.nombre.parámetro`` o ``fx.nombre.parámetro(delta)``

source: where ``name`` is the ID name of an *effect*, as can be read in the FX Schematic nodes' tooltips, ``parameter`` is any of the available effect parameters, and ``delta`` is the difference between the target frame and the current one.
es: donde ``nombre`` es el nombre es el nombre identificatorio predefinido de un *efecto*, tal como se pueda apreciar en la descripción de los nodos del Diagrama de efectos; ``parámetro`` es cualquiera de los parámetros disponibles en tal efecto; y ``delta`` es la diferencia entre el fotograma que se desee referenciar y el actual.

source: When an effect parameter has multiple sub-parameters, for example the Center parameter has X and Y sub-parameters, the syntax has to be the following:
es: Cuando un parámetro de un efecto contenga varios sub-parámetros, por ejemplo el parámetro Center contiene los parámetros X e Y, la sintaxis deberá ser la siguiente:

source: ``fx.name.parameter.subparameter`` or ``fx.name.parameter.subparameter(delta)``
es: ``fx.nombre.parámetro.sub-parámetro`` o ``fx.nombre.parámetro.sub-parámetro(delta)``

source: where ``name`` can be any used effect, ``parameter`` the main effect parameter, ``subparameter`` is the effect sub-parameter, and ``delta`` is the difference between the target frame and the current one.
es: donde ``nombre`` podrá ser el nombre predefinido de cualquier efecto que esté siendo usado, ``parámetro`` el nombre de uno de los parámetros del efecto, ``sub-parámetro`` es el nombre del sub-parámetro, y ``delta`` es la diferencia entre el fotograma que se desee referenciar y el actual.

source: For example ``fx.blur2.value`` refers to the Value parameter of the effect Blur2; ``fx.blur2.value(f-5)`` refers to the Value parameter of the effect Blur2, 5 frames before the current frame; and ``fx.raylit1.center.x`` refers to the X sub-parameter of the Center parameter of the effect Raylit1.
es: Por ejemplo ``fx.blur2.value`` se referirá al parámetro Value del efecto Blur2; ``fx.blur2.value(f-5)`` se referirá al parámetro Value del efecto Blur2, 5 fotogramas antes del fotograma actual; y ``fx.raylit1.center.x`` se referirá al sub-parámetro X del parámetro Center del efecto Raylit1.

source: If the effect parameter name consists of several words, they have to be typed in expressions *without* blank spaces.
es: Si el nombre del parámetro del efecto estuviera compuesto de varias palabras, en la expresión éste deberá ser escrito *sin los espacios* que separan a dichas palabras.

source: The syntax to create a reference to a Plastic vertex transformation is the following:
es: La sintaxis para crear una referencia a la transformación de uno de los vértices de la herramienta Plástico es la siguiente:

source: ``vertex(column_number, "vertex_name").transformation`` or ``vertex(column_number, "vertex_name").transformation(delta)``
es: ``vertex(número_de_columna, "nombre_del_vértice").transformación`` o ``vertex(número_de_columna, "nombre_del_vértice").transformación(delta)``

source: where ``column_number`` is the ID number of the *column* in which the referenced vertex exist, ``vertex_name`` is the exact name of the referenced Plastic vertex, ``transformation`` is any of the available vertex transformations (see below), and ``delta`` is the difference between the target frame and the current one.
es: donde ``número_de_columna`` es el número identificatorio de la *columna* en donde se encuentre el vértice a ser referenciado, ``nombre_del_vértice`` es el nombre exacto del vértice de la herramienta Plástico a ser referenciado, ``transformación`` es cualquiera de las transformaciones de vértices disponibles (ver abajo), y ``delta`` es la diferencia entre el fotograma que se desee referenciar y el actual.

source: **Plastic Vertex Transformations**
es: **Transformaciones de vértice de plástico**

source: Refers to the angle between the vertex and its parent.
es: Se refiere al ángulo entre el vértice y su superior.

source: Refers to the distance between the vertex and its parent.
es: Se refiere a la distancia entre el vértice y su superior.

source: Refers to the vertex sorting order.
es: Se refiere al orden de composición del vértice.

source: See :ref:`Use Mathematical Expression in Plastic Animation <use_mathematical_expression_in_plastic_animation>` for further details on animating a Plastic mesh using expressions.
es: Ver :ref:`Uso de Expresiones matemáticas en animaciones que usan Plástico <use_mathematical_expression_in_plastic_animation>` para obtener más detalles acerca de cómo animar una malla creada con la herramienta Plástico usando expresiones.

source: Using Interpolations Based on File Data
es: Uso de interpolación basada en datos de un Archivo

source: When an interpolation is based on File data, the segment values are retrieved from the contents of a file. In this case the keyframes at both ends of the segment may change as well, according to the file data.
es: Cuando la interpolación esté basada en datos de un Archivo, los valores del segmento de curva serán obtenidos del contenido de un archivo externo. En este caso, es posible que los fotogramas de ambos extremos del segmento también cambien, de acuerdo con los datos del archivo.

source: The file can be created by an external device or other applications, such as motion-control cameras or 3D software; supported file formats are BAT, DAT, RTF and TXT.
es: El archivo puede ser creado por un dispositivo externo o mediante otras aplicaciones, tales como cámaras de control de movimiento o programas de animación 3D; los formatos de archivo soportados son BAT, DAT, RTF y TXT.

source: The value for each frame is taken from the file content, that must consist of a series of numbers listed in several lines.
es: El valor para cada fotograma será tomado del contenido del archivo, que deberá consistir de una serie de números listados en varias líneas.

source: In case the file contains several values in each line, it is possible to define which value in each line has to be used by specifying a column number. For example, if you have a file like this:
es: En caso de que el archivo contuviera varios valores por cada línea, será posible definir cuál de esos valores deberá ser usado, especificando un número de **Columna:**. Por ejemplo, si se tuviera un archivo como el siguiente:

source: the value 2 will cause 200, 201, 202 to be loaded.
es: el valor 2 causará que se carguen los valores 200, 201, 202.

source: The unit used for the data is displayed in a box next to the file path; in case the unit refers to a movement, the default unit can be changed, and the values will be automatically converted to the default one.
es: Las **Unidades:** usadas para los datos serán mostradas en un campo, abajo de la ruta del archivo; en caso que las unidades se refieran a un movimiento, se podrá cambiar la unidad predefinida y los valores serán automáticamente convertidos a la unidad predefinida.

source: **To set an interpolation based on File data:**
es: **Para definir una interpolación basada en datos de un Archivo:**

source: Choose **File** from the option menu available in the Interpolation area of the Function Editor and click the **Apply** button.
es: Elegir **Archivo** en el menú de opciones en el área de Interpolación del Editor de funciones y hacer clic en el botón **Aplicar**.

source: Right-click the curve segment you want to set the transformation for, and choose **File Interpolation** from the menu that opens.
es: Hacer clic derecho sobre el segmento de curva para el que se desee definir la interpolación y elegir **Interpolación mediante archivo** en el menú.

source: **To set the File information:**
es: **Para definir la información del Archivo:**

source: Type in the **File Path** field, or use the browser button, to set the path to the data file.
es: Ingresar la **Ruta:** del archivo en el campo correspondiente o usar el botón de Explorador para definir el archivo a ser usado.

source: Specify which value in each line has to be used by specifying the **Column** number.
es: Definir cuál valor de cada línea deberá ser usado, especificando el número de **Columna:**.

source: If the File data refers to a movement, change the unit if needed.
es: Si los datos del Archivo se refirieran a un movimiento, se podrán cambiar las **Unidades:**, si fuera necesario.
