Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_curves_and_numerical_columns.po
Languages: es

source: Editing Using Spreadsheet and Curves
es: Edición usando la planilla de tiempos y curvas

source: Changes in Object transformations and effects parameters are shown in the **Function Editor** window, where keyframes and their related interpolations can be controlled and modified by using a *Spreadsheet* of numerical columns or a *Graph Editor*.
es: Es posible ver los cambios en las transformaciones y los efectos de los objetos en el panel **Editor de funciones**, donde es posible controlar y modificar los fotogramas clave y sus correspondientes interpolaciones usando una *Planilla de tiempos* con columnas numéricas o un *Editor de gráficas*.

source: The **Spreadsheet** displays changes in columns where each column represents a single animatable parameter and each row shows the value of a parameter at each frame.
es: La **Planilla de tiempos** muestra los cambios en forma de columnas, donde cada una de ellas representa a un parámetro animable y cada fila representa a un fotograma distinto, en donde se pueden ver los valores de los distintos parámetros animados.

source: Blank cells represent the absence of a change in a parameters value due to no keyframes being defined.
es: Las celdas en blanco representan la ausencia de cambio en el valor de un parámetro, debido a la no existencia de fotogramas clave definidos para el mismo.

source: The **Graph Editor** displays changes as curves in a graph, where frames are laid horizontally and values are laid vertically.
es: El **Editor de gráficas** muestra los cambios en los parámetros en forma de curvas, donde los fotogramas se disponen en forma horizontal y los valores en forma vertical.

source: Keyframes are represented as points and the interpolated values between them are visualized as red lines.
es: Los fotogramas clave son representados como puntos y los valores interpolados entre ellos se visualizan como líneas rojas.

source: The spreadsheet's columns and the graph editor's curves are different representations of the same data, so any changes made in one view are also reflected in the other.
es: Las columnas de la planilla de tiempos y las curvas del editor de curvas son representaciones distintas de los mismos datos, de forma que los cambios realizados en una podrán habitualmente ser apreciados en la otra.

source: Using the Function Editor
es: Uso del Editor de funciones

source: The function editor window is divided into three sections. On the left there is an area where the Spreadsheet or Graph Editor is displayed, on the right top is an area where the interpolation of the current transformation segment is displayed, and on the right bottom is the objects/effects tree.
es: El panel del Editor de funciones se encuentra dividido en tres secciones. A la izquierda se muestra la Planilla de tiempos o el Editor de gráficas, en la esquina superior derecha hay un área donde se muestran los datos de Interpolación del segmento actual de la transformación actual y sobre la esquina inferior derecha se encuentra el árbol de objetos/efectos.

source: The tree has two main item folders, *Stage* and *FX*: in the first you can find folders for the defined cameras, the table, used pegbars and columns; in the second one you can find folders for each used effect. Each folder contains the related transformation parameters.
es: El árbol contiene dos carpetas principales: **Escenario** y **Efectos**. En la primera es posible encontrar carpetas para las columnas/capas, barras de sujeción, cámaras y mesa; en la segunda será posible encontrar carpetas para cada efecto utilizado en la escena. Cada carpeta contendrá los parámetros de las transformaciones correspondientes.

source: The objects/effects tree tells if the object/effect is animated and which parameter is animated, by using the following icons:
es: El árbol de objetos/efectos permite determinar si un objeto o efecto se encuentra animado y saber cuál de sus parámetros contiene fotogramas clave, usando los siguientes íconos:

source: A plain folder is for non-animated objects/effects.
es: Una carpeta simple indicará un objeto/efecto que no ha sido animado.

source: A folder with an arrow is for animated objects/effects.
es: Una carpeta con una flecha indicará un objeto/efecto que ha sido animado.

source: An icon with a dotted straight line is for non-animated parameters.
es: Un ícono con una línea punteada indicará un parámetro que no ha sido animado.

source: An icon with a continuos curve is for animated parameters.
es: Un ícono con una curva continua indicará un parámetro que ha sido animado.

source: Clicking these icons allows you to select which object/effect and which parameters have to be displayed as a spreadsheet or curves in the area on the left.
es: Es posible seleccionar qué objeto/efecto y qué parámetros deberán ser visualizados en la planilla de tiempos o el editor de gráficas, haciendo clic sobre estos íconos.

source: Transformation data can be saved and loaded as a CURVE file, to allow the exporting and importing from one scene to another, and they can be exported as well as a DAT file in order to be used in other software.
es: Los datos de transformación podrán ser guardados y cargados como un archivo CURVE, para permitir la exportación y exportación de una escena a otra , asimismo podrán ser exportados en formato DAT para ser utilizados por otros programas.

source: **To resize the Function Editor sections:**
es: **Para cambiar el tamaño de las secciones del Editor de funciones:**

source: Do any of the following:
es: Realizar alguna de las siguientes acciones:

source: Click and drag the separators to resize sections.
es: Hacer clic y arrastrar los separadores para redimensionar las secciones.

source: Click and drag a separator toward the window border to hide a section.
es: Hacer clic y arrastrar un separador hacia el borde del panel para ocultar una sección.

source: Click and drag the separator collapsed to the window border toward the window center to display again the hidden section.
es: Hacer clic y arrastrar el separador oculto hacia el centro del panel para volver a mostrar una sección.

source: **To display or hide column parameters:**
es: **Para mostrar u ocultar parámetros de un objeto o efecto:**

source: Retrieve the object or the effect in the objects/effect tree.
es: Ubicar el objeto o el efecto en el árbol de objetos/efectos.

source: Do one of the following:
es: Realizar una de las siguientes acciones:

source: Click the folder to display or hide all columns or curves related to its parameters.
es: Hacer clic sobre la carpeta para mostrar u ocultar todas las columnas o curvas correspondientes a los parámetros del mismo.

source: Click the parameter icon to display or hide its related column or curve.
es: Hacer clic sobre el ícono un parámetro, para mostrar sus valores en una columna o curva.

source: Click a parameter icon and drag to display or hide all the columns or curves you pass upon.
es: Hacer clic sobre el ícono de un parámetro y arrastrar, para mostrar u ocultar los valores de todos los parámetros sobre los cuales se pase en columnas o curvas.

source: Right-click the folder and choose **Show Animated Only** from the menu that opens to display or hide only the animated columns or curves related to its parameters.
es: Hacer clic derecho sobre una carpeta y elegir **Mostrar sólo lo animado** en el menú, para mostrar sólo los parámetros que contengan fotogramas clave, tanto en las columnas como en la gráfica.

source: Right-click the folder and choose **Show All** from the menu that opens to display or hide all columns or curves related to its parameters.
es: Hacer clic derecho sobre una carpeta y elegir **Mostrar todos** en el menú, para mostrar todos los parámetros de esa carpeta en el árbol (dicha operación no afectará los parámetros visualizados en las columnas o la gráfica).

source: **To open the Graph Editor in a separate window:**
es: **Para abrir el Editor de gráficas en una ventana flotante:**

source: Make sure the option **Graph Editor Opens in Popup** is selected from the **Function Editor:** dropdown menu, in the Preferences... → Interface dialog section. (Restart OpenToonz).
es: Seleccionar **Editor de gráficas en una ventana** en la opción **Editor de funciones:**, del diálogo Archivo → Preferencias... → Interfaz. (Reiniciar OpenToonz para que la opción entre en vigor).

source: Click the **Function Editor Toggle** button (|schematic|) in the top bar of the Function Editor.
es: Hacer clic en el botón **Abrir editor de curvas de función** (|schematic|) en la barra superior del Editor de funciones.

source: **To open the Spreadsheet in a separate window:**
es: **Para abrir la Planilla de tiempos en una ventana flotante:**

source: Make sure the option **Spreadsheet Opens in Popup** is selected from the **Function Editor:** dropdown menu, in the Preferences... → Interface dialog section. (Restart OpenToonz).
es: Seleccionar **Planilla de tiempos en una ventana** en la opción **Editor de funciones:**, del diálogo Archivo → Preferencias... → Interfaz. (Reiniciar OpenToonz para que la opción entre en vigor).

source: **To switch between Spreadsheet and Graph Editor in the Function Editor:**
es: **Para alternar entre la Planilla de tiempos y el Editor de gráficas en el Editor de funciones:**

source: Make sure the option **Toggle Between Graph Editor and Spreadsheet** is selected from the **Function Editor:** dropdown menu, in the Preferences... → Interface dialog section. (Restart OpenToonz).
es: Seleccionar **Alternar entre Planilla de tiempos y Editor de gráficas** en la opción **Editor de funciones:**, del diálogo Archivo → Preferencias... → Interfaz. (Reiniciar OpenToonz para que la opción entre en vigor).

source: **To scroll the Spreadsheet:**
es: **Para desplazar la Planilla de tiempos:**

source: Middle-click and drag to scroll in any direction.
es: Hacer clic central para arrastrar en cualquier dirección.

source: Use the mouse wheel to scroll up or down.
es: Usar la rueda del ratón para desplazar hacia arriba o abajo.

source: Use the scrolling bars to scroll only within the actual spreadsheet extent.
es: Usar las barras de desplazamiento para desplazar la planilla dentro del área que contenga datos.

source: Use the Up Arrow and Down Arrow keys to move one frame up or down.
es: Usar las teclas con flechas hacia arriba y abajo para desplazarse un fotograma hacia arriba o abajo.

source: Use the Page Up and Page Down keys to scroll the visible frames up or down.
es: Usar las teclas RePag y AvPag para desplazar los fotogramas visibles hacia arriba o abajo.

source: Use the Home and End keys to scroll up to the beginning or the end of the Xsheet/Timeline content.
es: Usar las teclas Inicio o Fin para desplazar la vista hasta el inicio o el fin del contenido de la Planilla/Línea de tiempo.

source: **To navigate the Graph Editor:**
es: **Para ajustar el Editor de gráficas:**

source: Use the mouse wheel, or the zoom shortcut keys (by default **+** and **-** keys) to zoom in and zoom out.
es: Usar la rueda del ratón o los atajos de la función zoom (de forma predefinida **+** y **-**) para acercar o alejar la vista.

source: Click in the horizontal ruler and drag up to zoom in horizontally, down to zoom out; click in the value vertical ruler and drag up to zoom in vertically, down to zoom out.
es: Hacer clic en la regla horizontal y arrastrar hacia la izquierda/derecha para ajustar el zoom; hacer clic en la regla vertical y arrastrar hacia arriba y arrastrar hacia la arriba/abajo para ajustar el zoom.

source: Middle-click and drag the graph area to scroll in any direction, the horizontal ruler to scroll horizontally, and the vertical ruler to scroll vertically.
es: Hacer clic central y arrastrar sobre el área de la gráfica para desplazarla en cualquier dirección, sobre la regla horizontal para desplazarla horizontalmente y sobre la regla vertical para desplazarla verticalmente.

source: Use the reset view shortcut (by default the **Alt + 0** key) or right-click the graph area and choose Fit from the menu that opens, to display all the visible curves in the current Function Curve Editor window.
es: Hacer clic derecho en el área de la gráfica y elegir **Ajustar a ventana** en el menú, para ajustar la vista para mostrar todas las curvas visibles en el Editor de gráficas.

source: **To save transformation data:**
es: **Para guardar los datos de una transformación:**

source: Right-click the relevant parameter in the objects/effects tree, and choose **Save Curve** from the menu that opens.
es: Hacer clic derecho en el parámetro deseado en el árbol de objetos/efectos y elegir **Guardar curva** en el menú.

source: Use the Browser to choose a name and location for the file to be saved: the data will be saved as a CURVE file.
es: Usar el Explorador para elegir una ubicación y nombre de archivo: los datos serán guardados como un archivo CURVE.

source: **To load transformation data:**
es: **Para cargar los datos de una transformación:**

source: Right-click the relevant parameter in the objects/effects tree, and choose **Load Curve** from the menu that opens.
es: Hacer clic derecho en el parámetro deseado en el árbol de objetos/efectos y elegir **Cargar curva** en el menú.

source: Use the Browser to retrieve the curve to load; valid files are in CURVE format.
es: Usar el Explorador para obtener el archivo a ser cargado; será posible cargar archivos en formato CURVE.

source: **To export transformation data:**
es: **Para exportar los datos de una transformación:**

source: Right-click the relevant parameter in the objects and effects tree, and choose **Export Data** from the menu that opens.
es: Hacer clic derecho en el parámetro deseado en el árbol de objetos/efectos y elegir **Exportar datos** en el menú.

source: Use the Browser to choose a name and location for the file to be saved: the data will be saved as a DAT file that can be used in other software supporting this type of information.
es: Usar el Explorador para elegir una ubicación y nombre de archivo: los datos serán guardados como un archivo DAT, que podrá ser usado en otros programas que soporten este tipo de información.

source: Defining keyframes
es: Definición de fotogramas clave

source: Keyframes, including those belonging to object transformations done by using the **Animate** tool (|animate|) and those defined for effects parameters in the **FX Settings** window, can be controlled and edited both using the Spreadsheet's numerical columns and the Graph Editor's curves (see :ref:`Animating Objects <animating_objects>` and :ref:`Editing FX Settings <editing_fx_settings>` ).
es: Es posible controlar y editar los fotogramas clave (incluyendo aquellos pertenecientes a las transformaciones de objetos realizadas mediante la herramienta **Animar** (|animate|) y los definidos para parámetros de efectos, en la ventana **Opciones de efecto**), tanto a través de las columnas de valores de la Planilla de tiempo, como de las curvas del Editor de gráficas (ver :ref:`Animación de objetos <animating_objects>` y :ref:`Edición de Opciones de efectos <editing_fx_settings>` ).

source: In the Spreadsheet, keyframes are displayed as orange cells; in the Graph Editor, keyframes are represented as control points along the curve. In both cases they can be added, edited, moved and deleted.
es: Es posible visualizar los fotogramas clave como celdas de color *naranja* en la Planilla de tiempos, o como puntos de control de las curvas en el Editor de gráficas. En ambos casos será posible agregar, editar, mover o borrarlos.

source: Using the Spreadsheet
es: Uso de la Planilla de tiempos

source: The Spreadsheet displays transformations in columns like the ones available in the Xsheet/Timeline, having one for each parameter. For each frame, the column's cells display the related transformation values.
es: La Planilla de tiempos muestra información dispuesta en columnas, como en la Planilla de exposición, pero presentando una columna por cada parámetro. En cada fotograma, las celdas de las columnas mostrarán el valor de la transformación correspondiente.

source: Keyframes are displayed in different-colored cells, and can be moved along the column to different frames positions. In-between values are automatically generated according to the keyframes and to the set interpolation (see :ref:`Setting Segment Interpolations <setting_segment_interpolations>` ).
es: Los fotogramas clave serán mostrados en celdas identificadas con colores y podrán ser movidas dentro de la columna hacia la posición de otros fotogramas. Los valores intermedios serán generados automáticamente de acuerdo a los fotogramas y al tipo de interpolación establecido (ver :ref:`Definición de la interpolación de segmentos <setting_segment_interpolations>` ).

source: All the columns referring to the same object or effects are grouped under one single header. For example under a pegbar header you can find all the columns referring to its transformations.
es: Todas las columnas que se refieran al mismo objeto o efecto aparecerán agrupadas bajo un mismo encabezado. Por ejemplo, bajo el encabezado de una barra de sujeción será posible encontrar todas las columnas correspondientes a sus transformaciones.

source: Columns cells can be used to type in directly values for keys, edit or move them. Values contained in cells can be cut, copied and pasted, so that transformations can be displaced, repeated and deleted.
es: Será posible ingresar valores para los fotogramas clave, directamente en las celdas de las columnas, así como editar o moverlas. Los valores contenidos en las celdas podrán ser cortados, copiados y pegados, de manera que las transformaciones podrán ser desplazadas, repetidas o borradas.

source: **To define keyframes directly in Spreadsheet columns:**
es: **Para definir fotogramas clave directamente en las columnas de la Planilla de tiempos:**

source: Double click in the column cell where you want to define a keyframe: the cell becomes editable.
es: Hacer doble clic en la celda de la columna donde se desee definir un fotograma: se ingresará en el modo de edición de la celda.

source: Type in the value for the key, and press **Enter** to confirm.
es: Ingresar el valor deseado para el clave y luego presionar **Intro** para confirmar.

source: **To move a keyframe:**
es: **Para mover un fotograma clave:**

source: Click the *vertical strip* at the left of a keyframe cell, and drag it up or down to the new position; the in-between values change accordingly.
es: Hacer clic sobre la *banda vertical* a la izquierda de la celda del fotograma clave y arrastrarla hacia arriba o abajo hasta la nueva posición; los valores intermedios cambiarán como sea necesario.

source: **To displace the channel along the column:**
es: **Para desplazar el canal a lo largo de la columna:**

source: Click the *vertical strip* at the left of the selected column cells, and drag it up or down to the new position: the content of the segments completely included in the selection will move along the column.
es: Hacer clic sobre la *banda vertical* a la izquierda de las celdas seleccionadas de la columna y arrastrar hacia arriba o abajo hasta la nueva posición: el contenido de los segmentos completamente incluidos en la selección se moverá a través de la columna.

source: **To copy/cut and paste column values:**
es: **Para copiar/cortar valores de una columna:**

source: Click and drag to perform a selection; the selection can be extended to several columns.
es: Hacer clic y arrastrar para realizar una selección; la selección podrá ser extendida a varias columnas.

source: Use the **Copy** command: the selection will be kept in memory for further operations.
es: Usar el comando **Copiar** para mantener en memoria la selección para operaciones futuras.

source: Use the **Cut** command: the selection will be removed from the columns and will be kept in memory for further operations. The cells removal causes the following cells to shift up.
es: Usar el comando **Cortar** para eliminar la selección de las columnas y mantenerla en memoria para operaciones futuras. La eliminación de celdas causará que las celdas siguientes sean desplazadas hacia arriba.

source: Use the **Paste** command: the selection kept in memory will be pasted starting from the selected insertion cell. The command causes the following cells to shift down.
es: Usar el comando **Pegar** para pegar la selección en memoria, insertándola a partir de la celda seleccionada. El comando causará que las celdas siguientes sean desplazadas hacia abajo.

source: Use the **Delete** command: selected cells will be deleted, causing the following cells to shift up.
es: Usar el comando **Borrar** para borrar las celdas seleccionadas, causando que las celdas siguientes sean desplazadas hacia arriba.

source: Using the Graph Editor
es: Uso del Editor de gráficas

source: The Graph Editor displays transformations as curves in a graph where *time* is laid horizontally, and parameter *values* are laid vertically.
es: El Editor de gráficas muestra información en forma de curvas en una gráfica, donde el *tiempo* se encuentra dispuesto horizontalmente, mientras que los *valores* de los parámetros están dispuestos verticalmente.

source: Curves are defined by control points representing keyframes. Points can be easily added by working directly in the graph or using the **Set Key** button (|key|) in the top bar of the **Function Editor**.
es: Las curvas son definidas mediante puntos de control, que representan a los fotogramas clave. Es posible agregar puntos directamente a la curva o mediante el uso del botón **Marcar fotograma clave** (|key|) en la parte superior de la barra del **Editor de funciones**.

source: Control points can also be selected in order to be edited, moved or deleted.
es: También será posible seleccionar los puntos de control para editar, mover o borrarlos.

source: The **Set Key** button (|key|) is either *grey* when no keyframe is defined for the current curve at the current frame, or *blue* when a keyframe is defined for the current curve at the current frame.
es: El botón **Marcar fotograma clave** (|key|) se mostrará en color *gris* cuando no haya un fotograma clave definido para la curva actual en el fotograma actual o en color *azul* cuando exista un fotograma clave definido para la curva actual en el fotograma actual.

source: Frames and keyframes can be navigated by using the related buttons in the top bar of the editor. The **Next Key** (|next_key|) and **Previous Key** buttons (|prevkey|) are available only if more than one keyframe is defined.
es: Será posible recorrer los fotogramas y claves usando los botones de la barra superior del editor. El botón **Clave siguiente** (|next_key|) y **Clave anterior** (|prevkey|) se encontrarán habilitados sólo en caso de que haya definidos más de un fotograma.

source: **To set the current curve:**
es: **Para definir la curva actual:**

source: Click the related parameter name in the objects/effects tree.
es: Hacer clic en el nombre del parámetro deseado en el árbol de objetos/efectos.

source: Display the curve in the Graph Editor, then click to select it.
es: En el Editor de gráficas, hacer clic para seleccionarla.

source: **To set the current frame:**
es: **Para definir el fotograma actual:**

source: Click in the frame horizontal ruler to set a position for the current frame marker.
es: Hacer clic en la regla horizontal de fotogramas para definir la posición del cursor de tiempo.

source: Click and drag the current frame marker in a horizontal direction.
es: Hacer clic y arrastrar el cursor de tiempo en dirección horizontal.
