Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/keyboard_shortcuts.po
Languages: es

source: Keyboard Shortcuts
es: Atajos de teclado

source: Configuring Shortcuts
es: Configuración de atajos

source: |configure_shortcuts_window|
es: |configure_shortcuts_window_es|

source: Predefined shortcuts are available for OpenToonz tools, modifiers and menu commands. They can be customized, and new shortcuts can be added for undefined items.
es: Existen atajos predefinidos de teclado disponibles para las herramientas, modificadores y comandos de menú de OpenToonz. Éstos pueden ser personalizados y nuevos atajos pueden ser creados para elementos no definidos.

source: Shortcuts are specific to each user, meaning that each user in the system can have a different set of shortcuts.
es: Los atajos son específicos para cada usuario, lo que significa que cada usuario del sistema puede tener su propio conjunto de atajos de teclado.

source: **To configure a shortcut:**
es: **Para configurar un atajo:**

source: Choose File → **Configure Shortcuts...**
es: Elegir Archivo → **Configurar atajos de teclado...**

source: Search for the command or tool you want to configure the shortcut for in the appropriate folder, or by using the Search field at the top of the window.
es: Buscar el comando o herramienta al que se desee configurar un atajo en la carpeta apropiada o usando el campo **Buscar:** en la parte superior de la ventana.

source: Select the command or tool name in the list.
es: Seleccionar el nombre del comando o herramienta de la lista.

source: Press the keyboard key, or combination of keys, you want to assign as shortcut.
es: Presionar la tecla, o combinación de teclas, que se desee asignar como atajo.

source: **To remove a configured shortcut:**
es: **Para eliminar un atajo previamente configurado:**

source: Click the Remove button.
es: Hacer clic en el botón **Eliminar**.

source: Predefined Keyboard Shortcuts
es: Atajos de teclado predefinidos

source: The following are **some** of the predefined shortcuts available in OpenToonz.
es: Los siguientes son **algunos** de los atajos de teclado predefinidos, disponibles en OpenToonz.

source: **Tools**
es: **Herramientas**

source: |animate| Animate
es: |animate| Animar

source: |selection| Selection
es: |selection| Seleccionar

source: |brush| Brush
es: |brush| Pincel

source: |geometric| Geometric
es: |geometric| Geometría

source: |type| Type
es: |type| Texto

source: |fill| Fill
es: |fill| Rellenar

source: |eraser| Eraser
es: |eraser| Borrador

source: |tape| Tape
es: |tape| Cinta

source: |style_picker| Style Picker
es: |style_picker| Selector de estilos

source: |RGB_picker| RGB Picker
es: |RGB_picker| Selector de color

source: |cpe| Control Point Editor
es: |cpe| Editar puntos de control

source: |pinch| Pinch
es: |pinch| Pellizcar

source: |skeleton| Skeleton
es: |skeleton| Esqueleto

source: |hook| Hook
es: |hook| Enganche

source: |plastic| Plastic
es: |plastic| Plástico

source: **Shift**
es: **Mayúsculas**

source: **Space**
es: **Espacio**

source: |rotate| Rotate
es: |rotate| Rotar

source: |hand| Hand
es: |hand| Desplazar

source: If you **press and hold** a tool keyboard shortcut, you perform a temporary tool selection: when you release the key you will return to the previously selected tool.
es: Al **presionar y mantener presionado** el atajo de teclado de una herramienta, se realiza una selección temporal de dicha herramienta: al soltar la tecla se regresará a la herramienta previamente seleccionada.

source: **Tool Modifiers**
es: **Opciones de herramientas**

source: Brush Size - Decrease max
es: Pincel - Tamaño máx. - disminuir

source: Brush Size - Increase max
es: Pincel - Tamaño máx. - aumentar

source: Brush Size - Decrease min
es: Pincel - Tamaño mín. - disminuir

source: Brush Size - Increase min
es: Pincel - Tamaño mín. - aumentar

source: Rectangular/Normal type
es: Tipo Rectangular/Normal

source: Frame Range
es: Rango de fotogramas

source: Selective
es: Selectivo

source: Segment
es: Rellenar - Segmento

source: **Visualization**
es: **Visualización**

source: Actual Pixel Size
es: Tamaño real de píxel

source: Fit to Window
es: Ajustar a ventana

source: **Alt/⌥ Option**
es: **Alt/⌥ Opción**

source: Reset View
es: Restablecer vista

source: Zoom in
es: Acercar

source: Zoom out
es: Alejar

source: Onion Skin Toggle
es: Piel de cebolla

source: Maximize Panel
es: Maximizar panel

source: Full Screen Mode
es: Modo a pantalla completa

source: Main Window Full Screen Mode
es: Ventana principal sin bordes

source: **Playback Controls**
es: **Controles de reproducción**

source: Play
es: Reproducir

source: Loop
es: Reproducir en ciclo

source: Previous Drawing
es: Dibujo anterior

source: Next Drawing
es: Dibujo siguiente

source: Previous Frame
es: Fotograma anterior

source: Next Frame
es: Fotograma siguiente

source: Previous Keyframe
es: Clave anterior

source: Next Keyframe
es: Clave siguiente

source: **File Menu**
es: **Menú Archivo**

source: New Scene
es: Nueva escena

source: Load Scene...
es: Cargar escena...

source: Save All
es: Guardar todo

source: Save Scene
es: Guardar escena

source: Preferences...
es: Preferencias...

source: Quit
es: Salir

source: **Edit Menu**
es: **Menú Editar**

source: Undo
es: Deshacer

source: Redo
es: Rehacer

source: Cut
es: Cortar

source: Copy
es: Copiar

source: Paste Insert
es: Pegar (insertar)

source: Paste Insert Above/After
es: Pegar (insertar arriba/después)

source: Delete
es: Borrar

source: Insert
es: Insertar

source: Insert Above/After
es: Insertar arriba/después

source: Select All
es: Seleccionar todo

source: Group
es: Agrupar

source: Ungroup
es: Desagrupar

source: Bring to Front
es: Traer al frente

source: Bring Forward
es: Traer hacia adelante

source: Send Backward
es: Enviar hacia atrás

source: Send to Back
es: Enviar al fondo

source: **Level Menu**
es: **Menú Nivel**

source: New Level...
es: Nuevo nivel...

source: **Xsheet Menu**
es: **Menú Planilla**

source: Set Key
es: Marcar fotograma clave

source: New FX...
es: Nuevo efecto...

source: Edit FX...
es: Editar efecto...

source: Apply Lip Sync Data to Column
es: Aplicar datos de sincro labial a columna

source: **Cells Menu**
es: **Menú Celdas**

source: Duplicate Drawing
es: Duplicar dibujo

source: Increase Step
es: Aumentar exposición

source: Decrease Step
es: Disminuir exposición

source: Drawing Substitution Backward
es: Sustituir dibujo por el anterior

source: Drawing Substitution Forward
es: Sustituir dibujo por el siguiente

source: Similar Drawing Substitution Backward
es: Sustituir dibujos contiguos por el anterior

source: Similar Drawing Substitution Forward
es: Sustituir dibujos contiguos por el siguiente

source: **Play Menu**
es: **Menú Reproducción**

source: First Frame
es: Fotograma inicial

source: Last Frame
es: Fotograma final

source: **Render Menu**
es: **Menú Procesamiento**

source: Preview
es: Previsualizar

source: Output Settings...
es: Opciones de salida...

source: Render
es: Procesar

source: Fast Render to MP4
es: Procesar rápido a MP4

source: **Windows Menu**
es: **Menú Ventanas**

source: History
es: Historia

source: Record Audio
es: Grabación de sonido

source: Startup Popup...
es: Diálogo inicial...

source: **Help Menu**
es: **Menú Ayuda**

source: Online Manual...
es: Manual en línea...
