Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/managing_projects.po
Languages: es

source: Managing Projects
es: Administración de proyectos

source: Projects are an easy way to manage scenes and files used in them. They allow you to organize your production material not only by defining default settings used throughout the production, but also default folders where files will be automatically saved, and from where they will be retrieved when needed. This means that, for example, as soon as you scan drawings, they will be saved automatically in the input default folders you specified for your project.
es: Los proyectos son una forma sencilla de administrar las escenas y los archivos usados en su creación. Permiten organizar el material de producción, no sólo mediante la definición de opciones predefinidas para usar a lo largo de la producción, sino también carpetas predefinidas donde los archivos se guardarán automáticamente y desde donde serán recuperados, cuando sea necesario. Esto significa que, por ejemplo, tan pronto como se hayan escaneado unos dibujos, éstos serán automáticamente guardados en la carpeta *inputs* predefinida para el proyecto.

source: The main advantage of managing the production through projects, is that a consistency of production settings and production material can be achieved.
es: La ventaja principal de administrar la producción mediante el uso de proyectos, es lograr más fácilmente una consistencia en las opciones y materiales de producción.

source: The consistency of production settings is achieved because all the scenes of a projects, as soon as they are created, inherit all the settings from the project (see :ref:`Setting Up a Scene <setting_up_a_scene>` ).
es: La consistencia en las opciones de producción es lograda porque todas las escenas de un mismo proyecto, tan pronto como son creadas, heredarán todas las opciones de dicho proyecto.

source: The right use of production material is achieved because once you have defined a production structure through projects, all the scenes are able to save and retrieve files by using the project default folders.
es: El uso correcto del material de producción es logrado porque una vez que se ha establecido una estructura de producción mediante el uso de proyectos, todas las escenas son capaces de guardar y recuperar archivos usando las carpetas predefinidas del proyecto activo.

source: Setting the Projectroot
es: Definición de la carpeta principal de proyectos

source: The projectroot is the folder where the project information and database are stored; it is displayed in the OpenToonz browser as one of the main folders with the related path in brackets.
es: La carpeta principal de proyectos es una carpeta donde se almacena la configuración y los datos de varios proyectos; se muestra en el Explorador de archivos de OpenToonz como una de las carpetas principales, con su ruta de acceso entre paréntesis.

source: The default value is ``C:\OpenToonz stuff\projects`` on Windows and ``/Applications/OpenToonz/OpenToonz stuff/projects`` on Macintosh.
es: Su ubicación predefinida es ``C:\OpenToonz stuff\projects`` en Windows y ``/Applications/OpenToonz/OpenToonz stuff/projects`` en macOS.

source: If your production has to be managed on more than one computer on a network, you can share the same project database on all the computers you want, by defining the same projectroot on each computer.
es: Si una producción tiene que ser administrada en más de una computadora en una misma red, es posible compartir los datos del proyecto a todas las computadoras, definiendo la misma carpeta principal de proyectos en cada una de ellas.

source: It is also possible to define more than one projectroot if needed: in this case projectroot folders will be visible in the OpenToonz browser, each with the related path in brackets.
es: También es posible definir más de una carpeta principal de proyectos si es necesario: en este caso las carpetas principales de proyectos serán visibles en el Explorador de OpenToonz, cada una con su ruta de acceso entre paréntesis.

source: |additional_project_locations|
es: |additional_project_locations_es|

source: The projectroot information can be changed at any moment, for instance if you need to move the project database files from one computer to another.
es: La información sobre la ubicación de las carpetas principales de proyectos puede ser cambiada en cualquier momento, por ejemplo si se necesitan mover los datos de un proyecto de una computadora a otra.

source: **To set the projectroot on Windows:**
es: **Para establecer la carpeta principal de proyectos en Windows:**

source: Open the Run application dialog by selecting Run from the Start menu.
es: Abrir el diálogo de la aplicación Ejecutar, seleccionando Ejecutar en el menú Inicio de Windows.

source: Type ``regedit`` in the text box and click OK. This will open the Registry Editor application.
es: Ingresar ``regedit`` en el campo de texto y hacer clic en Aceptar. Eso abrirá la aplicación Editor del Registro.

source: Navigate to the ``HKEY_LOCAL_MACHINE\SOFTWARE\OpenToonz\OpenToonz`` and double-click TOONZPROJECTS in the right part of the window: the Edit String dialog opens.
es: Navegar hasta ``HKEY_LOCAL_MACHINE\SOFTWARE\OpenToonz\OpenToonz`` y hacer doble clic en TOONZPROJECTS en la parte derecha de la ventana: se abrirá el diálogo Editar cadena.

source: Enter the new path for the projectroot.
es: Ingresar la nueva ruta para la carpeta principal de proyectos.

source: Click OK and exit from the Registry Editor application.
es: Hacer clic en Aceptar y salir del Editor del Registro.

source: Restart OpenToonz to make the change effective.
es: Reiniciar OpenToonz para hacer que los cambios entren en vigor.

source: **To add a projectroot on Windows:**
es: **Para agregar una carpeta principal de proyectos en Windows:**

source: Open the registry editor to edit the TOONZPROJECTS registry as described above.
es: Abrir el Editor del Registro para editar el registro TOONZPROJECTS como se describe arriba.

source: Enter the path for the new projectroot, separated by a semicolon (e.g. ``C:\production01;D:\production02`` ).
es: Ingresar la ruta para la nueva carpeta principal de proyectos, separada por un punto y coma (p.ej: ``C:\producción01;D:\producción02`` ).

source: **To set the projectroot on Macintosh:**
es: **Para establecer la carpeta principal de proyectos en macOS:**

source: Right-click the OpenToonz icon in the ``Applications/OpenToonz`` folder, and choose Show Package Contents from the menu that opens.
es: Hacer clic derecho sobre el ícono de OpenToonz en la carpeta ``Applications/OpenToonz``, y elegir Mostrar Contenido del Paquete en el menú.

source: In the folder that opens browse to the ``Contents/Resources`` folder and open the ``SystemVar.ini`` file with a text editor application, such as TextEdit.
es: En la carpeta que se abre navegar hasta la carpeta ``Contents/Resources`` y abrir el archivo ``SystemVar.ini`` con un editor de texto, como TextEdit.

source: 3. Look for the following line where the projectroot is defined: ``TOONZPROJECTS=”/Applications/OpenToonz/OpenToonz stuff/projects”``
es: 3. Buscar la siguiente línea donde se define la carpeta principal de proyectos: ``TOONZPROJECTS=”/Applications/OpenToonz/OpenToonz stuff/projects”``

source: Change the path in inverted commas by typing a new one.
es: Cambiar la ruta enmarcada por comas invertidas, escribiendo una nueva.

source: Save the ``SystemVar.ini`` file.
es: Guardar el archivo ``SystemVar.ini`` .

source: **To add a projectroot on Macintosh:**
es: **Para agregar una carpeta principal de proyectos en macOS:**

source: Open the configuration file to edit the TOONZPROJECTS variable as described above.
es: Abrir el archivo de configuración para editar la variable TOONZPROJECTS, tal como se describe arriba.

source: Change the path in inverted commas by adding a new path for the new projectroot, separated by a semicolon (e.g. ``/Applications/OpenToonz/OpenToonz stuff/production01`` ``;`` ``/Applications/OpenToonz/OpenToonz stuff/production02`` ).
es: Cambiar la ruta enmarcado por comas invertidas agregando una ruta para la nueva carpeta principal de proyectos, separada por un punto y coma (p.ej: ``/Applications/OpenToonz/OpenToonz stuff/producción01`` ``;`` ``/Applications/OpenToonz/OpenToonz stuff/producción02`` ).

source: Setting up Projects
es: Creación de proyectos

source: |new_project|
es: |new_project_es|

source: When you define a new project you can specify its default folders, while its default settings will be inherited from the current project. Default folders and settings can be modified at any time to satisfy new production needs.
es: Cuando se crea un nuevo proyecto es posible especificar las carpetas predefinidas, mientras que las opciones predefinidas se heredarán del proyecto actual. Las carpetas y opciones predefinidas pueden ser modificadas en cualquier momento para satisfacer las necesidades de la producción.

source: Project information is stored in an XML file named as the project with the ``_otprj`` suffix, in a folder named as the project located in the projectroot (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
es: La información del proyecto es almacenada en un archivo XML con el mismo nombre del proyecto más el sufijo ``_otprj`` , en una carpeta con el nombre del proyecto, ubicada en la carpeta principal de proyectos elegida (ver :ref:`Definición de la carpeta principal de proyectos <setting_the_projectroot>` ).

source: Projects can be organized in folders and can contain sub-projects that can be browsed in the OpenToonz file browser. This allows you to customize the project structures in order to follow your production needs, for instance creating a folder for each episode, then a project for each scene belonging to that episode. As the project browser will display the project tree and all the folders contained in the projectroot, you can also organize your folder structure in the projectroot by using the OS file system.
es: Los proyectos pueden ser organizados en carpetas y pueden contener subproyectos que pueden ser explorados con el Explorador de archivos de OpenToonz. Esto permite personalizar las estructuras de los proyectos, de manera de adaptarlas a las necesidades de producción, por ejemplo creando una carpeta por cada episodio de una serie y luego un proyecto por cada escena perteneciente a ese episodio. Como el explorador de proyectos mostrará el árbol del proyecto y todas las carpetas contenidas en la carpeta principal de proyectos, también es posible organizar la estructura de carpetas de la carpeta principal usando las herramientas del sistema operativo.

source: There is always one current project selected in the project browser: when you start working on a scene, automatically it will belong to the current project, inheriting its settings and default folders.
es: Existirá siempre un proyecto activo, seleccionado en el explorador de proyectos: al comenzar a trabajar en una nueva escena, ésta pertenecerá automáticamente al proyecto actual, heredando sus configuraciones y carpetas predefinidas.

source: If you want a new scene to be part of a new project, first you have to define a new project. If you want it to be part of a previously created project, first you have to set that project as the current one.
es: Si se desea crear una nueva escena y que pertenezca a un nuevo proyecto, primero es necesario crear el nuevo proyecto. Si, en cambio, se desea que la nueva escena sea parte de un proyecto ya existente, primero es necesario establecer ese proyecto como proyecto activo.

source: If you want to use the farm for rendering scenes, all the server (rendering) nodes of the farm have to share the same projectroot (see :ref:`Installing the Toonz Farm on Windows <installing_the_toonz_farm_on_windows>` ) and all the drives containing the projects database, have to be shared on the network.
es: Si se desea usar la granja para procesar escenas, todos los nodos servidores (de procesamiento) de la granja deberán compartir la misma carpeta principal de proyectos (ver :ref:`Instalación de Toonz Farm en Windows <installing_the_toonz_farm_on_windows>` ) y todos los discos que contengan datos del proyecto deberán estar compartidos en la red.

source: **To create a new project:**
es: **Para crear un nuevo proyecto:**

source: Choose File → Project Management → New Project...
es: Elegir Archivo → Administración de proyectos → Nuevo proyecto...

source: Select the projectroot or repository (see :ref:`Configuring the Version Control in OpenToonz <configuring_the_version_control_in_toonz>` ), and the project or folder where you want to create the new project.
es: Seleccionar la carpeta principal de proyectos o el repositorio (ver :ref:`Configuración del control de versiones en OpenToonz <configuring_the_version_control_in_toonz>` ) y el proyecto o la carpeta donde se desea crear el nuevo proyecto.

source: Type the name of the project and set the path to the folders you want to use as default.
es: Ingresar el nombre del proyecto y definir la ruta a las carpetas que se desee usar como predefinidas.

source: Click the **OK** button.
es: Hacer clic en el botón **Aceptar**.

source: **To change the current project:**
es: **Para cambiar el proyecto actual:**

source: Click the small round button on the left of the project name in the project tree available in the OpenToonz file browser. It becomes red when selected.
es: Hacer clic en el botón circular a la izquierda del nombre del proyecto en el panel izquierdo del Explorador de archivos de OpenToonz. Éste se tornará rojo al encontrarse activo.

source: **To add a scene to a project:**
es: **Para agregar una escena a un proyecto:**

source: Set the project as the current one.
es: Definir el proyecto como activo.

source: Choose File → New Scene.
es: Elegir Archivo → **Nueva escena**.

source: **To change project default folders:**
es: **Para cambiar las carpetas predefinidas de un proyecto:**

source: Select File → Project Management → Project Settings... and change default folders paths.
es: Seleccionar Archivo → Administración de proyectos → **Opciones del proyecto...** y cambiar las rutas de las carpetas predefinidas.

source: When changing default folders, scenes previously created in the same project may fail retrieving used files.
es: Al cambiar las carpetas predefinidas, es posible que las escenas creadas con anterioridad dentro del mismo proyecto no puedan leer algunos de los archivos usados.

source: Project Default Folders
es: Carpetas predefinidas de un proyecto

source: Projects have default folders where scanned drawings, painted drawings, scenes, rendered frames and palettes are automatically saved. These folders are shared by all of the scenes created for that particular project, and are labelled in the following way:
es: Los proyectos tienen carpetas predefinidas donde almacenar automáticamente dibujos escaneados, dibujos pintados, paletas, escenas y fotogramas ya procesados. Estas carpetas son compartidas por todas las escenas de ese proyecto y están etiquetadas de la siguiente manera:

source: **+inputs** is the folder where all scanned drawings are saved (as TIF files).
es: **+inputs** es la carpeta donde se almacenan todos los dibujos escaneados (como archivos TIF).

source: **+drawings** is the folder where OpenToonz cleaned up drawings, drawings made directly in OpenToonz and imported OpenToonz drawings are saved (TLV and PLI files).
es: **+drawings** es la carpeta donde se almacenan (como archivos TLV o PLI) dibujos limpiados en OpenToonz, dibujos hechos directamente en OpenToonz y dibujos de OpenToonz importados.

source: **+scenes** is the folder where the OpenToonz scenes are saved (TNZ files).
es: **+scenes** es la carpeta donde se almacenan las escenas de OpenToonz (archivos TNZ).

source: **+extras** is the folder where all the imported non-OpenToonz levels, images and audio files are saved.
es: **+extras** es la carpeta donde se almacenan todos los niveles, imágenes y audios importados no hechos en OpenToonz.

source: **+outputs** is the folder where rendered images are saved.
es: **+outputs** es la carpeta donde se almacenan las imágenes finales procesadas por OpenToonz.

source: **+palettes** is the folder where the project palettes of the studio palette are saved, and where the Raster Drawing Palette, shared by all the raster levels belonging to the project, is stored.
es: **+palettes** es la carpeta donde se almacenan las paletas del proyecto (accesibles desde el panel Paleta de estudio) y la paleta **Raster Drawing Palette**, compartida por todos los niveles de imagen del proyecto.

source: For each of these folders you can specify different locations on your computer network depending on the way you set up the storage of your production material.
es: Para cada una de estas carpetas es posible especificar diferentes ubicaciones de disco o de red, dependiendo de la manera en que se defina el almacenamiento del material de la producción.

source: Absolute or relative paths can be specified for the default folders definition.
es: Es posible especificar rutas absolutas o relativas al establecer las carpetas predefinidas.

source: If you specify an absolute path, the folders will be created, when needed, where specified. For example you can set **+drawings** to be ``C:\production\drawings01`` on Windows, or ``/Volume/Macintosh HD/production/drawing01`` on Macintosh: this means that the OpenToonz drawn and cleaned up levels will be automatically saved in ``C:\production\drawings01`` on Windows, or in ``/Volume/Macintosh HD/production/drawing01`` on Macintosh.
es: Si se especifica una ruta absoluta, las carpetas serán creadas, de ser necesario, donde se indique. Por ejemplo, se puede especificar que **+drawings** esté en ``C:\producción\dibujos01`` en Windows, o ``/Volume/Macintosh HD/producción/dibujos01`` en macOS: esto significa que los niveles dibujados o limpiados en OpenToonz serán guardados en ``C:\producción\dibujos01`` en Windows, o en ``/Volume/Macintosh HD/producción/dibujos01`` en macOS.

source: If you specify a relative path, all the folders you specify in the path will be created, when needed, in the project folder under the selected projectroot or repository (see :ref:`Configuring the Version Control in OpenToonz <configuring_the_version_control_in_toonz>` ). For example, for the project myproject, you can set **+drawings** to be ``sequence01\mydrawings`` : this means that the OpenToonz drawn and cleaned up levels will be automatically saved in the ``myproject\sequence01\mydrawings`` folder located in the selected projectroot or repository.
es: Si se especifica una ruta relativa, todas las carpetas que se especifiquen en la ruta serán creadas, de ser necesario, en la carpeta del proyecto bajo la carpeta principal de proyectos o repositorio seleccionado (ver :ref:`Configuración de control de versiones en OpenToonz <configuring_the_version_control_in_toonz>` ). Por ejemplo, para el proyecto miProyecto, se puede establecer que **+drawings** esté en ``secuencia01\misDibujos`` : esto significa que los niveles dibujados y limpiados en OpenToonz serán guardados automáticamente en la carpeta ``miProyecto\secuencia01\misDibujos`` ubicada en la carpeta principal de proyectos o el repositorio seleccionado.

source: The $scenepath variable can also be used to automatically create specific folders according to the scene you are working on. The variable can be either appended to the specified paths, or used in the path definition.
es: La variable $scenepath también puede ser usada para crear automáticamente carpetas específicas de acuerdo a la escena en la que se esté trabajando. La variable puede ser añadida a las rutas establecidas o usada en la propia definición de cada ruta.

source: The labels of the default folders you can find in the project settings (i.e. **+drawings**, **+extras**, etc.) can be used as aliases in OpenToonz. For example if some material is retrieved from the extras default folder, its loading path will contain the alias **+extras**. They can be also used when you need to specify a saving path, for example in the Path field of the New Level dialog.
es: En OpenToonz es posible usar las etiquetas de las carpetas predefinidas que aparecen en el diálogo **Opciones del proyecto** (**+drawings**, **+extras**, etc.) como referencias a sus rutas relativas. Por ejemplo, si algún material es recuperado desde la carpeta predefinida **extras**, su ruta de carga contendrá la referencia **+extras**. También pueden ser usadas cuando se necesite definir una ruta de guardado, por ejemplo en el campo **Guardar en:** del diálogo **Nuevo nivel**.

source: When in a scene you load material not located in the current project folders, you can choose whether to import files, that is to say copy them in the related project folders, or to create a link with the external file. The link is defined by an absolute path.
es: Cuando en una escena se carga material ubicado fuera de las carpetas del proyecto activo, es posible elegir si los archivos deben importarse al proyecto, esto es, copiarlos a la carpeta correspondiente del proyecto, o crear un vínculo con el archivo desde donde se encuentre. En este último caso el vínculo es definido como una ruta absoluta.

source: Files loaded in a scene without importing can be imported later on at once by using the Collect Assets feature (see :ref:`Collecting Assets <collecting_assets>` ).
es: Cuando en una escena se carga material ubicado fuera de las carpetas del proyecto activo, es posible elegir si los archivos deben importarse al proyecto, esto es, copiarlos a la carpeta correspondiente del proyecto, o crear un vínculo con el archivo desde donde se encuentre. En este último caso el vínculo es definido como una ruta absoluta.

source: All shared disks involved in the folder definitions, i.e. disks where production material has to be written and read, must be shared granting full permissions to any user, otherwise the exchange of files will not succeed. For Windows, disks must have a Share Permission set to Full Control for Everyone; for Macintosh, the sharing settings must allow any user to read from and write to disks.
es: Todos los discos compartidos participantes de las definiciones de rutas de carpetas (discos en donde se guaradrá y leerá el material usado en la producción) deben otorgar permisos completos a todos los usuarios, de otra manera el intercambio de archivos no será exitoso. En Windows, los discos deben tener los Permisos de compartición para Todos en **Control total**; en macOS, las opciones de compartición deben permitir a cualquier usuario a leer y escribir en los discos.

source: When no project is defined, the ``OpenToonz stuff/sandbox`` project is used by default.
es: Cuando no exista ningún proyecto, se usará el proyecto predefinido ``OpenToonz stuff/sandbox`` .

source: **To set default folders for a new project:**
es: ** Para definir las carpetas predefinidas de un nuevo proyecto:**

source: Do one of the following:
es: Hacer alguna de las siguientes cosas:

source: Type the path to the folder you want to use as default.
es: Ingresar la ruta a la carpeta que se desea usar como predefinida.

source: Use the browser button on the right of each text field, to set the folder you want to use as default.
es: Usar el botón de explorar, a la derecha de cada campo de texto, para definir la carpeta que se desea usar como predefinida.

source: Adding Custom Default Folders
es: Incorporación de carpetas predefinidas personalizadas
