Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/managing_palettes_and_styles.po
Languages: es, ru

source: **Opacity linearize**, correct the nonlinearity introduced by blending multiple dabs on top of each other. This correction should get you a linear ("natural") pressure response when pressure is mapped to opaque\_multiply, as it is usually done. 0.9 is good for standard strokes, set it smaller if your brush scatters a lot, or higher if you use dabs\_per\_second. 0.0 the **Opacity** value above is for the individual dabs; 1.0 the **Opacity** value above is for the final brush stroke, assuming each pixel gets (dabs\_per\_radius\*2) brush dabs on average, during a stroke.
es: **Opacity linearize** (linealizar opacidad), permite corregir la no-linealidad introducida al mezclar varias pinceladas, una encima de la otra. Mediante esta corrección debería ser posible obtener una respuesta lineal ("natural") al mapear la presión al atributo *opaque\_multiply*, como se suele hacer. 0.9 es apropiado para trazos normales, disminuirlo si el pincel se esparce demasiado, o aumentarlo si se usa el atributo *dabs\_per\_second*. Cuando esté en 0.0 el valor de **Opacity** representará la opacidad de cada pincelada individual; en 1.0 a la opacidad de la pincelada final, asumiendo que cada píxel obtiene en promedio (dabs\_per\_radius\*2) pinceladas, durante un trazo.
ru: **Линеаризация непрозрачности**, исправить введенную нелинейность путем наложения нескольких мазков друг на друга. Эта коррекция должна дать вам линейный ("естественный") отклик давления, когда давление отображается непрозрачным opaque\ _multiply, как это обычно делается. 0,9 хорошо для стандартных мазков, установите его меньше, если ваша кисть сильно рассеивается, или выше, если вы используете Мазков в секунду. 0.0 значение **Непрозрачность** выше для отдельных мазков; 1.0 значение **Непрозрачность**, приведенное выше, относится к последнему мазку кисти, при условии, что каждый пиксель получает (dabs\ _per\ _radius\*2) мазки кисти в среднем за удар.

source: **Lock alpha**, (info needed).
es: **Lock alpha** (bloquear alfa), (se necesita información).
ru: **Блокирование альфа-канала**, (требуется информация).

source: Dabs
es: Pinceladas
ru: Мазки

source: **Dabs per basic radius**, how many dabs to draw while the pointer moves a distance of 1 brush radius (i.e. the base value of the radius).
es: **Dabs per basic radius** (pinceladas por radio básico), permite definir cuántas pinceladas se dibujarán mientras el puntero se mueve una distancia equivalente a 1 radio de pincel (el valor base del radio).
ru: **Мазков на основной радиус**, сколько мазков нужно нарисовать, когда указатель перемещается на расстояние 1 радиуса кисти (т.е. базовое значение радиуса).

source: **Dabs per actual radius**, same as above but the radius actually drawn is used, which can change dynamically with pressure.
es: **Dabs per actual radius** (Pinceladas por radio efectivo), lo mismo de arriba pero usando el radio realmente dibujado, lo cual puede cambiar de forma dinámica con la presión.
ru: **Мазков на текущий радиус**, то же, что указано выше, но фактически используется радиус, который может изменяться в зависимости от давления.

source: **Dabs per second**, dabs to draw each second, no matter how far the pointer moves.
es: **Dabs per second** (pinceladas por segundo), pinceladas a dibujar en cada segundo, sin importar qué tanto se mueva el puntero.
ru: **Мазков в секунду**, мазки к рисованию каждую секунду, независимо от того, как далеко перемещается указатель.

source: Smudge
es: Manchado
ru: Размазывание

source: **Smudge**, paint with the smudge color instead of the brush color. The smudge color is slowly changed to the color you are painting on. 0.0 do not use the smudge color; 0.5 mix the smudge color with the brush color; 1.0 use only the smudge color.
es: **Smudge** (manchar), permite pintar con el color de marchar, en vez de hacerlo con el color del pincel. El color de manchar cambiará lentamente al color sobre el cual se está pintando. 0.0 no usar el color de manchar; 0.5 mezcla el color de manchar con el color del pincel; 1.0 usar sólo el color de manchar.
ru: **Размазывание**, рисуйте цветом пятна, а не цветом кисти. Цвет пятна медленно меняется на цвет, на котором вы рисуете. 0.0 не используйте пятно цвета; 0.5 смешайте цвет пятна с цветом кисти; 1.0 используйте только цвет пятна.

source: **Smudge length**, this controls how fast the smudge color becomes the color you are painting on. 0.0 immediately change the smudge color; 1.0 never change the smudge color.
es: **Smudge length** (longitud de manchado), permite controlar qué tan rápido el color de manchar se convertirá en el color sobre el que se está pintando. 0.0 cambia inmediatamente el color de manchar; 1.0 nunca cambia el color de manchar.
ru: **Длина размазывания** определяет, насколько быстро цвет пятна становится цветом, на котором вы рисуете. 0.0 немедленно изменить цвет пятна; 1.0 никогда не меняет цвет пятна.

source: **Smudge radius**, (info needed).
es: **Smudge radius** (radio de manchado), (se necesita información).
ru: **Радиус**, (требуется информация).

source: Speed
es: Velocidad
ru: Скорость

source: **Fine speed filter**, how slow the input fine speed is following the real speed. 0.0 change immediately as your speed changes (not recommended, but try it).
es: **Fine speed filter** (filtro de velocidad fina), permite definir qué tan lentamente la entrada **Fine speed** seguirá a la velocidad real. 0.0 cambia tan pronto cambia la velocidad (no recomendado).
ru: **Фильтр точной скорости**, насколько медленная скорость ввода соответствует реальной скорости. 0.0 изменяется немедленно по мере изменения вашей скорости (не рекомендуется, но попробуйте).

source: **Gross speed filter**, same as **Fine speed filter**, but note that the range is different.
es: **Gross speed filter** (filtro de velocidad gruesa), similar a **Fine speed filter**, pero usando un rango diferente.
ru: **Фильтр главной скорости**, то же, что и **Фильтр точной скорости**, но обратите внимание, что диапазон отличается.

source: **Fine speed gamma**, this changes the reaction of the **Fine speed** input to extreme physical speed. You will see the difference best if **Fine speed** is mapped to the radius. -8.0 very fast speed does not increase *Fine speed* much more; +8.0 very fast speed increases *Fine speed* a lot. For very slow speed the opposite happens.
es: **Fine speed gamma** (gama de velocidad fina), esto cambia la reacción de la entrada **Fine speed** a velocidades físicas extremas. Se observará mejor la diferencia si **Fine speed** se mapea al radio. Con un valor de -8.0 una velocidad muy alta no incrementará mucho más a *Fine speed*; con +8.0 una velocidad muy alta incrementará mucho a *Fine speed*. Para velocidades muy bajas sucederá lo contrario.
ru: **Гамма точной скорости**, изменяет реакцию входа **Точная скорость** на экстремальную физическую скорость. Вы увидите разницу лучше всего, если **Точная скорость** отображается на радиус. -8.0 очень быстрая скорость не увеличивается *Точная скорость* намного больше; +8.0 очень быстрая скорость увеличивается *Точная скорость* сильно. Для очень медленной скорости происходит обратное.

source: **Gross speed gamma**, same as **Fine speed gamma** for gross speed.
es: **Gross speed gamma** (gama de velocidad gruesa), similar a **Fine speed gamma**, pero para la velocidad gruesa.
ru: **Гамма главной скорости** то же, что и **Гамма точной скорости** для главной скорости.

source: **Offset by speed**, change position depending on pointer speed. = 0 disable; \> 0 draw where the pointer moves to; \< 0 draw where the pointer comes from.
es: **Offset by speed** (desplazamiento por velocidad), permite cambiar la posición dependiendo de la velocidad del puntero. = 0 deshabilitado; \> 0 dibuja hacia donde se dirige el puntero; \< 0 dibuja desde donde viene el puntero.
ru: **Смещение вдоль скорости** - изменение положения в зависимости от скорости указателя. = 0 отключить; \> 0 рисует, куда перемещается указатель; \ <0 рисовать, откуда приходит указатель.

source: **Offset by speed filter**, how slow the offset goes back to zero when the cursor stops moving.
es: **Offset by speed filter** (filtro de desplazamiento por velocidad), define qué tan lentamente regresa el desplazamiento a cero, cuando el cursor detiene su movimiento.
ru: **Фильтр смещения по скорости**, насколько медленно смещение возвращается к нулю, когда курсор перестает двигаться.

source: Tracking
es: Rastro
ru: Перемещение

source: **Slow position tracking**, slowdown pointer tracking speed. 0 disables it, higher values remove more jitter in cursor movements. Useful for drawing smooth, comic-like outlines.
es: **Slow position tracking** (rastreo lento de posición), enlentece la velocidad de rastreo del puntero. 0 lo deshabilita, valores mayores producirán una mayor eliminación en las alteraciones del movimiento del cursor. Útil para dibujar contornos suaves, del tipo usado en comics.
ru: **Замедление перемещения** скорость отслеживания указателя замедления. 0 отключает его, более высокие значения убирают больше дрожания в движениях курсора. Полезно для рисования гладких, комических контуров.

source: **Slow tracking per dab**, similar as above but at brushdab level (ignoring how much time has past, if brushdabs do not depend on time).
es: **Slow tracking per dab** (rastreo lento por pincelada), similar al anterior pero a nivel de pinceladas (ignorando cuánto tiempo haya pasado, si el atributo *brushdabs* no depende del tiempo).
ru: **Замедление перемещения на мазок**, аналогично описанному выше, но на уровне кисти (игнорирование того, сколько времени прошло, если кисти не зависят от времени).

source: **Tracking noise**, add randomness to the mouse pointer; this usually generates many small lines in random directions; maybe try this together with **Slow tracking**.
es: **Tracking noise** (ruido del rastreo), agrega aleatoriedad al movimiento del puntero; esto normalmente genera varias líneas pequeñas en direcciones aleatorias; es posible usarlo en conjunto con **Slow tracking**.
ru: **Дрожание траектории** добавляет случайность к указателю мыши; это обычно генерирует много маленьких линий в случайных направлениях; возможно попробуйте это вместе с **Замедление перемещения на мазок**.

source: Stroke
es: Trazo
ru: Штрих

source: **Stroke threshold**, how much pressure is needed to start a stroke. This affects the stroke input only. OpenToonz does not need a minimal pressure to start drawing.
es: **Stroke threshold** (umbral del trazo), qué tanta presión será necesaria para comenzar un trazo. Esto afectará sólo a la entrada *stroke*. OpenToonz no necesita una presión mínima para comenzar a dibujar.
ru: **Порог штриха** какое давление необходимо для начала штриха. Это влияет только на вход штриха. OpenToonz не требует минимального давления, чтобы начать рисовать.

source: **Stroke duration**, how far you have to move until the stroke input reaches 1.0. This value is logarithmic (negative values will not inverse the process).
es: **Stroke duration** (duración del trazo), qué tan lejos es necesario mover para que la entrada *stroke* alcance un valor de 1.0. Este valor es logarítmico (valores inversos no invertirán el proceso).
ru: **Длительность штриха** то, как далеко вы должны продвинуться, пока входной штрих не достигнет 1,0. Это значение является логарифмическим (отрицательные значения не будут инвертировать процесс).

source: **Stroke hold time**, this defines how long the stroke input stays at 1.0. After that it will reset to 0.0 and start growing again, even if the stroke is not yet finished.. 2.0 means twice as long as it takes to go from 0.0 to 1.0; 9.9 and bigger stands for infinite.
es: **Stroke hold time** (tiempo de mantenimiento del trazo), permite definir durante cuánto tiempo la entrada *stroke* permanecerá en 1.0. Luego de eso se restablecerá a 0.0 y comenzará a crecer nuevamente, aunque el trazo no haya finalizado todavía. 2.0 significa dos veces más de lo que lleva ir de 0.0 a 1.0; 9.9 o mayor, significarán infinito.
ru: **Время удержания штриха**, это определяет, как долго ввод штриха остается на уровне 1,0. После этого он сбрасывается до 0,0 и снова начинает расти, даже если ход еще не завершен. 2,0 означает вдвое больше времени, необходимого для перехода от 0,0 до 1,0; 9,9 и больше означает бесконечность.

source: **Color hue**, (info needed).
es: **Color hue** (tono del color), (se necesita información).
ru: **Оттенок**, (требуется информация).

source: **Color saturation**, (info needed).
es: **Color saturation** (saturación del color), (se necesita información).
ru: **Насыщенность**, (требуется информация).

source: **Color value**, (info needed).
es: **Color value** (valor del color), (se necesita información).
ru: **Светлота**, (требуется информация).

source: **Change color hue**, change color hue. -0.1 small clockwise color hue shift; 0.0 disable; 0.5 counterclockwise hue shift by 180 degrees.
es: **Change color hue** (cambio de tono del color), permite cambiar el tono del color. -0.1 es un pequeño desplazamiento del tono del color en sentido horario; 0.0 deshabilitado; 0.5 es un desplazamiento del tono de 180 grados en sentido antihorario.
ru: **Изменение оттенка**, меняет цветовой тон. -0.1 небольшое смещение цвета по часовой стрелке; 0.0 отключить; 0,5 против часовой стрелки сдвиг оттенка на 180 градусов.

source: **Change color lightness (HSL)**, change the color lightness (luminance) using the HSL color model. -1.0 blacker; 0.0 disable; 1.0 whiter.
es: **Change color lightness (HSL)** (cambio de luminosidad del color), permite cambiar la luminosidad (luminancia) del color usando el modelo de color TSL. -1.0 más negro; 0.0 deshabilitado; 1.0 más blanco.
ru: **Изменение светлоты (HSL)** изменить яркость цвета (яркость) с помощью цветовой модели HSL. -1,0 чернее; 0.0 отключить; 1,0 белее.

source: **Change color satur. (HSL)**, change the color saturation using the HSL color model. -1.0 more grayish; 0.0 disable; 1.0 more saturated.
es: **Change color satur. (HSL)** (cambio de saturación del color), permite cambiar la saturación del color usando el modelo de color TSL. -1.0 más gris; 0.0 deshabilitado; 1.0 más saturado.
ru: **Изменение насыщенности (HSL)** меняет насыщенность цвета, используя цветовую модель HSL. -1,0 больше сероватого цвета; 0.0 отключить; 1,0 более насыщенный.

source: **Change color value (HSV)**, change the color value (brightness, intensity) using the HSV color model. HSV changes are applied before HSL ones. -1.0 darker; 0.0 disable; 1.0 brighter.
es: **Change color value (HSV)** (cambio de valor del color), permite cambiar el valor (brillo o intensidad) del color usando el modelo de color TSV. Los cambios TSV son aplicados antes que los TSL. -1.0 más oscuro; 0.0 deshabilitado; 1.0 más brillo.
ru: **Изменение значения (HSV)** изменить значение цвета (яркость, интенсивность) с помощью цветовой модели HSV. Изменения HSV применяются до изменений HSL. -1,0 темнее; 0.0 отключить; 1,0 ярче.

source: **Change color satur. (HSV)**, change the color saturation using the HSV color model. HSV changes are applied before HSL ones. -1.0 more grayish; 0.0 disable; 1.0 more saturated.
es: **Change color satur. (HSV)** (cambio de saturación del color), permite cambiar la saturación del color usando el modelo de color TSV. Los cambios TSV son aplicados antes que los TSL. -1.0 más gris; 0.0 deshabilitado; 1.0 más saturado.
ru: **Изменение насыщенности (HSV)** изменить насыщенность цвета, используя цветовую модель HSV. Изменения HSV применяются до изменений HSL. -1,0 больше сероватого цвета; 0.0 отключить; 1.0 более насыщенный.

source: **Save color**, (info needed).
es: **Save color** (guardar color), (se necesita información).
ru: **Сохранить цвет**, (требуется информация).

source: **Colorize**, (info needed).
es: **Colorize** (colorizar), (se necesita información).
ru: **Цвет**, (требуется информация).

source: Custom
es: Personalizadas
ru: Пользовательский

source: **Custom input**, set the custom input to this value. If it is slowed down, move it towards this value (see below). The idea is that you make this input depend on a mixture of pressure/speed/whatever, and then make other settings depend on this 'custom input' instead of repeating this combination everywhere you need it. If you make it change *by random* you can generate a slow (smooth) random input.
es: **Custom input** (entrada personalizada), permite definir la entrada personalizada a este valor. Si es enlentecida, se moverá hacia este valor (ver abajo). La idea es hacer depender a esta entrada de una mezcla de *pressure*/*speed*/*whatever*, y luego hacer que otras propiedades dependan de esta 'entrada personalizada', en vez de repetir esa combinación de cosas en todos lados donde se necesite. Si se la hiciera cambiar *by random* es posible generar una entrada aleatoria lenta (suave).
ru: **Ввод пользователя** установите пользовательский ввод на это значение. Если он замедлен, переместите его к этому значению (см. ниже). Идея состоит в том, что вы делаете этот ввод зависимым от сочетания давление/скорость/что угодно, а затем делаете другие настройки зависимыми от этого «пользовательского ввода» вместо того, чтобы повторять эту комбинацию везде, где вам это нужно. Если вы сделаете это *случайным*, вы можете создавать медленный (плавный) случайный ввод.

source: **Custom input filter**, how slow the custom input actually follows the desired value (the one above). This happens at brushdab level (ignoring how much time has past, if brushdabs do not depend on time). 0.0 no slowdown (changes apply instantly).
es: **Custom input filter** (filtro de entrada personalizada), qué tan lentamente seguirá la entrada personalizada al valor deseado (el de arriba). Esto sucede a nivel de *brushdab* (ignorando cuánto tiempo ha pasado, si es que *brushdab* no dependiera del tiempo). 0.0 sin enlentecimiento (los cambios se aplicarán instantáneamente).
ru: **Фильтр ввода пользователя** насколько медленно пользовательский ввод фактически следует желаемому значению (указанному выше). Это происходит на уровне кисти (игнорируя, сколько времени прошло, если кисти не зависят от времени). 0.0 замедления нет (изменения применяются мгновенно).

source: Changing the Type of Style
es: Cambio de tipo de estilo
ru: Изменение типа стиля

source: When you select a Color, Texture, Generated, Trail, Vector Brush or Raster brush style in the Style Editor, you automatically assign it to the current style, thus changing its style type.
es: Al seleccionar estilos de tipo: Color, Textura, Generado, Rastro, Pincel vectorial o Pincel de imagen en el Editor de estilos, éste queda asignado al estilo actual, cambiando el tipo de estilo activo.
ru: Когда вы выбираете стиль Цвет, Текстура, Сформирован, Хвост, Векторная кисть или Растр в Редакторе стилей, вы автоматически назначаете его текущему стилю, тем самым изменяя его стиль.

source: A different case is when you want to *change back* from a **Generated**, **Vector Brush** or **Raster** brush style to a **Color** one, because when the current style is one of those types, the Color tab is used for setting their colors. So, in this case you first have to remove the Generated, Vector Brush or Raster brush styles by using the first swatch available in the swatch list, and then move to the **Color** tab.
es: Un caso distinto se da cuando se desea *regresar* desde un estilo de tipo **Generado**, **Pincel vectorial** o **Pincel** de imagen a un estilo de **Color** pleno, ya que cuando el estilo es de uno de esos tipo, la solapa **Color** es usada para definir sus colores. En estos casos, primero se debe remover el estilo Generado, Pincel vectorial o Pincel de imagen activo, usando la primera miniatura disponible en la lista de miniaturas y recién después ir a la solapa **Color** a establecer el mismo.
ru: Другой случай, когда вы хотите *изменить обратно* с **Сформирован**, **Векторная кисть** или **Растр** стиля кисти на **Цвет**, потому что когда текущий стиль равен единице из этих типов вкладка Цвет используется для установки их цветов. Таким образом, в этом случае сначала необходимо удалить стили Сформирован, Векторная кисть или Растр с помощью первого образца, доступного в списке образцов, а затем перейти на вкладку **Цвет**.

source: Also note that when you change from a style suitable for both *lines* and *areas* to a style suitable only for *lines*, the *areas* painted with that style will become invisible, and vice versa. For example if you change a style from Color to Trail, all areas painted with that style will become invisible. If you modify the style so that it's suitable again for *lines* and *areas*, the invisible parts will become visible again.
es: Nótese también que al cambiar desde un estilo apropiado tanto para *líneas* como para *áreas* a uno apropiado únicamente para *líneas*, las *áreas* pintadas con dicho estilo quedarán invisibles, a la inversa también sucede lo propio. Por ejemplo, si se cambia un estilo Color a Rastro, todas las áreas pintadas con el mismo quedarán invisibles. Si luego se volviera a modificar el estilo, por otro que fuera apropiado para pintar *líneas* y *áreas*, las partes invisibles volverían a verse nuevamente.
ru: Также обратите внимание, что при переходе от стиля, подходящего как для *линий*, так и *областей*, к стилю, подходящему только для *линий*, *областей*, окрашенные этим стилем, станут невидимыми, и наоборот. Например, если вы измените стиль с Цвета на Хвост, все области, окрашенные этим стилем, станут невидимыми. Если вы измените стиль так, чтобы он снова подходил для *линий* и *областей*, невидимые части снова станут видимыми.

source: **To change the type of style from Color to any other:**
es: **Para cambiar el tipo de estilo de Color a cualquier otro:**
ru: **Чтобы изменить тип стиля с Цвет на любой другой:**

source: Choose an item in the **Texture**, **Vector** or **Raster** tabs.
es: Elegir un elemento en las solapas **Texturas**, **Vectoriales** o **Pinceles**.
ru: Выберите элемент на вкладках **Текстура**, **Вектор** или **Растр**.

source: **To change the type of style back to Color:**
es: **Para cambiar el tipo de estilo de vuelta a Color:**
ru: **Чтобы изменить тип стиля обратно на Цвет:**

source: Choose the *Color* tab and start moving a slider or the selector in the color wheel.
es: Elegir la solapa **Color** y comenzar a mover un deslizador o el indicador en la muestra.
ru: Выберите вкладку *Цвет* и начните перемещать ползунок или селектор в цветовом круге.

source: **To change the type of style from Generated, Vector Brush or Raster brush back to color:**
es: **Para cambiar el tipo de estilo de vuelta a Color, desde un estilo Generado, Pincel vectorial o Pincel de imagen:**
ru: **Чтобы изменить тип стиля с Сформирован, Векторная кисть или Растровая кисть обратно на цвет:**

source: In the **Generated**, **Vector Brush** or **Raster** brush sections of the Style Editor select the first style in the list (the top-left most one) to remove any special type from the current style.
es: En las secciones **Generados**, **Pinceles vectoriales** o **Pinceles** del Editor de estilos, seleccionar el primer estilo en la lista (esquina superior izquierda) para eliminar cualquier tipo especial del estilo actual.
ru: В секциях кисти **Сформирован**, **Векторная кисть** или **Растр** Редактора стилей выберите первый стиль в списке (самый верхний левый), чтобы удалить любой специальный тип из текущий стиль.

source: Choose the **Color** tab and start moving a slider or the selector in the color wheel.
es: Elegir la solapa **Color** y comenzar a mover un deslizador o el indicador en la muestra.
ru: Выберите вкладку **Цвет** и начните перемещать ползунок или селектор в цветовом круге.
