Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/managing_palettes_and_styles.po
Languages: es, ru

source: If the generated style uses more than one color, select the color to edit in the row of swatches available below the Auto and Apply buttons.
es: Si el estilo **Generado** utilizara más de un color, seleccionar el color a editar en la fila de miniaturas disponible debajo de los botones **Auto** y **Aplicar**.
ru: Если сгенерированный стиль использует более одного цвета, выберите цвет для редактирования в строке образцов, доступных под кнопками Автоматически и Применить.

source: Trail Styles
es: Rastros
ru: Хвостовые стили

source: |style_editor_trail|
es: |style_editor_trail_es|

source: Trail styles are available for vector levels only. A trail style repeats an image or an animation level, created with OpenToonz or third party software, along the vectors of a vector level. Trail styles cannot be used to paint areas.
es: Los **Rastros** se encuentran disponibles sólo para niveles Vectorial de Toonz. Un estilo con **Rastro** repetirá una imagen o nivel de animación, creado con OpenToonz u otro programa, a lo largo de los trazos de un nivel vectorial. No será posible usar estilos con **Rastros** para rellenar áreas.
ru: Хвостовые стили доступны только для векторных уровней. Хвостовой стиль повторяет изображение или уровень анимации, созданные с помощью OpenToonz или стороннего программного обеспечения, по векторам векторного уровня. Хвостовой стиль нельзя использовать для рисования областей.

source: In the Trail section on the Vector tab you can select the image or the animation level you want to use as a style. You can add to the list your own animation levels as well: both OpenToonz animation levels (PLI) and full-color images or sequences of full-color images (BMP, JPG, NOL, PIC, PICT, PCT, PNG, RGB, SGI, TGA, TIF and TIFF) are supported.
es: En la sección **Rastros** de la solapa **Vectorial** es posible seleccionar la imagen o el nivel de animación que se desee usar como un estilo. También es posible agregar niveles personalizados a la lista de **Rastros**: se soportan tanto niveles vectoriales de animación de OpenToonz (PLI), como imágenes normales o secuencias de imágenes en formatos BMP, JPG, NOL, PIC, PICT, PCT, PNG, RGB, SGI, TGA, TIF y TIFF.
ru: В разделе Хвост на вкладке Вектор вы можете выбрать изображение или уровень анимации, который вы хотите использовать в качестве стиля. Вы также можете добавить в список свои собственные уровни анимации: уровни анимации OpenToonz (PLI) и полноцветные изображения или последовательности полноцветных изображений (BMP, JPG, NOL, PIC, PICT, PCT, PNG, RGB, SGI , TGA, TIF и TIFF) поддерживаются.

source: PLI levels are rendered according to the vector length and thickness, thus appearing jagged when zoomed in. If the output format is a vector one, then the PLI level will remain vector-based. (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: Los niveles PLI son procesados de acuerdo a la longitud y el grosor de los trazos a los que estén aplicados, pudiendo aparecer defectos de imagen al realizarse acercamientos de imagen. Si el formato de salida fuera un formato vectorial, entonces los niveles PLI permanecerán siendo vectoriales. (ver :ref:`Elección de opciones de salida <choosing_the_output_settings>` ).
ru: Уровни PLI отображаются в соответствии с длиной и толщиной вектора, поэтому при приближении они выглядят неровными. Если выходной формат является векторным, то уровень PLI останется векторным. (см. :ref:`Выбор настроек вывода <choosing_the_output_settings>`).

source: The images are repeated changing their placement and size according to the vector’s shape and thickness. If the animation levels contains different drawings, they are repeated cyclically along the vector length.
es: Las imágenes serán repetidas, cambiando su ubicación y tamaño, de acuerdo a la forma y el grosor del trazo. Si los niveles de animación usados como **Rastro** contuvieran varios dibujos, éstos serán repetidos de forma cíclica a lo largo del trazo.
ru: Изображения повторяются, изменяя их расположение и размер в соответствии с формой и толщиной вектора. Если уровни анимации содержат разные рисунки, они циклически повторяются по длине вектора.

source: Parameters such as the distance between subsequent images along the vector and their rotation can be defined in the Settings tab (see :ref:`Settings <settings>` ).
es: Es posible definir parámetros, como la distancia entre las imágenes repetidas a lo largo del trazo, así como su rotación, en la solapa **Opciones** (ver :ref:`Opciones <settings>` ).
ru: Такие параметры, как расстояние между последующими изображениями вдоль вектора и их вращение, можно определить на вкладке Настройки (см. :ref:`Настройки <settings>`).

source: **To add a new custom style:**
es: **Para agregar un nuevo estilo personalizado:**
ru: **Чтобы добавить новый пользовательский стиль:**

source: Create an image or an animation level with OpenToonz, or with third-party software.
es: Crear una imagen o nivel de animación con OpenToonz u otro programa.
ru: Создайте изображение или уровень анимации с помощью OpenToonz или стороннего программного обеспечения.

source: Save it in the folder ``Projectroot\library\custom styles`` (see :ref:`Setting up Projects <setting_up_projects>` ).
es: Guardarla en la carpeta ``OpenToonz stuff\library\custom styles`` (ver :ref:`Creación de proyectos <setting_up_projects>` ).
ru: Сохраните его в папке ``Projectroot\library\custom styles`` (см. :ref:`Настройка проектов <setting_up_projects>`).

source: Vector Brush Styles
es: Pinceles vectoriales
ru: Стили векторной кисти

source: |style_editor_vectorbrush|
es: |style_editor_vectorbrush_es|

source: Vector brush styles are available for vector levels only. A vector brush applies a vector image, created with OpenToonz, along the vector strokes of a vector level. Vector brush styles cannot be used to paint areas.
es: Los **Pinceles vectoriales** se encuentran disponibles sólo para niveles Vectorial de Toonz. Un pincel vectorial aplica una imagen vectorial, creada con OpenToonz, a lo largo de un *trazo* de un nivel vectorial. Los estilos que usan Pinceles vectoriales no pueden ser usados para rellenar *áreas*.
ru: Стили векторной кисти доступны только для векторных уровней. Векторная кисть применяет векторное изображение, созданное с помощью OpenToonz, вдоль векторных линий векторного уровня. Стили векторных кистей нельзя использовать для рисования областей.

source: In the Vector Brush section of the Vector tab, you can select the image you want to use as a style. You can add to the list your own PLI images as well.
es: En la sección **Pinceles vectoriales** de la solapa **Vectoriales**, es posible seleccionar la imagen que se desee usar como estilo. Asimismo, es posible agregar nuevas imágenes PLI a dicha lista.
ru: В разделе Векторная кисть на вкладке Вектор вы можете выбрать изображение, которое хотите использовать в качестве стиля. Вы также можете добавить в список свои собственные изображения PLI.

source: The Vector Brush image is applyed to each stroke of the drawing that use this style according to the stroke’s shape and thickness. If the animation levels used as vector Brush contains different drawings, only the first one will be taken into account.
es: La imagen del **Pincel vectorial** es aplicada a cada trazo del dibujo que use este estilo, de acuerdo a la forma y grosor del mismo. Si los niveles de animación usados como pinceles vectoriales contuvieran varios dibujos, *sólo el primer dibujo* del nivel será utilizado.
ru: Изображение векторной кисти применяется к каждой линии рисунка, использующей этот стиль, в соответствии с формой и толщиной мазка. Если уровни анимации, используемые в качестве векторной кисти, содержат разные рисунки, будет учитываться только первый.

source: Colors used by vector brushes can be modified by using the Color tab available in the style editor.
es: Es posible modificar los colores usados por los Pinceles vectoriales, usando la solapa **Color** disponible en el Editor de estilos.
ru: Цвета, используемые векторными кистями, можно изменить с помощью вкладки Цвет, доступной в Редакторе стилей.

source: The first item available in the list allows you to remove the Vector Brush in order to return it to a Color style.
es: El primer elemento disponible en la lista permite remover cualquier estilo **Pincel vectorial** aplicado previamente, permitiendo volver a usar sólo un **Color** para ese estilo.
ru: Первый элемент, доступный в списке, позволяет удалить векторную кисть, чтобы вернуть ее в цветовой стиль.

source: **To add a new vector brush:**
es: **Para agregar un nuevo Pincel vectorial:**
ru: **Чтобы добавить новую векторную кисть:**

source: Create a PLI level with OpenToonz.
es: Crear un nivel vectorial (PLI) en OpenToonz.
ru: Создайте уровень PLI в OpenToonz.

source: Save it in the folder ``Projectroot\library\vector brushes`` (see :ref:`Setting up Projects <setting_up_projects>` ).
es: Guardarlo en la carpeta ``OpenToonz stuff\library\vector brushes`` (see :ref:`Creación de proyectos <setting_up_projects>` ).
ru: Сохраните его в папке ``Projectroot\library\vector brushes`` (см. :ref:`Настройка проектов <setting_up_projects>`).

source: **To change colors used by a Vector Brush style:**
es: **Para cambiar los colores usados por un Pincel vectorial:**
ru: **Чтобы изменить цвета, используемые в стиле векторной кисти:**

source: Move to the **Color** tab in the Style Editor.
es: Ir a la solapa **Color** en el Editor de estilos.
ru: Перейдите на вкладку **Цвет** в Редакторе стилей.

source: If the Vector Brush uses more than one color, select the color to edit in the row of swatches available below the Auto and Apply buttons.
es: Si el Pincel vectorial utilizara más de un color, seleccionar el color a ser editado en la fila de miniaturas, debajo de los botones **Auto** y **Aplicar**.
ru: Если векторная кисть использует более одного цвета, выберите цвет для редактирования в ряду образцов, доступных под кнопками Автоматически и Применить.

source: Raster Brushes
es: Pinceles de imagen
ru: Растровые кисти

source: |style_editor_raster|
es: |style_editor_raster_es|

source: Raster brushes are available to paint in Raster levels and, with some limitations, in Toonz Raster levels. They are essentially brushes compatible with the `MyPaint <http://mypaint.org/about/>`_ open source painting software.
es: Los **Pinceles** de imagen se encuentran disponibles para pintar niveles de Imagen y, con algunas limitaciones, niveles de Imagen de Toonz. Esencialmente se trata de pinceles compatibles con el programa de pintura de código abierto `MyPaint <http://mypaint.org/about/>`_ .
ru: Растровые кисти доступны для рисования на растровых уровнях и, с некоторыми ограничениями, на Toonz Raster уровнях. По сути, они совместимы с кистями `MyPaint <http://mypaint.org/about/>`_ - программным обеспечением для рисования с открытым исходным кодом.

source: The Raster brushes use the **Color** from the current style as a base, and all its remaining options can be found in the **Settings** tab of the Style Editor pane (see :ref:`Settings for Raster Brushes <settings_for_raster_brushes>` ).
es: Los **Pinceles** de imagen utilizan el **Color** del estilo actual como base, siendo posible encontrar todas sus demás opciones en la solapa **Opciones** del Editor de estilos (ver :ref:`Opciones de Pinceles de imagen <settings_for_raster_brushes>` ).
ru: Растровые кисти используют **Цвет** из текущего стиля в качестве основы, а все остальные параметры можно найти на вкладке **Настройки** окна Редактора стилей (см. :ref:`Настройки для растровых кистей <settings_for_raster_brushes>`).

source: In Toonz Raster levels, currently only *additive* Raster brushes can be used (i.e. brushes that add paint to a level, not the ones that erase, blend or blur already painted strokes).
es: Actualmente, en niveles de Imagen de Toonz, sólo es posible utilizar Pinceles de imagen *aditivos* (aquellos que agregan pintura a un nivel, y no los que borran, funden o desenfocan pinceladas anteriores).
ru: В уровнях Toonz Raster в настоящее время могут использоваться только *аддитивные* растровые кисти (т.е. кисти, которые добавляют краску к уровню, а не те, которые стирают, смешивают или размывают уже нарисованные мазки).

source: In Toonz Raster levels, Raster brushes use only the **Opacity** values of the selected brush to paint with the current style color, and cannot use any of the other *Color related* settings of that brush.
es: En niveles de Imagen de Toonz, los Pinceles de imagen utilizan únicamente los valores de **Opacidad** del pincel seleccionado, para pintar con el color del estilo actual, no siendo capaces de utilizar ninguna opción la categoría **Color** de ese pincel (ver :ref:`Opciones de Pinceles de imagen <settings_for_raster_brushes>` ).
ru: В уровнях Toonz Raster кисти Raster используют только значения **Непрозрачность** выбранной кисти для рисования текущим цветом стиля и не могут использовать какие-либо другие *связанные с цветом* настройки этой кисти.

source: In Toonz Raster levels, Raster brushes can only paint *lines* (they cannot be used to fill *areas*).
es: En niveles de Imagen de Toonz, los Pinceles de imagen sólo pueden usarse para pintar *líneas* (no siendo capaces de pintar *áreas*).
ru: На уровнях Toonz Raster кисти Raster могут рисовать только *линии* (их нельзя использовать для заполнения *областей*).

source: Settings
es: Opciones
ru: Настройки

source: |style_editor_settings|
es: |style_editor_settings_es|

source: The Settings tab is available for defining some style properties.
es: La solapa **Opciones** se encuentra disponible para permitir la modificación de las propiedades de los estilos.
ru: Вкладка Настройки доступна для определения некоторых свойств стиля.

source: For Toonz Raster levels, it contains only the **Autopaint for Lines** option, that can be used to automatically paint border *lines* of an area, with the same color used to fill that *area* (see :ref:`Using the Autopaint for Lines Option <using_the_autopaint_for_lines_option>` ).
es: En niveles de Imagen de Toonz, contiene la opción **Pintar líneas automáticamente al rellenar**, que puede ser usada para pintar automáticamente las *líneas* que definen los contornos de un área, con el mismo color usado para rellenar dichas *áreas* (ver :ref:`Uso de la opción Pintar líneas automáticamente al rellenar <using_the_autopaint_for_lines_option>` ).
ru: Для уровней Toonz Raster он содержит только параметр **Автозаливка линий**, который можно использовать для автоматического рисования границ *линий* области, с тем же цветом, который используется для заполнения этой *области* (см. :ref:`Использование опции Автозаливка линий <using_the_autopaint_for_lines_option>`).

source: For Toonz Vector levels, it contains parameters only when the style is a **Generated** or **Trail** one.
es: En niveles de tipo Vectorial de Toonz, contendrá parámetros únicamente cuando se trate de un estilo **Generado** o **Rastro**.
ru: Для уровней Toonz Vector он содержит параметры только в том случае, если стиль является **Сформирован** или **Хвост**.

source: When the style is a **Generated** one, the Settings tab contains one or more sliders that allow you to finetune the predefined style to your needs. When the style is a **Trail** one, the Settings tab contains two sliders: **Distance** sets the space between two subsequent images of the animation level used as a trail; **Rotation** sets the angle of all the images.
es: Cuando el estilo sea de tipo **Generado**, la solapa Opciones contendrá uno o más deslizadores que permitirán retocar el estilo predefinido a las necesidades de cada caso. Cuando el estilo sea de tipo **Rastro** la solapa Opciones contendrá dos deslizadores: **Distancia**, que permite controlar el espacio entre las imágenes del nivel de animación usado como rastro; y **Rotación**, que permite definir el ángulo de las imágenes.
ru: Если стиль **Сформирован**, вкладка Настройки содержит один или несколько ползунков, которые позволяют точно настроить предопределенный стиль в соответствии с вашими потребностями. Когда стиль **Хвост** один, вкладка Настройки содержит два ползунка: **Расстояние** устанавливает интервал между двумя последующими изображениями уровня анимации, используемого в качестве следа; **Вращение** устанавливает угол всех изображений.

source: You can add the same **Generated** or **Trail** style as many times as you want, each time defining different settings for it.
es: Es posible agregar el mismo estilo **Generado** o **Rastro** tantas veces como se desee, definiendo distintas opciones cada vez.
ru: Вы можете добавлять один и тот же стиль **Сформирован** или **Хвост** столько раз, сколько хотите, каждый раз определяя для него различные настройки.

source: Settings for Raster Brushes
es: Opciones de Pinceles de imagen
ru: Настройки растровых кистей

source: |style_editor_settings-raster|
es: |style_editor_settings-raster_es|

source: Raster brushes have an extensive set of parameters to finetune their behaviour. These parameters can be changed in the Settings tab of the Style Editor pane. They include:
es: Los Pinceles de imagen contienen un conjunto extenso de parámetros para controlar su comportamiento. Es posible cambiar estos parámetros en la solapa Opciones del Editor de estilos. Los mismos incluyen:
ru: Растровые кисти имеют широкий набор параметров для точной настройки их поведения. Эти параметры можно изменить на вкладке Настройки окна Редактор стилей. Они включают в себя:

source: Basic
es: Básicas
ru: Основные

source: **Radius**, basic brush radius (logarithmic). 0.7 means 2 pixels; 3.0 means 20 pixels.
es: **Radius** (radio), es el radio (logarítmico) básico del pincel. 0.7 significa 2 píxeles; 3.0 significa 20 píxeles.
ru: **Радиус**, базовый радиус кисти (логарифмический). 0,7 означает 2 пикселов; 3,0 означает 20 пикселов.

source: **Radius by random**, alter the radius randomly in each dab. You can also do this with the by\_random input on the radius setting. If you do it here, there are two differences:. 1) the opaque value will be corrected such that a big-radius dabs is more transparent. 2) it will not change the actual radius seen by dabs\_per\_actual\_radius.
es: **Radius by random** (radio por aleatorio), altera el radio de forma aleatoria en cada pincelada. También es posible hacer esto usando la entrada *by\_random* en el parámetro radio. Si se hace desde aquí, existen dos diferencias: 1) el valor de opacidad será corregido de manera que las pinceladas de radios grandes sean más transparentes. 2) no cambiará el radio real visto por el atributo *dabs\_per\_actual\_radius*.
ru: **Случайный радиус** меняет радиус случайно в каждом мазке. Вы также можете сделать это с помощью входного параметра \ _random в настройке радиуса. Если вы делаете это здесь, есть два отличия: 1) непрозрачное значение будет исправлено так, чтобы мазки большого радиуса были более прозрачными. 2) он не изменит фактический радиус, видимый в параметре Мазков на текущий радиус.

source: **Hardness**, hard brush-circle borders (setting to 0 will draw nothing).
es: **Hardness** (dureza), dureza de los bordes del pincel (con un valor de 0 no dibujará nada).
ru: **Жёсткость**, жесткие границы круга кисти (установка в 0 ничего не будет рисовать).

source: **Pixel feather**, (info needed).
es: **Pixel feather** (fundido de píxeles), (se necesita información).
ru: **Сглаживание границ**, (требуется информация).

source: **Eraser**, how much this tool behaves like an eraser. 0.0 for normal painting; 1.0 for standard eraser behavior; 0.5 pixels go towards 50% transparency.
es: **Eraser** (borrador), define en qué medida esta herramienta se comporta como un borrador. 0.0 pinta normalmente; 1.0 funciona como borrador; 0.5 hace que los píxeles tiendan a un 50% de transparencia.
ru: **Ластик**, насколько этот инструмент ведет себя как ластик. 0,0 для нормальной окраски; 1.0 для стандартного поведения ластика; 0,5 пиксела идут к 50% прозрачности.

source: **Jitter**, add a random offset to the position where each dab is drawn. 0.0 is disabled; 1.0 standard deviation is one basic radius away; \<0.0 negative values produce no jitter.
es: **Jitter** (alteración), agrega un desplazamiento aleatorio a la posición, donde se dibuja cada pincelada. 0.0 deshabilitado; 1.0 desviación estándar a un radio de distancia; \<0.0 valores negativos no producirán ninguna alteración.
ru: **Дрожание**, добавить случайное смещение в положение, где рисуется каждый мазок. 0.0 отключен; 1,0 стандартное отклонение составляет один базовый радиус; \ <0.0 отрицательные значения не дают дрожания.

source: **Elliptical dab: angle**, this defines the angle by which elliptical dabs are tilted. 0.0 makes horizontal dabs; 45.0 produces 45 degree dabs, turned clockwise; 180.0 is horizontal again.
es: **Elliptical dab: angle** (pincelada elíptica: ángulo), define el ángulo de inclinación de las pinceladas elípticas. 0.0 produce pinceladas horizontales; 45.0 produce pinceladas a 45° en sentido horario; 180.0 es nuevamente horizontal.
ru: **Эллиптический мазок: угол**, это определяет угол, на который наклоняются эллиптические мазки. 0.0 делает горизонтальные мазки; 45.0 производит 45 градусов, повернутые по часовой стрелке; 180.0 снова в горизонтальном положении.

source: **Elliptical dab: ratio**, aspect ratio of the dabs; must be \>= 1.0, where 1.0 means a perfectly round dab.
es: **Elliptical dab: ratio** (pincelada elíptica: proporción), proporción de las pinceladas; debe ser \>= 1.0, donde 1.0 producirá una pincelada circular.
ru: **Эллиптический мазок: соотношение**, форматное соотношение мазков; должен быть \>= 1,0, где 1,0 означает идеально круглое прикосновение.

source: **Direction filter**, a low value will make the direction input adapt more quickly, a high value will make it smoother.
es: **Direction filter** (filtro de dirección), un valor bajo permitirá que la entrada de dirección se adapte más rápidamente, un valor alto la hará más estable.
ru: **Фильтр направления**, низкое значение заставит вводить направление быстрее, а высокое значение сгладит.

source: **Snap to pixel**, (info needed).
es: **Snap to pixel** (adherir a píxeles), (se necesita información).
ru: **Привязка к пикселам**, (требуется информация).

source: **Pressure gain**, change the gain factor for the pressure of the brush.
es: **Pressure gain** (ganancia de presión), permite cambiar el factor de ganancia para la presión del pincel.
ru: **Усиление нажатия** изменить коэффициент усиления для давления кисти.

source: Opacity
es: Opacidad
ru: Непрозрачность

source: **Opacity**, 0 means brush is transparent; 1 fully visible. (also known as alpha).
es: **Opacity** (opacidad), 0 el pincel es transparente; 1 es completamente opaco. (también conocido como alfa).
ru: **Непрозрачность**, 0 означает, что кисть прозрачна; 1 полностью виден (также известный как альфа).

source: **Opacity multiply**, this gets multiplied with Opacity. It is used for making opaque depend on pressure (or other inputs).
es: **Opacity multiply** (multiplicador de opacidad), este valor es multiplicado por el valor **Opacity**. Es usado para hacer que la opacidad dependa de la presión (u otras entradas).
ru: **Множитель непрозрачности**, это умножается на непрозрачность. Используется для создания непрозрачной зависимости от давления (или других входов).
