Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/managing_projects.po
Languages: es

source: Besides the basic default folders you can also add your own default folders, and use the related aliases, by defining a TXT file named ``project_folders.txt`` in the ``OpenToonz stuff\profiles`` folder. In this file you can also change the order of the folders already available to change the way they are listed in the project settings dialog.
es: Además de las carpetas predefinidas básicas, también es posible agregar otras y usar sus referencias respectivas modificando el archivo de texto ``project_folders.txt`` en la carpeta ``OpenToonz stuff\profiles`` . En este archivo también es posible cambiar el orden de las carpetas ya disponibles, para cambiar la forma en que son listadas en el diálogo **Opciones del proyecto**.

source: The following is an example of a ``projectfolders.txt`` file:
es: El siguiente es un ejemplo de un archivo ``projectfolders.txt`` :

source: backgrounds
es: fondos

source: where the **+backgrounds** and **+3D** aliases were added to the default ones.
es: donde las referencias **+fondos** y **+3D** fueron agregadas a las predefinidas.

source: **To add more default folders to projects:**
es: **Para agregar más carpetas predefinidas a un proyecto:**

source: Open the ``OpenToonz stuff\profiles\project_folders.txt`` file.
es: Abrir el archivo ``OpenToonz stuff\profiles\project_folders.txt`` .

source: List the default folders you want to define, one per line, and save the file.
es: Agregar a la lista las carpetas predefinidas que se desee definir, una por línea, y guardar el archivo.

source: Using the $scenepath Variable in Folder Definition
es: Uso de la variable $scenepath en la definición de carpetas

source: The $scenepath variable can also be used in the definition of the **+inputs**, **+drawings**, and **+extras** aliases when typing the default folder path. In this case the path where you save the current scene will replace the $scenepath variable in the path definition, with the needed folders automatically created during the saving process.
es: La variable $scenepath también puede ser usada en la definición de las referencias **+inputs**, **+drawings** y **+extras**, al ingresar la ruta de estas carpetas predefinidas. En estos casos, la ruta donde se guardó la escena actual reemplazará a la variable $scenepath presente en la definición de la rutas, creando automáticamente las carpetas que sea necesario durante el proceso de guardado.

source: For example if **+drawings** is ``$scenepath\mydrawings,`` and you save the scene scene01 in ``+scenes\seq01`` , OpenToonz drawn or cleaned up levels for that scene will be saved in ``seq01\scene01\mydrawings`` ; when you save the scene scene02, in ``seq01\scene02\mydrawings`` ; and so on.
es: Por ejemplo: si **+drawings** es ``$scenepath\misDibujos,`` y se guarda la escena escena01 en ``+scenes\sec01`` , los niveles dibujados o limpiados en OpenToonz pertenecientes a esa escena serán guardados en ``sec01\escena01\misDibujos`` ; al guardar la escena escena02, lo serán en ``sec01\escena02\misDibujos`` ; y así sucesivamente.

source: In this way the needed default folders are automatically created with the same given name (mydrawings), one for each scene, according to the path used when saving the scene. As a consequence, if the variable is used in this way for all the aliases, all the files related to a scene will be stored in a folder named as the scene.
es: De esta manera las carpetas predefinidas necesarias serán automáticamente creadas con el mismo nombre (misDibujos), una por cada escena, de acuerdo a la ruta usada al guardar la escena. Como consecuencia, si la variable es usada de esta manera para todas las referencias, todos los archivos relacionados con una escena serán guardados en una carpeta con el nombre de esa escena.

source: A second example: if **+drawings** is ``mydrawings\$scenepath,`` when you save the scene scene01 in ``+scenes\seq01`` , OpenToonz drawn or cleaned up levels for that scene will be saved in ``mydrawings\seq01\scene01`` ; when you save the scene scene02, in ``mydrawings\seq01\scene02`` ; and so on.
es: Un segundo ejemplo: si **+drawings** es ``misDibujos\$scenepath,`` al guardar la escena escena01 en ``+scenes\sec01`` , los niveles dibujados o limpiados en OpenToonz de esa escena serán guardados en ``misDibujos\sec01\escena01`` ; al guardar la escena escena02, in ``misDibujos\sec01\escena02`` ; y así sucesivamente.

source: In this case the needed default folders are automatically created with the name and path of folders used when saving the scene, inside the path specified (mydrawings). As a consequence, if the variable is used in this way for all the aliases, all the files used in the project will be stored in a main folder for each alias, whose content is divided into folders named as the scenes.
es: En este caso las carpetas predefinidas que sean necesarias serán automáticamente creadas con el nombre y ruta de las carpetas usadas al guardar la escena, dentro de la ruta especificada (misDibujos). Como consecuencia, si la variable es usada de esta manera para todas las referencias, todos los archivos usados en el proyecto serán almacenados en una carpeta principal por cada referencia, cuyo contenido estará dividido en carpetas, nombradas igual que las escenas del proyecto.

source: The definition of the **+palettes** alias cannot include $scenepath, as the palettes refer to the whole project, not to specific scenes.
es: La definición de la referencia **+palettes** no puede incluir la variable $scenepath, ya que las paletas se refieren al proyecto en su totalidad y no a escenas específicas.

source: It is not possible to use at the same time for an alias the $scenepath variable in folder definition and the Append $scenepath option.
es: No es posible usar, al mismo tiempo, para una misma referencia la variable $scenepath para la definición de su carpeta y activar la opción **Anexar $scenepath**.

source: Using the Append $scenepath Option
es: Uso de la opción Anexar $scenepath

source: The Append $scenepath option is available for the **+inputs**, **+drawings** and **+extras** aliases. If you activate the Append $scenepath option for an alias, the path where you save the current scene will be added to the path of the alias, with the needed folders automatically created during the saving process.
es: La opción **Anexar $scenepath** está disponible para las referencias **+inputs**, **+drawings** y **+extras**. Si se activa la opción **Anexar $scenepath** para una referencia, la ruta en donde se guardó la escena actual será agregada a la ruta de la referencia, creando automáticamente las carpetas que sea necesario durante el proceso de guardado.

source: For example if **+drawings** is ``mydrawings`` , and you save the scene scene01 in ``+scenes\seq01`` , OpenToonz drawn or cleaned up levels for that scene will be saved in ``mydrawings\seq01\scene01`` ; if you save the scene scene02 in ``+scenes\seq01`` , OpenToonz drawn or cleaned up levels for that scene will be saved in ``mydrawings\seq01\scene02`` ; and so on.
es: Por ejemplo: si **+drawings** es ``misDibujos`` y se guarda la escena escena01 en ``+scenes\sec01`` , los niveles dibujados o limpiados en OpenToonz de esa escena serán guardados en ``misDibujos\sec01\escena01`` ; si se guarda la escena escena02 en ``+scenes\sec01`` , serán guardados en ``misDibujos\sec01\escena02`` ; y así sucesivamente.

source: This allows OpenToonz to create scene-related folders automatically when saving OpenToonz files or importing external files, while allowing the use of the generic aliases **+drawings**, **+inputs** and **+extras**, no matter where levels are loaded from within the current project.
es: Esto permite a OpenToonz crear carpetas relativas a una escena de forma automática al guardar archivos de OpenToonz o al importar archivos externos, permitiendo al mismo tiempo el uso de referencias genéricas **+drawings**, **+inputs** y **+extras**, sin importar de dónde son cargados los niveles dentro del proyecto activo.

source: When a scene is saved in the **+scenes** folder, the value for $scenepath is the scene name; for example if you save the scene scene02 in **+scenes**, $scenepath will be scene02.
es: Cuando una escena es guardada en la carpeta **+scenes**, el valor para $scenepath es únicamente el propio nombre de la escena; por ejemplo, si se guarda la escena escena02 en **+scenes**, $scenepath = escena02.

source: It is not possible to use for an alias the Append $scenepath option and at the same time the $scenepath variable in defining the related folder.
es: No es posible usar para una misma referencia la opción **Anexar $scenepath** y al mismo tiempo usar la variable $scenepath al definir la ruta de su carpeta.

source: Using the Project Browser
es: Uso del Explorador de proyectos

source: The project browser is available at the end of the file browser tree. It lists all of the projects that have been created, whose actual location is in the projectroot that was defined in the initial installation of OpenToonz. The projectroot value is displayed in brackets.
es: El Explorador de proyectos está disponible en la parte inferior del la sección izquierda del Explorador de archivos. Lista todos los proyectos que han sido creados, ubicados en las carpetas principales de proyectos definidas para OpenToonz. Las rutas de acceso a las carpetas principales de proyectos se visualizan entre paréntesis.

source: The name of the folders which the aliases point to are displayed in blue.
es: Los nombres de las carpetas a donde apuntan las referencias de cada proyecto, se muestran resaltados en celeste.

source: In case more than one projectroot is defined, each will be listed with the related projectroot value in brackets (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
es: En caso de que haya más de una carpeta principal de proyectos definida, cada una será listada con su ruta de acceso entre paréntesis (ver :ref:`Definición de la carpeta principal de proyectos <setting_the_projectroot>` ).

source: Default Folders with Relative Paths
es: Carpetas predefinidas usando rutas relativas

source: When default folders are defined by using a relative path, in the project browser you will see all the folders specified in the path under the projectroot, and the project folders tree will be the same of the file system tree. The folders that are the target of the paths are displayed in blue.
es: Cuando se usen rutas relativas en la definición de carpetas predefinidas de un proyecto, en el Explorador de proyectos se podrán ver todas las carpetas especificadas bajo la carpeta principal de proyectos, y el árbol de carpetas del proyecto será igual al árbol del sistema de archivos. Las carpetas que sean referenciadas por las rutas aparecerán resaltadas en celeste.

source: For example, for the project Project01, with **+drawings** that is ``section01\prod drawings`` , the project browser will display the following:
es: Por ejemplo: para el proyecto Proyecto01, con **+drawings** definido como ``sección01\dibujos de prod`` , el Explorador de proyectos mostrará lo siguiente:

source: Projects
es: Proyectos

source: Project01
es: Proyecto01

source: section01
es: sección01

source: **prod drawings**
es: **dibujos de prod**

source: If the option Append $scenepath is activated, and you save the scene scene01 in ``+scenes\seq01`` , the project browser will display the following:
es: Si se activa la opción **Anexar $scenepath** y se guarda la escena escena01 en ``+scenes\sec01`` , el Explorador de proyectos mostrará lo siguiente:

source: prod drawings
es: dibujos de prod

source: seq01
es: sec01

source: **scene01**
es: **escena01**

source: If the $scenepath is used in the folder definition, with +drawings that is ``$scenepath\prod drawings,`` and you save the scene scene01 in ``+scenes\seq01`` , the project browser will display the following:
es: Si se usa la variable $scenepath para la definición de carpetas, con +drawings siendo ``$scenepath\dibujos de prod,`` y se guarda la escena escena01 en ``+scenes\sec01`` , el Explorador de proyectos mostrará lo siguiente:

source: scene01
es: escena01

source: If the $scenepath is used in the folder definition, with +drawings that is ``mydrawings\$scenepath,`` and you save the scene scene01 in ``+scenes\seq01`` , the project browser will display the following:
es: Si la variable $scenepath es usada para la definición de carpetas, con +drawings siendo ``misDibujos\$scenepath,`` y se guarda la escena escena01 en ``+scenes\sec01`` , el Explorador de proyectos mostrará lo siguientes:

source: Default Folders with Absolute Paths
es: Carpetas predefinidas usando rutas absolutas

source: When default folders are defined by using an absolute path, in the project browser you will see only the related aliases, whatever their location on the network is. In this way you can quickly access the production material without browsing the computer, or the network. The aliases are displayed in blue, because they are the location the default folders paths point to.
es: Cuando se usen rutas absolutas en la definición de carpetas predefinidas de un proyecto, en el Explorador de proyectos se podrán ver sólo las referencias correspondientes, cualquiera sea su ubicación real en la red. De esta forma es posible acceder rápidamente al material de producción sin necesidad de explorar en la computadora o la red. Dichas referencias serán mostradas en celeste, ya que representan a la ubicación a donde apuntan las rutas de las carpetas predefinidas.

source: For example, for the project Project01, with **+drawings** that is ``C:\production\prod drawings`` on Windows, or ``/Volume/Macintosh HD/production/prod drawings`` on Macintosh, the project browser will display the following:
es: Por ejemplo: para el proyecto Proyecto01, con **+drawings** siendo ``C:\producción\dibujos de prod`` en Windows o ``/Volume/Macintosh HD/producción/dibujos de prod`` en macOS, el Explorador de proyectos mostrará lo siguiente:

source: where **+drawings** is an alias for ``C:\production\prod drawings`` on Windows, or ``/Volume/Macintosh HD/production/prod drawings`` on Macintosh.
es: donde **+drawings** es una referencia para ``C:\producción\dibujos de prod`` en Windows o ``/Volume/Macintosh HD/producción/dibujos de prod`` en macOS.

source: If the $scenepath is used in the folder definition, with **+drawings** that is ``C:\$scenepath\prod drawings`` on Windows, or ``/Volume/Macintosh HD/$scenepath/prod drawings`` on Macintosh, and you save the scene scene01 in ``+scenes\seq01`` , the project browser will display the following:
es: Si la variable $scenepath es usada en la definición de carpetas, con **+drawings** siendo ``C:\$scenepath\dibujos de prod`` en Windows o ``/Volume/Macintosh HD/$scenepath/dibujos de prod`` en macOS, y se guarda la escena escena01 en ``+scenes\sec01`` , el Explorador de proyectos mostrará lo siguiente:

source: scene01.tnz
es: escena01.tnz

source: with **+drawings** that is ``C:\seq01\scene01\prod drawings`` on Windows, or ``/Volume/Macintosh HD/seq01/scene01/prod drawings`` on Macintosh, and is located under the related scene file (TNZ format).
es: con **+drawings** siendo ``C:\sec01\escena01\dibujos de prod`` en Windows o ``/Volume/Macintosh HD/sec01/escena01/dibujos de prod`` en macOS, y ubicada bajo el archivo de escena correspondiente (en formato TNZ).

source: If the $scenepath is used in the folder definition, with **+drawings** that is ``C:\prod drawings\$scenepath`` on Windows, or ``/Volume/Macintosh HD/prod drawings/$scenepath`` on Macintosh, and you save the scene scene01 in ``+scenes\seq01`` , the project browser will display the same as above, but this time **+drawings** is ``C:\prod drawings\seq01\scene01`` on Windows, or ``/Volume/Macintosh HD/prod drawings/seq01/scene01`` on Macintosh.
es: Si la variable $scenepath es usada en la definición de carpetas, con **+drawings** siendo ``C:\dibujos de prod\$scenepath`` en Windows o ``/Volume/Macintosh HD/dibujos de prod/$scenepath`` en macOS, y se guarda la escena escena01 en ``+scenes\sec01`` , el Explorador de proyectos mostrará lo mismo que arriba, pero esta vez **+drawings** será ``C:\dibujos de prod\sec01\escena01`` en Windows o ``/Volume/Macintosh HD/dibujos de prod/sec01/escena01`` en macOS.
