Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/managing_palettes_and_styles.po
Languages: es, ru

source: Click and drag the palette from the current location to the new one.
es: Hacer clic y arrastrar la paleta desde la ubicación actual hasta la nueva.
ru: Нажмите и перетащите палитру из текущего местоположения в новое.

source: **To load a palette from the Studio Palette to the current level palette:**
es: **Para cargar una paleta desde la Paleta de estudio a la paleta del nivel seleccionado:**
ru: **Чтобы загрузить палитру из палитры Studio в палитру текущего уровня:**

source: Click and drag the palette, from the **Studio Palette Tree** to the **Palette** button (|drag_palette|) in the top bar of the **Palette Editor**.
es: Hacer clic y arrastrar la paleta, desde el **Árbol de paletas** en la Paleta de estudio hasta el botón de **Paleta** (|drag_palette|) en la barra superior del editor de **Paleta** de nivel.
ru: Нажмите и перетащите палитру из **Древа Studio Palette** на кнопку **Палитра** (|drag_palette|) в верхней панели **Редактора палитры**.

source: Right-click the palette you want to use and select **Load into Current Palette** from the menu that opens.
es: Hacer clic derecho sobre la paleta que se desee usar y seleccionar **Cargar en paleta actual** en el menú.
ru: Щелкните правой кнопкой мыши палитру, которую вы хотите использовать, и выберите **Загрузить в текущую палитру** в открывшемся меню.

source: In case the palette misses some styles used to paint the level drawings, you will be prompted whether to delete the styles only and show the lines and areas painted with them in red, or to delete the lines and areas painted with them as well.
es: En caso de que a la paleta le faltaran algunos estilos usados para pintar los dibujos del nivel, se consultará acerca de si sólo borrar los estilos, manteniendo las líneas y áreas pintadas con ellos en *rojo* o si también se deberán borrar.
ru: Если в палитре отсутствуют некоторые стили, используемые для покраски рисунков уровней, вам будет предложено удалить только стили и показать линии и области, закрашенные ими красным, или удалить линии и области, закрашенные их тоже.

source: **To reorder the current palette using a specific Studio Palette as reference:**
es: **Para reorganizar la paleta actual usando una Paleta de estudio como referencia:**
ru: **Чтобы изменить порядок текущей палитры, используя конкретную палитру Studio в качестве образца:**

source: Select the level that uses the palette that has to be modified.
es: Seleccionar el nivel cuya paleta se desee modificar.
ru: Выберите уровень, который использует палитру, которая должна быть изменена.

source: Select into the **Studio Palette** pane the palette you want to use as reference.
es: En el editor de **Paleta de estudio** seleccionar la paleta que se desee usar como referencia.
ru: Выберите в окне **Studio Palette** палитру, которую вы хотите использовать в качестве образца.

source: Right-click the palette and select **Adjust Current Level to This Palette**.
es: Hacer clic derecho sobre la paleta y seleccionar **Ajustar nivel actual a esta paleta**.
ru: Щелкните правой кнопкой мыши палитру и выберите **Отрегулировать текущий уровень до этой палитры**.

source: Insert a **Tolerance** value in the window that opens.
es: Insertar un valor de **Tolerancia** en el diálogo emergente.
ru: Вставьте **Допуск** значение в открывшемся окне.

source: The **Tolerance** parameter defines the range of RGB values that will be used for matching colors from the curret palette to those of the Studio Palette. Default value of 0 means no range use, so just colors with the same RGB values will be reordered and all the others will be added as new colors.
es: El parámetro **Tolerancia** permite definir el rango de valores RVA que será usado al obtener coincidencias entre los colores de la paleta del nivel seleccionado y los de la Paleta de estudio. El valor predefinido 0 significa que no se usará ningún rango, de esta forma sólo los colores con los mismos valores exactos de RVA serán reordenados y todos los demás serán agregados como nuevos estilos.
ru: Параметр **Допуск** определяет диапазон значений RGB, которые будут использоваться для сопоставления цветов от палитры курсора до Studio Palette. Значение по умолчанию 0 означает отсутствие использования диапазона, поэтому только цвета с одинаковыми значениями RGB будут переупорядочены, а все остальные будут добавлены в качестве новых цветов.

source: All the colors of the Studio Palette will be transferred into the current palette, all of this colors will show the **Reference to Studio Palette** box. The colors that are used in both palettes will be ordered, for positon and color index, as in the reference Studio Palette. All the colors that are new into the curent palette will be moved after the last transferred color. Pages will be added when required.
es: Todos los estilos de la Paleta de estudio serán transferidos a la paleta del nivel seleccionado, todos estos estilos contendrán la marca de *referencia* a la Paleta de estudio. Los estilos que sean usados en ambas paletas serán reorganizados, tomando en cuenta su posición e índice de estilo, para respetar los de la Paleta de estudio. Todos los estilos nuevos que se incorporen a la paleta del nivel seleccionado serán movidos a una posición posterior a la del último color transferido. Se agregarán páginas, cuando fuera necesario.
ru: Все цвета Studio Palette будут перенесены в текущую палитру, все эти цвета будут отображаться в поле **Референс на Studio Palette**. Цвета, используемые в обеих палитрах, будут упорядочены по положению и цветовому индексу, как в эталонной Studio Palette. Все цвета, которые являются новыми в текущей палитре, будут перемещены после последнего переданного цвета. Страницы будут добавлены при необходимости.

source: **To merge a palette from the Studio Palette to the current level palette:**
es: **Para fusionar una paleta de la Paleta de estudio con la paleta del nivel seleccionado:**
ru: **Чтобы объединить палитру из Studio Palette с палитрой текущего уровня:**

source: Click and drag the palette from the Studio Palette tree to the level palette.
es: Hacer clic y arrastrar la paleta desde el Árbol de paletas de la Paleta de estudio hacia la paleta del nivel seleccionado.
ru: Нажмите и перетащите палитру из дерева Studio Palette в палитру уровня.

source: Right-click the palette you want to use and select **Merge to Current Palette** from the menu that opens.
es: Hacer clic derecho sobre la paleta que se desee usar y seleccionar la opción **Fusionar en paleta actual**.
ru: Щелкните правой кнопкой мыши палитру, которую вы хотите использовать, и выберите **Объединить с текущей палитрой** в открывшемся меню.

source: **To replace a palette from the Studio Palette with the current palette:**
es: **Para reemplazar una paleta de la Paleta de estudio con la paleta del nivel seleccionado:**
ru: **Чтобы заменить палитру из Studio Palette на текущую палитру:**

source: Select the palette you want modify in the Global Palette, or Project Palette.
es: Seleccionar la paleta que se desee modificar en las carpetas Global Palette o Project Palette.
ru: Выберите палитру, которую вы хотите изменить, в Global Palette или Project Palette.

source: Right-click the palette and select **Replace with Current Palette**.
es: Hacer clic derecho sobre la paleta y seleccionar **Reemplazar con paleta actual**.
ru: Щелкните правой кнопкой мыши палитру и выберите **Заменить текущую палитру**.

source: **To copy styles from the Studio Palette to the current level palette, and vice versa:**
es: **Para copiar estilos desde una Paleta de estudio a la paleta del nivel seleccionado y viceversa:**
ru: **Чтобы скопировать стили из Studio Palette в палитру текущего уровня и наоборот:**

source: Select the palette in the Studio Palette to display it in the palette viewer.
es: Seleccionar una paleta en el editor Paleta de estudio para visualizarla en el visor de paleta.
ru: Выберите палитру в Studio Palette, чтобы отобразить ее в окне просмотра палитры.

source: Select the styles you want to copy in one palette.
es: Seleccionar los estilos que se desee copiar en la paleta.
ru: Выберите стили, которые вы хотите скопировать в одной палитре.

source: Ctrl-click (PC) or Cmd-click (Mac) and drag the selection to the other palette.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) y arrastrar la selección hacia la otra paleta.
ru: Удерживая клавишу Ctrl (PC) или Cmd (Mac), перетащите выделенную область на другую палитру.

source: If you drag the selection to the right of the last page tab, a new page will be created containing the dragged styles.
es: Si se arrastra la selección hacia la derecha de la última solapa de página, se creará una nueva página donde se podrá soltar la selección.
ru: Если вы перетащите выделение справа от последней вкладки страницы, будет создана новая страница, содержащая перетаскиваемые стили.

source: **To activate a Style Link to the studio palette:**
es: **Para activar el Enlace de estilos a la Paleta de estudio:**
ru: **Чтобы активировать ссылку на стиль в Studio Palette:**

source: Select the styles that have been imported from the Studio Palette.
es: Seleccionar los estilos que hayan sido importados desde la Paleta de estudio.
ru: Выберите стили, которые были импортированы из Studio Palette.

source: Right-click the selection and select **Toggle Link to Studio Palette** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Activar/desactivar enlace a paleta de estudio** en el menú.
ru: Щелкните правой кнопкой мыши выделенную область и выберите **Переключить линк на Studio Palette** в открывшемся меню.

source: **To deactivate a style link to the Studio Palette:**
es: **Para desactivar el Enlace de estilos a la Paleta de estudio:**
ru: **Чтобы деактивировать ссылку на стиль в Studio Palette:**

source: Select the styles that have been linked to the Studio Palette.
es: Seleccionar los estilos que se encuentren enlazados a la Paleta de estudio.
ru: Выберите стили, которые были связаны с Studio Palette.

source: **To remove style reference to the Studio Palette:**
es: **Para eliminar la referencia de estilos a la Paleta de estudio:**
ru: **Чтобы удалить ссылку на стиль в Studio Palette:**

source: Select the styles that have a reference to the Studio Palette.
es: Seleccionar los estilos que hagan referencia a la Paleta de estudio.
ru: Выберите стили, которые имеют ссылку на Palette Studio.

source: Right-click the selection and select **Remove Reference to Studio Palette** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Eliminar referencia a paleta de estudio** en el menú.
ru: Щелкните правой кнопкой мыши выделенную область и выберите **Удалить референс на Studio Palette** в открывшемся меню.

source: **To resize the Studio Palette sections:**
es: **Para redimensionar las secciones de la Paleta de estudio:**
ru: **Чтобы изменить размеры разделов Studio Palette:**

source: Click and drag the separator to resize sections.
es: Hacer clic y arrastrar el separador para redimensionar las secciones.
ru: Нажмите и перетащите разделитель, чтобы изменить размеры разделов.

source: Click and drag the separator towards the pane border to hide a section.
es: Hacer clic y arrastrar el separador hacia el borde para ocultar una sección.
ru: Нажмите и перетащите разделитель к границе панели, чтобы скрыть раздел.

source: Click and drag the separator collapsed to the pane border towards the pane center to display again the hidden section.
es: Hacer clic y arrastrar el separador colapsado en el borde del panel hacia el centro del mismo, para volver a mostrar la sección oculta.
ru: Нажмите и перетащите разделитель, свернутый к границе панели, к центру панели, чтобы снова отобразить скрытый раздел.

source: Animating Palettes
es: Animación de paletas
ru: Анимационные палитры

source: For Toonz Vector and Toonz Raster levels, colors in a palette can be animated and changed according to the frames of the Xsheet/Timeline.
es: Es posible animar los colores en una paleta, para niveles de tipo Vectorial de Toonz e Imagen de Toonz, con respecto a los fotogramas absolutos de la Planilla/Línea de tiempo.
ru: Для уровней Toonz Vector и Toonz Raster цвета в палитре можно анимировать и изменять в соответствии с кадрами Xsheet/Timeline.

source: The animation is defined by keys that refer to the absolute timing of the Xsheet/Timeline: this means that there is no relation between the level length and the length of the animation of the palette colors. For example you can create a palette animated from frame 1 to 100 even if its level is only five frames long.
es: La animación se define mediante fotogramas clave que refieren al tiempo absoluto de la Planilla/Línea de tiempo: esto significa que no existirá relación entre la longitud y posición de un nivel y la de la animación de los colores de su paleta. Por ejemplo, será posible crear una paleta animada, desde el fotograma 1 al 100, aún cuando el nivel al cual pertenece tuviera una duración de sólo 5 fotogramas.
ru: Анимация определяется ключами, которые ссылаются на абсолютную синхронизацию Xsheet/Timeline: это означает, что нет никакой связи между длиной уровня и длиной анимации цветов палитры. Например, вы можете создать палитру, анимированную от 1 до 100 кадров, даже если ее уровень составляет всего пять кадров.

source: The color animation will always refer to the Xsheet/Timeline timing, even if you move the related level to a different frame range. For example, if you animate a palette from frame 1 to frame 20, and the level is exposed after frame 20, no color animation will be visible and the color used for the level will refer to the last key of the colors animation.
es: La animación de los estilos siempre se referirá al tiempo de la Planilla/Línea de tiempo, aún en el caso de mover el nivel a un rango de fotogramas distinto. Por ejemplo, si se animara una paleta desde el fotograma 1 al 20, y el nivel estuviera expuesto recién luego del fotograma 20, no se vería ninguna animación en sus colores y el color usado para dicho nivel sería el marcado en el último fotograma clave de la animación de la paleta.
ru: Цветовая анимация всегда ссылается на временные рамки Xsheet/Timeline, даже если вы перемещаете связанный уровень в другой диапазон кадров. Например, если вы анимируете палитру из кадра 1 в кадр 20, а уровень отображается после кадра 20, цветовая анимация не будет видна, а цвет, используемый для уровня, будет ссылаться на последний ключ анимации цветов.

source: Keys are set for *all* the palette Colors and Settings (in the case of **Generated** styles and **Textures**) at once, and can be navigated directly in the **Palette Editor** (with the expected update of the viewer content) to check the color animation.
es: Los fotogramas clave se marcarán a la vez para *todos* los valores de las solapas **Color** y **Opciones** de la paleta, y será posible navegar por los mismos directamente en el editor de **Paleta** (con la esperable actualización en el contenido del Visor) para comprobar su estado en cada instante.
ru: Клавиши установлены для *всех* цветов и настроек палитры (в случае **сгенерированных** стилей и **текстур**) одновременно, и их можно перемещать непосредственно в **редакторе палитры** (с ожидаемым обновлением содержимого окна просмотра) для проверки цветовой анимации.

source: **To define a palette key:**
es: **Para definir un fotograma clave en la paleta:**
ru: **Чтобы определить ключ палитры:**

source: Select in the Xsheet/Timeline the frame where you want to define the key.
es: Seleccionar en la Planilla/Línea de tiempo el fotograma donde se desee definir el fotograma clave.
ru: Выберите в Xsheet/Timeline кадр, в котором вы хотите определить ключ.

source: Click the **Key** button (|key|) in the top bar of the Palette Editor.
es: Hacer clic en el botón **Marcar fotograma clave** (|key|) en la barra superior del editor de Paleta.
ru: Нажмите кнопку **Ключ** (|key|) в верхней панели редактора палитр.

source: **To check if the palette has a key at a specific frame:**
es: **Para comprobar si la paleta contiene un fotograma clave en un fotograma específico:**
ru: **Чтобы проверить, есть ли у палитры ключ в определенном кадре:**

source: Select the frame you want to check: if the **Key** button (|key|) in the top bar of the Palette Editor is blue, the colors have a key at the current frame.
es: Seleccionar el fotograma que se desea comprobar: si el botón **Marcar fotograma clave** (|key|) en la barra superior del editor de Paleta es *azul*, los estilos de la paleta contendrán un fotograma clave en el fotograma actual.
ru: Выберите кадр, который вы хотите проверить: если кнопка **Key** (|key|) в верхней панели редактора палитр синего цвета, у цветов есть клавиша в текущем кадре.

source: **To navigate the palette keys:**
es: **Para navegar por los fotogramas clave de la paleta:**
ru: **Для навигации по клавишам палитры:**

source: Use the **Previous Key** (|next_key|) and **Next Key** buttons (|prevkey|) available at the side of the key button in the top bar of the palette editor.
es: Usar los botones **Clave anterior** (|next_key|) y **Clave siguiente** (|prevkey|), disponibles a los lados del botón **Marcar fotograma clave**, en la barra superior del editor de Paleta.
ru: Используйте кнопки **Следующий ключ** (|next_key|) и **Предыдущий ключ** (|prevkey|), расположенные сбоку от кнопки на верхней панели редактора палитр.

source: **To remove a palette key:**
es: **Para eliminar un fotograma clave de la paleta:**
ru: **Чтобы удалить ключ палитры:**

source: Do one of the following to select the frame you want to remove the key from:
es: Hacer una de las siguientes cosas, para seleccionar el fotograma de donde se desee eliminar el fotograma clave:
ru: Выполните одно из следующих действий, чтобы выбрать кадр, из которого вы хотите удалить ключ:

source: Select it in the Xsheet frame column or the Timeline frame ruler.
es: Seleccionarlo en la columna de fotogramas de la Planilla o la barra de tiempo de la Línea de tiempo.
ru: Выберите его в столбце кадров Xsheet или временной шкалы Timeline.

source: Navigate the palette keys.
es: Navegar por los fotogramas clave de la paleta.
ru: Перемещайтесь по ключам палитры.

source: Click the **Key** button (|key|) in the top bar of the **Palette Editor** to remove it.
es: Hacer clic en el botón **Marcar fotograma clave** (|key|) en la barra superior del editor de **Paleta** para eliminarlo.
ru: Нажмите кнопку **Ключ** (|key|) в верхней панели **редактора палитры**, чтобы удалить ее.

source: Editing Styles
es: Edición de estilos
ru: Редактирование стилей

source: Palette styles can be modified with the Style Editor. There are four types of styles to choose from: **Color**, **Texture**, **Vector** and **Raster**. Under the **Vector** tab, there are the **Generated**, **Trail** and **Vector Brushes** categories, available for Toonz Vector levels only. For several types of styles, there is also control over various styles options in the **Settings** tab.
es: Es posible modificar los estilos de la paletas usando el **Editor de estilos**. Existen cuatro tipos de estilos que pueden ser usados: **Colores**, **Texturas**, **Vectoriales** y **Pinceles** de imagen. Bajo la solapa **Vectoriales** existen las categorías: **Generados**, **Rastros** y **Pinceles vectoriales**, disponibles únicamente en niveles Vectorial de Toonz. Para varios de los tipos de estilos, existe también la posibilidad de controlar varias propiedades desde la solapa **Opciones**.
ru: Стили палитры можно изменить с помощью редактора стилей. Существует четыре типа стилей на выбор: **Цвет**, **Текстура**, **Вектор** и **Растр**. На вкладке **Вектор** есть категории **Сформирован**, **Хвост** и **Векторная кисть**, доступные только для уровней Toonz Vector. Для нескольких типов стилей есть также контроль над различными вариантами стилей на вкладке **Настройки**.

source: An **Auto** button lets you decide whether the edits have to be assigned automatically to the style, or only after you click on the **Apply** button. In the bottom right corner you can see swatches for the previous and new style status; if you want to go back to the previous style, simply click on it.
es: El botón **Auto** permite decidir si al editar un estilo, la modificación se debe aplicar de inmediato a la paleta o si deberá hacerse manualmente usando el botón **Aplicar**. En la parte inferior derecha es posible ver miniaturas del estado *anterior* y *actual* del estilo; en caso de que se desee regresar al estado *anterior* bastará con hacer clic sobre la miniatura correspondiente.
ru: Кнопка **Автоматически** позволяет вам решить, должны ли изменения автоматически назначаться стилю или только после того, как вы нажмете кнопку **Применить**. В правом нижнем углу вы можете увидеть образцы предыдущего и нового стилевого статуса; если вы хотите вернуться к предыдущему стилю, просто нажмите на него.

source: Only the first style in the palette, labeled **Color_0**, cannot be edited: instead, it allows you to remove any style from lines and filled areas.
es: El único estilo de cualquier paleta que no será posible editar, es el primer estilo, llamado **Color_0**: es usado para permitir eliminar cualquier estilo aplicado a líneas o áreas.
ru: Только первый стиль в палитре, помеченный **Color_0**, не может быть отредактирован: вместо этого он позволяет удалить любой стиль из линий и заполненных областей.

source: **To open the Style Editor as a floating window:**
es: **Para abrir el Editor de estilos como una ventana flotante:**
ru: **Чтобы открыть Редактор стилей в виде плавающего окна:**

source: Choose Windows → **Style Editor**.
es: Elegir Ventanas → **Editor de estilos**.
ru: Выберите Окна → **Редактор стилей**.

source: Double-click the style you want to edit in the Palette Editor.
es: Hacer doble clic sobre el estilo que se desee editar en el editor de Paleta.
ru: Дважды щелкните стиль, который вы хотите изменить, в Редакторе палитр.

source: **To automatically apply the editing to the style:**
es: **Para aplicar automáticamente las modificaciones a los estilos:**
ru: **Чтобы автоматически применить редактирование к стилю:**

source: Activate the **Auto** button in the Style Editor.
es: Activar el botón **Auto** en el Editor de estilos.
ru: Активируйте кнопку **Автоматически** в Редакторе стилей.

source: **To apply manually the editing to the style:**
es: **Para aplicar manualmente la modificación hecha a un estilo:**
ru: **Чтобы вручную применить редактирование к стилю:**

source: Deactivate the **Auto** button in the Style Editor.
es: Desactivar el botón **Auto** en el Editor de estilos.
ru: Отключите кнопку **Автоматически** в Редакторе стилей.

source: Click the **Apply** button every time you want to apply the editing to the style.
es: Hacer clic en el botón **Aplicar** cada vez que se desee aplicar la modificación hecha a un estilo.
ru: Нажимайте кнопку **Применить** каждый раз, когда вы хотите применить редактирование к стилю.

source: **To return to the old style cancelling the editing:**
es: **Para regresar al estilo original, cancelando su modificación:**
ru: **Чтобы вернуться к старому стилю, отменив редактирование:**

source: Click the style swatch in the very bottom right corner of the Style Editor.
es: Hacer clic en la miniatura ubicada en la sección inferior derecha del Editor de estilos.
ru: Нажмите образец стиля в самом нижнем правом углу Редактора стилей.

source: Colors
es: Colores
ru: Цвета

source: |style_editor_color|
es: |style_editor_color_es|
