Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/managing_palettes_and_styles.po
Languages: es, ru

source: Colors can be defined either by Hue / Saturation / Value or the Red / Green / Blue values. They can be used for both drawing *lines* and filling *areas*.
es: Es posible definir un color usando tanto sus niveles de Tono / Saturación / Valor, como de Rojo / Verde / Azul. Los colores pueden ser usados para dibujar *líneas* o rellenar *áreas*.
ru: Цвета могут быть определены либо значениями Оттенок/Насыщенность/Значениями красного/синего или зеленого каналов. Их можно использовать как для рисования *линий*, так и для заполнения *областей*.

source: You can also set the opacity with the Alpha slider: the lower the value, the more transparent the color. You can check the opacity of the color with the checkerboard pattern visible beneath the color, whose visibility is proportional to the color transparency.
es: También es posible definir su opacidad, usando el valor de Alfa: cuanto más bajo sea el mismo, más transparente será el color. Es posible comprobar la opacidad del color mediante el patrón de damero visible a través del mismo, cuya visibilidad será proporcional a la transparencia del color.
ru: Вы также можете установить непрозрачность с помощью ползунка Альфа: чем меньше значение, тем прозрачнее цвет. Вы можете проверить непрозрачность цвета с рисунком шахматной доски, видимым под цветом, видимость которого пропорциональна прозрачности цвета.

source: To edit a color you can use either the sliders or the color wheel. To pick a color from the sliders or from the wheel, click it; to adjust values you can use the arrowhead buttons available at each slider ends.
es: Para editar un color es posible usar tanto los deslizadores, como la muestra de color. Para escoger un color usando los deslizadores o la muestra, basta con hacer un clic; para ajustar los valores también será posible usar las flechas a los lados de los deslizadores.
ru: Для редактирования цвета вы можете использовать ползунки или цветовое колесо. Чтобы выбрать цвет из ползунков или колеса, щелкните по нему; чтобы настроить значения, вы можете использовать кнопки со стрелками на каждом конце ползунка.

source: Colors can also be picked from the Viewer content by using the **RGB Picker** tool (|RGB_picker|), whose **Type:** option lets you choose the following: **Normal**, to pick values of a color; **Rectangular**, to pick the average values of the colors included in the box you define; **Freehand**, to pick the average values of the colors included in the area you outline by clicking and dragging; and **Polyline**, to pick the average values of the colors included in the area you outline by defining a series of lines.
es: También es posible escoger colores desde el propio contenido de los dibujos en el Visor, usando la herramienta **Selector de color** (|RGB_picker|), cuya opción **Tipo:** permite escoger de entre las siguientes opciones: **Normal**, para escoger los valores de color de un píxel; **Rectangular**, para escoger el valor promedio de los colores incluidos en el marco rectangular definido; **Lazo**, para escoger el valor promedio de los colores incluidos en la región definida a mano alzada; y **Línea poligonal**, para escoger el valor promedio de los colores incluidos en la región definida mediante segmentos de recta.
ru: Цвета также можно выбирать из содержимого средства просмотра с помощью инструмента **RGB Пипетка** (|RGB_picker|), чья опция **Режим:** позволяет выбрать следующее: **Обычная**, чтобы выбрать значения цвет; **Прямоугольная**, чтобы выбрать средние значения цветов, включенных в поле, которое вы определяете; **От руки**, чтобы выбрать средние значения цветов, включенных в область, которую вы обводите, щелкая и перетаскивая; и **Полилиния**, чтобы выбрать средние значения цветов, включенных в контур, который вы очерчиваете, определив ряд линий.

source: If the current style is not a plain color, the color you edit in the **Color** tab is the color used by the special style. If the special style uses more than one color, you can select the color to edit in the row of thumbnails available below the **Auto** and **Apply** buttons. (see :ref:`Special Styles <special_styles>` ).
es: Si el estilo actual no fuera un color pleno, el color que se edite en la solapa **Color** será uno de los colores usados por algún estilo especial. Si el estilo utilizara más de un color, será posible seleccionar el color a editar desde la fila de miniaturas disponible debajo de los botones **Auto** y **Aplicar**. (ver :ref:`Estilos vectoriales <special_styles>` ).
ru: Если текущий стиль не является простым цветом, цвет, который вы редактируете на вкладке **Цвет**, является цветом, используемым специальным стилем. Если специальный стиль использует более одного цвета, вы можете выбрать цвет для редактирования в строке миниатюр, доступных под кнопками **Автоматически** и **Применить**. (см. :ref:`Специальные стили <special_styles>`).

source: **To pick the color from the viewer content:**
es: **Para escoger un color desde el contenido del Visor:**
ru: **Чтобы выбрать цвет из содержания окна просмотра:**

source: Select the **RGB Picker** tool (|RGB_picker|).
es: Seleccionar la herramienta **Selector de color** (|RGB_picker|).
ru: Выберите инструмент **RGB Пипетка** (|RGB_picker|).

source: Click in the viewer to pick the needed color values.
es: Hacer clic en el visor para escoger los valores de color deseados.
ru: Нажмите в окне просмотра, чтобы выбрать необходимые значения цвета.

source: Set the type to **Rectangular**, then click and drag in the viewer to define a box which picks the average values of the colors included in the box.
es: Definir el Tipo en **Rectangular**, luego hacer clic y arrastrar en el Visor para definir un marco rectangular, para calcular el valor promedio de los colores que queden dentro.
ru: Установите режим **Прямоугольная**, затем щелкните и перетащите в окне просмотра, чтобы определить блок, который выбирает средние значения цветов, включенных в блок.

source: Set the type to **Freehand**, then click and drag in the viewer to outline an area which picks the average values of the colors included in the area.
es: Definir el Tipo en **Lazo**, luego hacer clic y arrastrar en el Visor para definir una región a mano alzada, para calcular el valor promedio de los colores que queden dentro.
ru: Установите режим **От руки**, затем щелкните и перетащите в окне просмотра, чтобы выделить область, которая выбирает средние значения цветов, включенных в область.

source: Set the type to **Polyline**, then click in the viewer to outline an area by defining a series of lines and this will pick the average values of the colors included in the area.
es: Definir el Tipo en **Línea poligonal**, luego hacer clic en el Visor para definir una región mediante varios segmentos de recta, para calcular el valor promedio de los colores que queden dentro.
ru: Установите режим **Полилиния**, затем щелкните в средстве просмотра, чтобы очертить область, задав серию линий, и при этом будут выбраны средние значения цветов, включенных в область.

source: Textures
es: Texturas
ru: Текстуры

source: |style_editor_texture|
es: |style_editor_texture_es|

source: Textures can be used both for drawing *lines* and filling *areas*. They can be selected from a list available in the **Texture** tab, where your own textures can be added as well, or custom textures can be added by clicking the **Custom Texture** button.
es: Es posible usar texturas tanto para dibujar *líneas* como para rellenar *áreas*. Éstas pueden ser seleccionadas a partir de una lista disponible en la solapa *Texturas*, donde también es posible agregar nuevas texturas, o texturas personalizadas, usando el botón **Textura personalizada**.
ru: Текстуры можно использовать как для рисования *линий*, так и для заливки *областей*. Их можно выбрать из списка, доступного на вкладке **Текстура**, где также можно добавить свои собственные текстуры или добавить пользовательские текстуры, нажав кнопку **Пользовательская текстура**.

source: Texture styles can be used both in Toonz Vector and Toonz Raster levels, but only when applied to Toonz Raster levels they react to the settings values in the **Settings** tab (see :ref:`Texture Settings <texture_settings>` ).
es: Los estilos con texturas pueden ser usados tanto en niveles Vectorial de Toonz como de Imagen de Toonz, pero sólo cuando estén aplicadas a niveles de Imagen de Toonz reaccionarán a las propiedades de la solapa **Opciones** (ver :ref:`Opciones de texturas <texture_settings>` ).
ru: Стили текстур можно использовать как на уровнях Toonz Vector, так и на уровне Toonz Raster, но только применительно к уровням Toonz Raster они реагируют на значения настроек на вкладке **Настройки** (см. :ref:`Настройки текстуры <texture_settings>`).

source: Image sequences can also be loaded as textures, provided they follow the OpenToonz rules for being detected as such. In the case an image sequence is loaded as a texture their frames will change with each new frame of the Xsheet/Timeline, and will cycle when it reaches its last frame.
es: También es posible cargar secuencias de imágenes como texturas, siempre y cuando sigan las reglas de OpenToonz para ser detectadas como tales. En caso de que una secuencia de imágenes sea cargada como textura, sus fotogramas cambiarán con cada nuevo fotograma de la Planilla/Línea de tiempo, y volverá a empezar cuando alcance su último fotograma.
ru: Последовательности изображений также можно загружать в виде текстур, при условии, что они следуют правилам OpenToonz для обнаружения в качестве таковых. В случае, когда последовательность изображений загружается в качестве текстуры, их кадры будут меняться с каждым новым кадром Xsheet/Timeline, и будут циклически повторяться, когда достигнут последний кадр.

source: **To add a new texture to the Texture library:**
es: **Para agregar una nueva textura a la biblioteca de texturas:**
ru: **Чтобы добавить новую текстуру в библиотеку текстур:**

source: Create the image you want to use as a texture with the following characteristics:
es: Crear la imagen que se desee usar como textura, con las siguientes características:
ru: Создайте изображение, которое вы хотите использовать в качестве текстуры со следующими характеристиками:

source: The number of pixels of the width and height of the image has to be equal to 2 to the power of any number (i.e. 2, 4, 8, 16, 32, 64, 128, 256, etc.); if not, texture images will show stretched.
es: La cantidad de píxeles del ancho y la altura de la imagen deberá ser el cuadrado de un número (p.ej: 2, 4, 8, 16, 32, 64, 128, 256, etc.); en caso contrario quedará estirada al ser aplicada.
ru: Количество пикселов ширины и высоты изображения должно быть равно 2 степени любого числа (то есть 2, 4, 8, 16, 32, 64, 128, 256 и т. д.); если нет, текстуры будут отображаться растянутыми.

source: The file has to be saved in any of the following formats: TIF, TGA, PNG, BMP, JPG, NOL, RGB and SGI.
es: El archivo debe estar guardado en uno de los siguientes formatos: TIF, TGA, PNG, BMP, JPG, NOL, RGB y SGI.
ru: Файл должен быть сохранен в любом из следующих форматов: TIF, TGA, PNG, BMP, JPG, NOL, RGB и SGI.

source: Save the texture file in one of the following folders: ``<projectroot>\library\textures`` or ``Opentoonz stuff\library\textures`` (see :ref:`Setting up Projects <setting_up_projects>` ).
es: Guardar el archivo de la textura en la siguiente carpeta: ``Opentoonz stuff\library\textures`` (ver :ref:`Creación de proyectos <setting_up_projects>` ).
ru: Сохраните файл текстуры в одной из следующих папок: ``<projectroot>\library\textures`` или ``Opentoonz stuff\library\textures`` (см. :ref:`Настройка проектов <setting_up_projects>`).

source: Custom Textures
es: Texturas personalizadas
ru: Пользовательские текстуры

source: Custom textures can be loaded for drawing both *lines* and filling *areas*. The custom texture will be saved into the Palette and its icon will be replaced with an icon of the loaded texture.
es: Es posible cargar texturas personalizadas tanto para dibujar *líneas*, como para rellenar *áreas*. La textura personalizada será almacenada en el editor de Paleta y su ícono será reemplazado con un ícono correspondiente a la imagen cargada.
ru: Пользовательские текстуры могут быть загружены для рисования как *линий*, так и заливки *областей*. Пользовательская текстура будет сохранена в палитре, а ее значок будет заменен значком загруженной текстуры.

source: **To add a custom texture:**
es: **Para cargar una textura personalizada:**
ru: **Чтобы добавить пользовательскую текстуру:**

source: Select a style in the Palette editor.
es: Seleccionar un estilo en el editor de Paleta.
ru: Выберите стиль в Редакторе палитр.

source: Go in the **Texture** tab of the Style Editor and press the **Custom Texture** button.
es: Ir a la solapa **Texturas** del Editor de estilos y presionar el botón **Textura personalizada**.
ru: Перейдите на вкладку **Текстура** в редакторе стилей и нажмите кнопку **Пользовательская текстура**.

source: Go in the **Settings** tab, use the **Load From File** field and choose the image (or image sequence) you want to use as texture.
es: Ir a la solapa **Opciones**, usar el campo **Cargar desde archivo** y elegir la imagen (o secuencia de imágenes) que se desee usar como textura.
ru: Перейдите на вкладку **Настройки**, используйте поле **Загрузить из файла...** и выберите изображение (или последовательность изображений), которое вы хотите использовать в качестве текстуры.

source: In Toonz Raster levels, press the **Preview** button to visualize the texture.
es: Al aplicar texturas a niveles de Imagen de Toonz, es posible presionar el botón **Previsualizar** en el Visor, para visualizar la textura.
ru: На уровнях Toonz Raster нажмите кнопку **Предпросмотр**, чтобы визуализировать текстуру.

source: Texture Mapping
es: Mapeo de texturas
ru: Наложение текстур

source: Texture mapping is the way the texture is applied to the *lines* or *areas* using the style. It's applied differently either if the level is a Toonz Vector or Toonz Raster one:
es: Mapeo de texturas es la forma en que una textura es aplicada a las *líneas* o *áreas* que usan un determinado estilo. Se aplicará de forma distinta si el nivel se tratara de uno Vectorial de Toonz o de Imagen de Toonz:
ru: Отображение текстуры - это способ применения текстуры к *линиям* или *областям* с использованием стиля. Он применяется по-разному, в зависимости уровень является Toonz Vector или Toonz Raster:

source: **Toonz Vector**: Texture mapping is performed using the vector stroke parametric coordinates; this means that for *lines* the texture automatically “follows” the stroke's shape and thickness, whether for *areas* the texture image is tiled to cover the area painted with the style.
es: **Vectorial de Toonz**: El mapeo de texturas será realizado usando las coordenadas paramétricas de los trazos vectoriales; esto significa que en el caso de las *líneas* la textura "seguirá" a la forma y el grosor del trazo, mientras que en el caso de las *áreas* la imagen de la textura será repetida hasta cubrir el área pintada con el estilo.
ru: **Toonz Vector**: отображение текстуры выполняется с использованием параметрических координат векторного обводки; это означает, что для *линий* текстура автоматически «следует» за формой и толщиной обводки, будь то для *областей* изображение текстуры мозаично, чтобы покрыть область, окрашенную стилем.

source: **Toonz Raster**: Texture mapping is performed using standard mapping coordinates; this means that the texture image is tiled to cover the lines or areas painted with the style.
es: **Imagen de Toonz**: El mapeo de texturas será realizado usando coordenadas de mapeo estándar; esto significa que la imagen de la textura será repetida hasta cubrir las *líneas* o *áreas* pintadas con el estilo.
ru: **Toonz Raster**: отображение текстуры выполняется с использованием стандартных координат отображения; это означает, что изображение текстуры мозаично, чтобы покрыть линии или области, нарисованные стилем.

source: A more powerful texture mapping can be performed by using the **Texture** and **Pinned Texture** special FX (see :ref:`Toonz Level <toonz_level>` ).
es: Es posible realizar un mapeo de texturas más potente mediante el uso de los efectos **Texture** y **Pinned Texture** (ver :ref:`Toonz Level <toonz_level>` ).
ru: Более мощное наложение текстур можно выполнить с помощью специальных текстур **Текстура** и **Pinned Texture** (см. :ref:`Уровень Toonz <toonz_level>`).

source: Texture Settings
es: Opciones de texturas
ru: Настройки текстур

source: Textures applied to styles used in Toonz Raster levels allow to set various parameters such as:
es: Cuando las texturas se encuentran aplicadas a estilos usados en niveles de Imagen de Toonz, es posible controlar varios parámetros, como:
ru: Текстуры, применяемые к стилям, используемым в уровнях Toonz Raster, позволяют устанавливать различные параметры, такие как:

source: **Use As Pattern**, allows to use the brightness of the image to modulate the brightness of the plain Color of the style to which it is applied.
es: **Usar como patrón**, permite usar la luminosidad de la imagen para modular la luminosidad del **Color** del estilo al cual es aplicada la textura.
ru: **Use As Pattern**, позволяет использовать яркость изображения для модуляции яркости простого цвета стиля, к которому он применяется.

source: **Position**, allows to control how the texture is applied to the drawing. Options include: **Fixed** (the texture will be fixed and slide when the character moves), **Automatic** (the texture will follow the character's position during the animation) and **Random** (the texture position will change at each frame in a random way);
es: **Posición**, permite controlar cómo se aplica la textura al dibujo. Las opciones incluyen: **Fija** (la textura estará fija y el personaje se deslizará a través de ella al moverse), **Automática** (la textura seguirá a la posición del personaje durante la animación) y **Aleatoria** (la posición de la textura cambiará en cada fotograma de forma aleatoria);
ru: **Position**, позволяет контролировать, как текстура применяется к рисунку. Опции включают в себя: **FIXED** (текстура будет фиксироваться и скользить при перемещении персонажа), **AUTOMATIC** (текстура будет следовать позиции персонажа во время анимации) и **RANDOM** (позиция текстуры будет изменить в каждом кадре случайным образом);

source: **Scale**, allows to set the scale of the texture pattern.
es: **Escala**, permite definir la escala del patrón de la textura.
ru: **Scale**, позволяет установить масштаб рисунка текстуры.

source: **Rotation**, allows to set a rotation angle to the texture pattern.
es: **Rotación**, permite definir un ángulo de rotación del patrón de la textura.
ru: **Rotation**, позволяет установить угол поворота для текстуры рисунка.

source: **X displ** and **Y displ**, allow to offset the texture pattern horizontally or vertically.
es: **Despl X** y **Despl Y**, permite desplazar el patrón de la textura de forma horizontal o vertical.
ru: **X displ** и **Y displ**, позволяют сместить рисунок текстуры по горизонтали или по вертикали.

source: **Contrast**, allows to change the contrast of the image applied as texture.
es: **Contraste**, permite cambiar el contraste de la imagen aplicada como textura.
ru: **Contrast**, позволяет изменить контраст изображения, применяемого в качестве текстуры.

source: Generated Styles
es: Generados
ru: Сгенерированные стили

source: |style_editor_generated|
es: |style_editor_generated_es|

source: Generated styles use a number of mathematical functions to create effects that can be used either for vector strokes or for filling areas defined by vectors. They can be selected from a list available in the Generated section of the Vector tab, where styles suitable for vector strokes have a thumbnail representing how they will look as a diagonal line; styles suitable for filling have a thumbnail representing the top right corner piece of an area.
es: Los estilos **Generados** utilizan una cantidad de funciones matemáticas para crear efectos, que pueden ser usados tanto para dibujar trazos vectoriales, como para rellenar áreas definidas por trazos vectoriales. Pueden ser seleccionados desde una lista disponible en la sección **Generados** de la solapa **Vectoriales**, donde los estilos apropiados para dibujar *trazos* presentan una miniatura mostrando cómo lucirían aplicados a una línea diagonal; mientras que los apropiados para rellenar *áreas* presentan una miniatura mostrando cómo lucirían aplicados al relleno de la esquina superior derecha de un área.
ru: Сгенерированные стили используют ряд математических функций для создания эффектов, которые можно использовать как для векторных линий, так и для заполнения областей, определенных векторами. Их можно выбрать из списка, доступного в разделе Сформирован на вкладке Вектор, где стили, подходящие для векторных штрихов, имеют миниатюру, представляющую, как они будут выглядеть в виде диагональной линии; стили, подходящие для заполнения, имеют миниатюру, представляющую верхний правый угол области.

source: Generated styles can simulate for instance a frieze, a leaf, or a pencil stroke along a vector, or allow you to fill areas with special effects such as polka dots.
es: Mediante estilos **Generados** es posible, por ejemplo, simular un friso, una hoja, un trazo de lápiz; así como también rellenar áreas con efectos como lunares, mosaicos, etc.
ru: Сгенерированные стили могут имитировать, например, фриз, лист растения или мазок карандашом вдоль вектора, или позволяют заполнять области специальными эффектами, такими как узор в горошек.

source: Generated styles can be customized by defining the parameters available in the Settings tab. This allows you to have many similar styles, each with a different configuration of settings.
es: Es posible personalizar los estilos **Generados** mediante el control de parámetros disponibles en la solapa **Opciones**. Esto permite, por ejemplo, obtener varios estilos similares, donde cada uno presente ciertas diferencias con respecto a los demás.
ru: Сгенерированные стили могут быть настроены путем определения параметров, доступных на вкладке Настройки. Это позволяет вам иметь много похожих стилей, каждый из которых имеет свою конфигурацию настроек.

source: Colors used by generated styles can be modified by using the Color tab available in the Style Editor.
es: Los colores usados por los estilos **Generados** pueden ser modificados usando la solapa **Color**, disponible en el Editor de estilos.
ru: Цвета, используемые сгенерированными стилями, можно изменить с помощью вкладки Цвет, доступной в Редакторе стилей.

source: The first item available in the list allows you to remove the Generated style, in order to return it to a Color style.
es: El primer elemento disponible en la lista permite remover cualquier estilo **Generado** aplicado previamente, permitiendo volver a usar sólo un **Color** para ese estilo.
ru: Первый элемент, доступный в списке, позволяет удалить сгенерированный стиль, чтобы вернуть его к цветному стилю.

source: **To change colors used by a generated style:**
es: **Para cambiar los colores usados por un estilo Generado:**
ru: **Чтобы изменить цвета, используемые сгенерированным стилем:**

source: Move to the Color tab in the Style Editor.
es: Seleccionar la solapa **Color** en el Editor de estilos.
ru: Перейдите на вкладку Цвет в Редакторе стилей.

source: Edit the color using the wheel and sliders.
es: Editar el color usando la muestra y los deslizadores.
ru: Отредактируйте цвет, используя колесо и ползунки.
