Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/managing_palettes_and_styles.po
Languages: es, ru

source: Editing Several Styles at the Same Time
es: Edición de varios estilos a la vez
ru: Редактирование нескольких стилей одновременно

source: You can modify several styles at the same time by using the **Palette Gizmo**. It allows you to scale or shift the value, saturation, hue and alpha of the selected styles, blend them, or fade them to a specific color.
es: Es posible modificar varios estilos a la vez, mediante el uso del **Asistente de paleta**. Mediante su uso es posible escalar o desplazar el valor, saturación, tono y alfa de los estilos seleccionados, degradarlos o fundirlos a un color específico.
ru: Вы можете изменить несколько стилей одновременно, используя **Палитра Gizmo**. Он позволяет масштабировать или сдвигать значение, насыщенность, оттенок и альфа выбранных стилей, смешивать их или затемнять до определенного цвета.

source: |palette_gizmo|
es: |palette_gizmo_es|

source: Only the **Color** styles are affected by the **Palette Gizmo** editing and the blending. e.g. Generated and Trail styles will not be affected.
es: Sólo los estilos de tipo **Color** serán afectados por las ediciones realizadas en el **Asistente de paleta** (por ejemplo, los estilos Generados o Rastros no lo serán)
ru: Редактирование **Палитра Gizmo** и смешивание влияют только на стили **Цвет**. например Сформирован и Хвост стили не будут затронуты.

source: **To open the Palette Gizmo:**
es: **Para abrir el Asistente de paleta:**
ru: **Чтобы открыть палитру Gizmo:**

source: Right-click the selected styles and choose **Palette Gizmo** from the menu that opens.
es: Hacer clic derecho sobre los estilos seleccionados en el editor de Paleta y elegir **Asistente de paleta** en el menú.
ru: Щелкните правой кнопкой мыши выбранные стили и выберите **Палитра Gizmo** в открывшемся меню.

source: **To change the value of the selected styles:**
es: **Para cambiar el valor de los estilos seleccionados:**
ru: **Чтобы изменить значения выбранных стилей:**

source: Set the percentage of variation or the shift magnitude you want to apply to the styles value.
es: Definir el porcentaje de variación o la magnitud del desplazamiento que se desee aplicar al valor de los estilos.
ru: Установите процент изменения или величину сдвига, которую вы хотите применить к значению стилей.

source: Click the **+** button to increase the value on the set percentage or shift magnitude.
es: Hacer clic en el botón **+** para aumentar el valor, en el porcentaje o magnitud deseados.
ru: Нажмите на кнопку **+**, чтобы увеличить значение на заданный процент или величину сдвига.

source: Click the **-** button to decrease the value on the set percentage or shift magnitude.
es: Hacer clic en el botón **-** para disminuir el valor, en el porcentaje o magnitud deseados.
ru: Нажмите кнопку **-**, чтобы уменьшить значение на заданный процент или величину сдвига.

source: **To change the saturation of the selected styles:**
es: **Para cambiar la saturación de los estilos seleccionados:**
ru: **Чтобы изменить насыщенность выбранных стилей:**

source: Set the percentage of variation or the shift magnitude you want to apply to the styles saturation.
es: Definir el porcentaje de variación o la magnitud del desplazamiento que se desee aplicar a la saturación de los estilos.
ru: Установите процент изменения или величину сдвига, которую вы хотите применить к насыщенности стилей.

source: Click the **+** button to increase the saturation on the set percentage or shift magnitude.
es: Hacer clic en el botón **+** para aumentar la saturación, en el porcentaje o magnitud deseados.
ru: Нажмите кнопку **+**, чтобы увеличить насыщенность на заданный процент или величину сдвига.

source: Click the **-** button to decrease the saturation on the set percentage or shift magnitude.
es: Hacer clic en el botón **-** para disminuir la saturación, en el porcentaje o magnitud deseados.
ru: Нажмите кнопку **-**, чтобы уменьшить насыщенность на установленный процент или величину сдвига.

source: **To change the hue of the selected styles:**
es: **Para cambiar el tono de los estilos seleccionados:**
ru: **Чтобы изменить оттенок выбранных стилей:**

source: Set the shift magnitude you want to apply to the styles hue.
es: Definir el porcentaje de variación o la magnitud del desplazamiento que se desee aplicar al tono de los estilos.
ru: Установите величину смещения, которую вы хотите применить к оттенкам стилей.

source: Click the **+** button to increase the hue on the set shift magnitude.
es: Hacer clic en el botón **+** para aumentar el tono, en el porcentaje o magnitud deseados.
ru: Нажмите кнопку **+**, чтобы увеличить оттенок на установленную величину сдвига.

source: Click the **-** button to decrease the hue on the set shift magnitude.
es: Hacer clic en el botón **-** para disminuir el tono, en el porcentaje o magnitud deseados.
ru: Нажмите кнопку **-**, чтобы уменьшить оттенок установленной величины сдвига.

source: **To change the alpha of the selected styles:**
es: **Para cambiar el alfa de los estilos seleccionados:**
ru: **Чтобы изменить значение альфа-канала выбранных стилей:**

source: Set the percentage of variation or the shift magnitude you want to apply to the styles alpha.
es: Definir el porcentaje de variación o la magnitud del desplazamiento que se desee aplicar al alfa de los estilos.
ru: Установите процент изменения или величину сдвига, которую вы хотите применить к стилям альфа.

source: Click the **+** button to increase the alpha on the set percentage or shift magnitude.
es: Hacer clic en el botón **+** para aumentar el alfa, en el porcentaje o magnitud deseados.
ru: Нажмите кнопку **+**, чтобы увеличить альфа на заданном проценте или величине сдвига.

source: Click the **-** button to decrease the alpha on the set percentage or shift magnitude.
es: Hacer clic en el botón **-** para disminuir el alfa, en el porcentaje o magnitud deseados.
ru: Нажмите кнопку **-**, чтобы уменьшить альфа на установленный процент или величину сдвига.

source: **To blend selected styles:**
es: **Para degradar los estilos seleccionados:**
ru: **Чтобы смешать выбранные стили:**

source: Select a set of styles in the **Palette Editor**.
es: Seleccionar un conjunto de estilos en el **Editor de paleta**.
ru: Выделите ряд стилей в **Редакторе палитры**.

source: Click the **Blend** button: style colors will be blended from the first to the last color of the selected styles.
es: Hacer clic en el botón **Degradar**: se creará un degradado con los estilos seleccionados, desde el color del primer estilo hasta el del último.
ru: Нажмите кнопку **Однородно**: цвета стилей будут смешиваться от первого до последнего цвета выбранных стилей.

source: **To fade the selected styles to a specific color:**
es: **Para fundir los estilos seleccionados a un color específico:**
ru: **Затемнить выбранные стили к определенному цвету:**

source: Choose the color you want to fade the selection to by doing one of the following:
es: Elegir el color al que se desee fundir la selección, haciendo una de las siguientes cosas:
ru: Выберите цвет, к которому хотите добавить затемнение, выполнив одно из следующих действий:

source: Set the **Red**, **Green** and **Blue** values.
es: Definir los valores de **Rojo**, **Verde**, **Azul** y **Alfa**.
ru: Установите значения каналов **Красный**, **Зеленый** и **Синий**.

source: Click the color thumbnail and use the Style Editor to edit it (see :ref:`Plain Colors <plain_colors>` ).
es: Hacer clic en la miniatura de color y usar el Editor de estilos para elegir el color (ver :ref:`Colores plenos <plain_colors>` ).
ru: Нажмите на миниатюру цвета и используйте Редактор стилей, чтобы отредактировать его (см. :ref:`Простые цвета <plain_colors>`).

source: Set the percentage of the fading you want to apply to the styles.
es: Definir el porcentaje de fusión que se desee aplicar a los estilos.
ru: Установите процент затемнения, который вы хотите применить к стилям.

source: Click the **Fade** button to fade styles to the set color, according to the set percentage.
es: Hacer clic en el botón **Fundir** para fundir los estilos seleccionados al color escogido, de acuerdo al porcentaje especificado.
ru: Нажмите кнопку **Затухание**, чтобы добавить стили к заданному цвету в соответствии с заданным процентом.

source: Using the Name Editor
es: Uso del Editor de nombres
ru: Использование Редактора имен

source: The **Name Editor** allows to systematize the naming of styles used in a production, by defining preset names for **Character**, **Part** and **Suffix**. In that way, styles in a palette can easily be given significant names that will ease its use later on the production.
es: El **Editor de nombres** permite sistematizar la nomenclatura de estilos usados en una producción, mediante la definición de nombres predefinidos para **Personaje**, **Parte** y **Sufijo**. De esta manera es posible asignar, de una forma práctica, nombres significativos a los estilos de una paleta, lo que facilitará su uso en etapas posteriores de la producción.
ru: **Редактор имен** позволяет систематизировать наименования стилей, используемых в производстве, путем определения предустановленных имен для **Character**, **Часть** и **Суффикс**. Таким образом, стилям в палитре могут быть легко присвоены важные имена, что облегчит их использование в дальнейшем.

source: |name_editor|
es: |name_editor_es|

source: Currently there's no standard separator character inserted between the different preset names used, so if you want to have those separated by an underscore, for example, you should insert that character at the beginning or end of the different names in each category, as shown in the image above.
es: Actualmente no existe la posibilidad de definir un separador estándar para ser insertado entre los distintos nombres predefinidos usados, de manera que si se deseara, por ejemplo, separarlo con un guion bajo (**_**), este carácter debería insertarse siempre al comienzo o final de cada uno de los nombres de cada categoría, tal como se muestra en la imagen superior.
ru: В настоящее время нет стандартного символа-разделителя, вставляемого между различными именами предустановок, поэтому, если вы хотите, чтобы они разделялись, например, подчеркиванием, вы должны вставить этот символ в начале или в конце разных имен в каждом категория, как показано на рисунке выше.

source: **To open the Name Editor:**
es: **Para abrir el Editor de nombres:**
ru: **Чтобы открыть Редактор имен:**

source: Right-click in the **Palette Editor** and choose **Name Editor** from the menu that opens.
es: Hacer clic derecho en el **editor de Paleta** y elegir **Editor de nombres** en el menú.
ru: Щелкните правой кнопкой мыши в **Редакторе палитр** и выберите **Редактор имен** в открывшемся меню.

source: **To delete a preset name:**
es: **Para borrar un nombre predefinido:**
ru: **Чтобы удалить имя предустановки:**

source: Right-click over the desired *preset name* and choose **Remove** from the menu that opens.
es: Hacer clic derecho sobre el **nombre predefinido** deseado y elegir **Eliminar** en el menú.
ru: Щелкните правой кнопкой мыши на желаемом *имени предустановки* и выберите **Удалить** в открывшемся меню.

source: Color
ru: Цвет
