Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/managing_palettes_and_styles.po
Languages: es, ru

source: Use the **Paste Color & Name** command to paste styles kept in memory, over the styles selected in the palette, overwriting their content. If the selection contains less styles than those kept in memory, styles in excess will be ignored; if the selection contains more styles than those kept in memory, styles in excess will be left as they are.
es: Usar el comando **Pegar color y nombre** para pegar los estilos mantenidos en memoria, sobre los estilos seleccionados en la paleta, sobrescribiendo su contenido. Si la selección contuviera menos estilos que aquellos mantenidos en memoria, los estilos sobrantes serán ignorados; si la selección contuviera más estilos que los mantenidos en memoria, los estilos sobrantes se mantendrán intactos.
ru: Используйте команду **Вставить цвет и имя**, чтобы вставить стили, хранящиеся в памяти, поверх стилей, выбранных в палитре, и перезаписать их содержимое. Если выбор содержит меньше стилей, чем хранится в памяти, избыточные стили будут игнорироваться; если выборка содержит больше стилей, чем хранится в памяти, избыток стилей останется без изменений.

source: Use the **Paste Color** command to paste the red, green, blue and alpha values of the styles kept in memory in the styles selected in the palette, preserving their name. If the selection contains less styles than those kept in memory, styles in excess will be ignored; if the selection contains more styles than those kept in memory, styles in excess will be left as they are.
es: Usar el comando **Pegar color** para pegar los valores de rojo, verde, azul y alfa de los estilos mantenidos en memoria, sobre los estilos seleccionados en la paleta, conservando su nombre. Si la selección contuviera menos estilos que aquellos mantenidos en memoria, los estilos sobrantes serán ignorados; si la selección contuviera más estilos que los mantenidos en memoria, los estilos sobrantes se mantendrán intactos.
ru: Используйте команду **Вставить цвет** для вставки красного, зеленого, синего и альфа-значений стилей, хранящихся в памяти, в стили, выбранные в палитре, с сохранением их имени. Если выбор содержит меньше стилей, чем хранится в памяти, избыточные стили будут игнорироваться; если выборка содержит больше стилей, чем хранится в памяти, избыток стилей останется без изменений.

source: Use the **Paste Name** command to paste the names of the styles kept in memory in the styles selected in the palette, preserving their colors. If the selection contains less styles than those kept in memory, styles in excess will be ignored; if the selection contains more styles than those kept in memory, styles in excess will be left as they are.
es: Usar el comando **Pegar nombre** para pegar los nombres de los estilos mantenidos en memoria, sobre los estilos seleccionados en la paleta, conservando su color. Si la selección contuviera menos estilos que aquellos mantenidos en memoria, los estilos sobrantes serán ignorados; si la selección contuviera más estilos que los mantenidos en memoria, los estilos sobrantes se mantendrán intactos.
ru: Используйте команду **Вставить имя**, чтобы вставить имена стилей, сохраненных в памяти, в стили, выбранные в палитре, сохранив их цвета. Если выбор содержит меньше стилей, чем хранится в памяти, избыточные стили будут игнорироваться; если выборка содержит больше стилей, чем хранится в памяти, избыток стилей останется без изменений.

source: Use the **Delete** command to delete selected styles.
es: Usar el comando **Borrar** para borrar los estilos seleccionados.
ru: Используйте команду **Удалить**, чтобы удалить выбранные стили.

source: All the **Edit** menu commands are also available in the menu that opens when right-clicking the selection.
es: Todos los comandos del menú **Editar** se encuentran también disponibles en el menú contextual que se abre al hacer clic derecho sobre la selección.
ru: Все команды меню **Правка** также доступны в меню, которое открывается при щелчке правой кнопкой мыши на выбранном элементе.

source: **To move selected styles:**
es: **Para mover los estilos seleccionados:**
ru: **Для перемещения выбранных стилей:**

source: Ctrl-click (PC) or Cmd-click (Mac) and drag the selection to the new position; the insertion point is marked while you drag.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) y arrastrar la selección a una nueva posición; el punto de inserción se marcará mientras se está arrastrando.
ru: Ctrl-клик (PC) или Cmd-клик (Mac) и перетащите выделение на новую позицию; точка вставки отмечена во время перетаскивания.

source: **To move selected styles into a different page:**
es: **Para mover los estilos seleccionados a otra página:**
ru: **Чтобы переместить выбранные стили на другую страницу:**

source: Ctrl-click (PC) or Cmd-click (Mac) and drag the selection to the tab of the page where you want to put selected styles.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) y arrastrar la selección hasta la solapa de la página donde se desee mover los estilos seleccionados.
ru: Удерживая клавишу Ctrl (PC) или Cmd (Mac), перетащите выделенную область на вкладку страницы, на которую нужно поместить выбранные стили.

source: **To move styles into a new page:**
es: **Para mover estilos a una nueva página:**
ru: **Чтобы переместить стили на новую страницу:**

source: Ctrl-click (PC) or Cmd-click (Mac) and drag the selection to the right of the last page tab: a new page will be created containing the dragged styles.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) y arrastrar la selección hasta la derecha de la última etiqueta: se creará una nueva página donde se podrá soltar la selección.
ru: Удерживая клавишу Ctrl (PC) или Cmd (Mac), перетащите выделенную область справа от последней вкладки страницы: будет создана новая страница, содержащая перетаскиваемые стили.

source: **To remove all the unused styles:**
es: **Para eliminar todos los estilos no usados:**
ru: **Чтобы удалить все неиспользуемые стили:**

source: Right-click in the palette and choose **Remove Unused Styles** from the menu that opens.
es: Hacer clic derecho en la paleta y elegir **Borrar estilos no usados** en el menú.
ru: Щелкните правой кнопкой мыши в палитре и выберите **Удаление неиспользуемых стилей** в открывшемся меню.

source: **To add a new page:**
es: **Para agregar una nueva página:**
ru: **Чтобы добавить новую страницу:**

source: Click the **New Page** button (|new_page|) in the top bar of the Palette Editor.
es: Hacer clic en el botón **Nueva página** (|new_page|) en la barra superior del editor de Paleta.
ru: Нажмите кнопку **Новая страница** (|new_page|) в верхней панели редактора палитр.

source: Right-click in the palette area where page tabs are displayed and choose **New Page** from the menu that opens.
es: Hacer clic derecho en el área del editor de Paleta donde se encuentran las solapas de páginas y elegir **Nueva página** en el menú.
ru: Щелкните правой кнопкой мыши в области палитры, где отображаются вкладки страниц, и выберите **Новая страница** в открывшемся меню.

source: **To name a page:**
es: **Para renombrar una página:**
ru: **Чтобы назвать страницу:**

source: Double-click the page name to edit it.
es: Hacer doble clic en el nombre de la página, para editarlo.
ru: Дважды щелкните имя страницы, чтобы изменить его.

source: **To move a page:**
es: **Para mover una página:**
ru: **Чтобы переместить страницу:**

source: Click and drag the page tab to the new position.
es: Hacer clic y arrastrar la solapa de la página a una nueva posición.
ru: Нажмите и перетащите вкладку страницы на новую позицию.

source: **To delete a page:**
es: **Para borrar una página:**
ru: **Чтобы удалить страницу:**

source: Right-click the page tab and choose **Delete Page** from the menu that opens. The current page cannot be deleted.
es: Hacer clic derecho en la solapa de la página y elegir **Borrar página** en el menú. La página seleccionada no podrá ser borrada.
ru: Щелкните правой кнопкой мыши вкладку страницы и выберите **Удалить страницу** в открывшемся меню. Текущая страница не может быть удалена.

source: Using the Studio Palette
es: Uso de la Paleta de estudio
ru: Применение Studio Palette

source: |studio_palette|
es: |studio_palette_es|

source: The Studio Palette allows you to store and manage an unlimited number of palettes. It is intended as a library of character and prop palettes related to one or more specific productions. From here Palettes, or Styles contained in them, can be *retrieved*, *assigned*, or *merged* to the current level palette, with no need to define the same styles again and again.
es: La **Paleta de estudio** permite almacenar y administrar una cantidad ilimitada de paletas. Su propósito es servir como biblioteca de paletas de personajes y utilería relativas a una o más producciones. Desde este editor será posible *recuperar*, *asignar* o *fusionar* paletas (o estilos contenidos en las mismas), hacia la paleta del nivel seleccionado, sin necesidad de volver a crear los mismos estilos y paletas una y otra vez.
ru: Studio Palette позволяет хранить и управлять неограниченным количеством палитр. Он предназначен в качестве библиотеки палитр персонажей и персонажей, связанных с одним или несколькими конкретными произведениями. Отсюда палитры или содержащиеся в них стили могут быть *извлечены*, *назначены* или *объединены* с палитрой текущего уровня, без необходимости определять одни и те же стили снова и снова.

source: It consists of a Palette Tree and a Palette Viewer: the **Palette Tree** lists two main folders: **Global Palettes** and **Project Palettes**, and all the folders and palettes you add; the **Palette Viewer** displays the currently selected palette and allows you to edit it as a standard palette (see :ref:`The Palette Window <the_palette_window>` ).
es: Consiste en un Árbol de paletas y un Visor de paletas: el **Árbol de paletas** lista dos carpetas principales: **Global Palettes** (paletas globales) y **Project Palettes** (paletas del proyecto), y todas las carpetas y paletas que allí sean agregadas; el **Visor de paletas** muestra la paleta seleccionada y permite editarla como cualquier paleta estándar (ver :ref:`El editor de Paleta <the_palette_window>` ).
ru: Он состоит из Дерева палитр и Окна просмотра палитр: в **Дереве палитр** приведены две основные папки: **Global Palettes** и **Project Palettes**, а также все папки и палитры, которые вы добавляете; **Окно просмотра палитр** отображает текущую выбранную палитру и позволяет редактировать ее как стандартную палитру (см. :ref:`Окно палитры <the_palette_window>`).

source: Any level palette can be added to the Studio Palette; if a **Color Model** is defined for that level, it will be saved along with the palette and retrieved any time that palette will be assigned to a level (see :ref:`Using a Color Model <using_a_color_model>` ).
es: Cualquier paleta de nivel puede ser agregada a la Paleta de estudio; si hubiera un **Modelo de color** definido para ese nivel, el mismo será guardado conjuntamente con la paleta y recuperado toda vez que la misma sea asignada a un nivel (ver :ref:`Uso de un Modelo de color <using_a_color_model>` ).
ru: Палитра любого уровня может быть добавлена ​​в Studio Palette; если для этого уровня определена **Цветовая модель**, она будет сохранена вместе с палитрой и извлечена каждый раз, когда палитра будет назначена уровню (см. :ref:`Использование цветовой модели <using_a_color_model>`).

source: Palettes added to the **Global Palettes** folder will be available in the Studio Palette in any OpenToonz session, regardless of the current project.
es: Las paletas agregadas a la carpeta **Global Palettes** estarán disponibles en la Paleta de estudio en cualquier sesión de OpenToonz, cualquiera sea el proyecto activo.
ru: Палитры, добавленные в папку **Global Palettes**, будут доступны в Studio Palette в любом сеансе OpenToonz независимо от текущего проекта.

source: Palettes added to the **Project Palettes** folder will be available only when the current project is the relevant one. For example if your current project is *Production One*, and you add some palettes to the **Project Palettes** folder, those palettes will be available only when the current project is *Production One*.
es: Las paletas agregadas a la carpeta **Project Palettes** estarán disponibles sólo cuando el correspondiente proyecto se encuentre activo. Por ejemplo, si el proyecto activo fuera *Producción Uno* y se agregaran algunas paletas a la carpeta **Project Palettes**, esas paletas estarán disponibles sólo cuando el proyecto activo sea *Producción Uno*.
ru: Палитры, добавленные в папку **Project Palettes**, будут доступны только в том случае, если текущий проект является релевантным. Например, если ваш текущий проект - *Проект 1*, и вы добавили несколько палитр в папку **Project Palettes**, эти палитры будут доступны, только если текущим проектом является *Проект 1*.

source: If you want to add to the **Studio Palette** a series of palettes you have previously created and stored in a folder, you can also automatically retrieve them by searching that specific folder.
es: Si se desea agregar una serie de paletas, previamente creadas y almacenadas en una carpeta, al editor **Paletas de estudio**, también es posible recuperarlas automáticamente buscándolas en esa carpeta específica.
ru: Если вы хотите добавить в **Studio Palette** серию палитр, которые вы ранее создали и сохранили в папке, вы также можете автоматически получить их, выполнив поиск в этой конкретной папке.

source: Styles that are imported from the **Studio Palette** to the palette of the current level are marked with a *small white square*. This reference can be used to link styles to the original Studio Palette styles: the link can be activated or deactivated anytime for any selection of styles.
es: Los estilos que son importados desde la **Paleta de estudio** a la paleta del nivel seleccionado quedan marcados con un *pequeño cuadrado blanco*. Esta marca de referencia puede ser usada para enlazar estilos a los estilos originales en la Paleta de estudio: es posible activar o desactivar este enlace en cualquier momento, para cualquier selección de estilos.
ru: Стили, импортированные из **Studio Palette** в палитру текущего уровня, отмечены *белым квадратиком*. Эта ссылка может использоваться для связи стилей с оригинальными стилями Studio Palette: ссылка может быть активирована или деактивирована в любое время для любых выделенных стилей.

source: |regular-imported-linked_style|
es: |regular-imported-linked_style_es|

source: When the link is activated, an arrow is displayed on the small white square, and the style will be updated according to the original Studio Palette style. When the link is deactivated, the style can be modified regardless of the original Studio Palette style.
es: Cuando el enlace se encuentre activo, se mostrará una flecha en el *pequeño cuadrado blanco* y el estilo será actualizado de acuerdo a los cambios en el estilo original de la Paleta de estudio. Cuando el enlace se encuentre desactivado, será posible modificar el estilo de forma independiente al original en la Paleta de estudio.
ru: Когда ссылка активирована, на маленьком белом квадрате отображается стрелка и стиль будет обновляться в соответствии с оригинальным стилем Studio Palette. Когда ссылка деактивирована, стиль может быть изменен независимо от исходного стиля Studio Palette.

source: Linking animation level palettes to the Studio Palette can assure color consistency for the whole production, because as soon as a change is needed, it can be done in the Studio Palette, automatically updating all the linked animation levels palettes and, consequently, drawings.
es: Es posible asegurar la consistencia del color a lo largo de una producción, enlazado las paletas de los niveles de animación a la Paleta de estudio, ya que tan pronto como se necesite realizar un cambio, éste puede ser hecho directamente en la Paleta de estudio, actualizando así automáticamente a todos los niveles de animación con paletas enlazadas y, por consecuencia, a los dibujos que las usen.
ru: Связывание палитр уровней анимации с Studio Palette может обеспечить согласованность цветов для всего производства, поскольку, как только требуется изменение, это можно сделать в Studio Palette, автоматически обновляя все связанные палитры уровней анимации и, следовательно, рисунки.

source: In the level palette, the information about which Studio Palette the palette styles refers to can be retrieved in the **List View** mode, where, next to the style thumbnails and names, the path to the source studio palette is displayed.
es: En la Paleta de nivel, al usar la **Vista de lista**, es posible obtener a continuación del nombre de cada estilo, información acerca de a qué paleta de la Paleta de estudio se encuentra enlazado el mismo, pudiéndose ver su ruta a la paleta original de estudio.
ru: В палитре уровня информацию о том, на какую студийную палитру ссылаются стили палитры, можно получить в режиме **Посмотреть список**, где рядом с миниатюрами и именами стилей отображается путь к исходной Studio Palette.

source: When palettes are added to **Global Palettes**, they are copied to the **studiopalette** folder located where OpenToonz projects are stored (see :ref:`Setting up Projects <setting_up_projects>` ).
es: Cuando una paleta es agregada a **Global Palettes**, será copiada a la carpeta **studiopalette** ubicada en la carpeta ``OpenToonz stuff`` (ver :ref:`Creación de proyectos <setting_up_projects>` ).
ru: Когда палитры добавляются в **Global Palettes**, они копируются в папку **studiopalette**, в которой хранятся проекты OpenToonz (см. :ref:`Настройка проектов <setting_up_projects>`).

source: When palettes are added to **Project Palettes**, they are copied to the **+palettes** folder you specified for the current project (see :ref:`Project Default Folders <project_default_folders>` ).
es: Cuando una paleta es agregada a **Project Palettes**, será copiada a la carpeta **+palettes** definida para el proyecto activo (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).
ru: Когда палитры добавляются в **Project Palettes**, они копируются в папку **+palettes**, указанную для текущего проекта (см. :ref:`Папки проекта по умолчанию <project_default_folders>`).

source: These folders can be used, for example, to move your Studio Palette, or the Project Palette, to a different network, or to make a backup copy of it.
es: Es posible acceder a estas carpetas, por ejemplo, para mover las Paletas globales o las Paletas del proyecto a otra red o para realizar una copia de respaldo de las mismas.
ru: Эти папки можно использовать, например, для перемещения вашей Studio Palette или Project Palettes в другую сеть или для создания ее резервной копии.

source: **To add an empty palette:**
es: **Para agregar una paleta vacía:**
ru: **Чтобы добавить пустую палитру:**

source: Select the folder where you want to create the new palette.
es: Seleccionar la carpeta donde se desee crear la nueva paleta.
ru: Выберите папку, в которой вы хотите создать новую палитру.

source: Right-click the folder where you want to locate the palette and choose **New Palette** from the menu that opens.
es: Hacer clic derecho sobre dicha carpeta y elegir **Nueva paleta** en el menú.
ru: Щелкните правой кнопкой мыши папку, в которой вы хотите разместить палитру, и выберите **Новая палитра** в открывшемся меню.

source: **To name a palette:**
es: **Para renombrar una paleta:**
ru: **Чтобы назвать палитру:**

source: Double click its name and type a new name.
es: Hacer doble clic sobre su nombre e ingresar uno nuevo.
ru: Дважды щелкните его имя и введите новое имя.

source: **To view a palette in the Studio Palette:**
es: **Para visualizar una paleta en la Paleta de estudio:**
ru: **Для просмотра палитры в Studio Palette:**

source: Select it in the **Palette Tree**.
es: Seleccionarla en el **Árbol de paletas**.
ru: Выберите его в **Palette Tree**.

source: **To add a level palette to the Studio Palette:**
es: **Para agregar una paleta de nivel a la Paleta de estudio:**
ru: **Чтобы добавить палитру уровня в Studio Palette:**

source: Select the level to display its palette.
es: Seleccionar el nivel para visualizar su paleta.
ru: Выберите уровень, чтобы отобразить его палитру.

source: Click the **Palette** button (|drag_palette|) in the top bar of the palette editor and drag the current palette to the **Studio Palette** folder where you want to locate it. The palette will retain its name.
es: Hacer clic en el botón de **Paleta** (|drag_palette|) en la barra superior del editor de Paleta y arrastrarla hasta la carpeta de la **Paleta de estudio** donde se la desee ubicar. La paleta conservará su nombre.
ru: Нажмите кнопку **Палитра** (|drag_palette|) в верхней панели редактора палитр и перетащите текущую палитру в папку **Studio Palette**, где вы хотите ее найти. Палитра сохранит свое имя.

source: Add an empty palette in the Studio Palette editor, right-click it and select **Replace with Current Palette** from the menu that opens.
es: Agregar una paleta vacía en el editor de Paleta de estudio, hacer clic derecho y seleccionar la opción **Reemplazar con paleta actual** en el menú.
ru: Добавьте пустую палитру в редакторе Studio Palette, щелкните ее правой кнопкой мыши и выберите **Заменить текущую палитру** в открывшемся меню.

source: **To add palettes by searching in a computer folder:**
es: **Para agregar paletas buscándolas en una carpeta del sistema:**
ru: **Чтобы добавить палитры путем поиска в папке на компьютере:**

source: Select the folder where you want to place palettes retrieved during the search.
es: En el **Árbol de paletas** seleccionar la carpeta donde se desee ubicar las paletas obtenidas durante la búsqueda.
ru: Выберите папку, в которую вы хотите поместить палитры, полученные во время поиска.

source: Right-click the folder and select **Search for Palettes** from the menu that opens.
es: Hacer clic derecho en la carpeta y seleccionar **Buscar paletas** en el menú.
ru: Щелкните правой кнопкой мыши папку и выберите **Поиск палитр** в открывшемся меню.

source: Browse to the computer folder you want to scan.
es: Ir hasta la carpeta del sistema que se desee explorar.
ru: Найдите папку на компьютере, которую хотите отсканировать.

source: **To add a new folder:**
es: **Para agregar una nueva carpeta:**
ru: **Чтобы добавить новую папку:**

source: Select the folder where you want to create the new folder.
es: En el **Árbol de paletas** seleccionar la carpeta donde se desee crear la nueva carpeta.
ru: Выберите папку, в которой вы хотите создать новую папку.

source: Right-click the folder where you want to locate your new folder and choose **New Folder** from the menu that opens.
es: Hacer clic derecho en la carpeta y seleccionar **Nueva carpeta** en el menú.
ru: Щелкните правой кнопкой мыши папку, в которой вы хотите найти новую папку, и выберите **Новая папка** в открывшемся меню.

source: **To name a folder:**
es: **Para renombrar una carpeta:**
ru: **Чтобы назвать папку:**

source: **To delete a palette or a folder:**
es: **Para borrar una paleta o una carpeta:**
ru: **Чтобы удалить палитру или папку:**

source: Right-click the palette or the folder you want to delete and choose **Delete Palette** from the menu that opens.
es: Hacer clic derecho en la paleta o carpeta que se desee borrar y seleccionar **Borrar paleta/carpeta** en el menú.
ru: Щелкните правой кнопкой мыши палитру или папку, которую вы хотите удалить, и выберите **Удалить палитру** в открывшемся меню.

source: **To rearrange palettes in the Studio Palette folders:**
es: **Para reorganizar paletas en las carpetas de la Paleta de estudio:**
ru: **Чтобы переставить палитры в папках Studio Palette:**
