Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/managing_palettes_and_styles.po
Languages: es, ru

source: Managing Palettes and Styles
es: Administración de paletas y estilos
ru: Управление палитрами и стилями

source: In OpenToonz, Toonz Vector and Toonz Raster animation levels comes with their own palette, containing styles that can be used to *draw lines* and *paint lines and areas*. Raster levels, on the contrary, can be just edited by using the styles available in the **Raster Drawing Palette**, that is shared by all of the raster levels in the project.
es: En OpenToonz, los niveles de animación de tipo Vectorial de Toonz y de Imagen de Toonz contienen su propia paleta, conteniendo estilos que pueden ser usados para *dibujar líneas* y *pintar líneas y áreas*. Los niveles de Imagen normales, en cambio, pueden ser editados usando los estilos disponibles en la paleta llamada **Raster Drawing Palette**, que es común a todos los niveles de imagen del mismo proyecto.
ru: В OpenToonz уровни анимации Toonz Vector и Toonz Raster имеют собственную палитру, содержащую стили, которые можно использовать для *рисования линий* и *рисования линий и областей*. Напротив, растровые уровни можно редактировать, используя стили, доступные в **Палитре растровых рисунков**, которая используется всеми растровыми уровнями в проекте.

source: In Toonz Vector and Toonz Raster levels, palette styles are interactively “linked” to drawn *lines* and filled *areas* by using indexes. The main advantage of this method is that if you edit a style of the palette, all the lines and filled areas using that style will be automatically updated. This allows you to change or calibrate colors, even after the painting process has been done, without having to correct the style line by line, or area by area in the image.
es: En niveles Vectorial de Toonz e Imagen de Toonz, los estilos de la paleta se encuentran "vinculados" interactivamente a las *líneas* dibujadas y las *áreas* rellenas, mediante el uso de índices. La principal ventaja de este método es que si se edita posteriormente un estilo de la paleta, todas las líneas y áreas pintadas con dicho estilo serán automáticamente actualizadas. Esto permite cambiar o calibrar los colores, aún luego de que el proceso de pintado haya sido realizado, sin necesitar corregir el estilo en la imagen, línea por línea o área por área.
ru: На уровнях Toonz Vector и Toonz Raster стили палитры интерактивно «связаны» с нарисованными *линиями* и заполненными *областями* с помощью индексов. Основным преимуществом этого метода является то, что если вы редактируете стиль палитры, все линии и заполненные области, использующие этот стиль, будут автоматически обновляться. Это позволяет изменять или калибровать цвета даже после завершения процесса рисования без необходимости корректировать стиль строка за строкой или область за областью изображения.

source: In Raster levels, palette styles are simply used to draw or touch up the image, and no link exists between the styles and the already drawn lines. This palette, named **Raster Drawing Palette**, is shared by all the Raster levels belonging to a specific project and is stored in the **+palettes** project default folder (see :ref:`Project Default Folders <project_default_folders>` ).
es: En los niveles de Imagen normales, los estilos de la paleta son usados simplemente para dibujar o retocar la imagen, sin guardar ningún tipo de "vínculo" entre los estilos y lo ya dibujado. Esta paleta, llamada **Raster Drawing Palette**, es compartida por todos los niveles de Imagen pertenecientes a un mismo proyecto y es almacenada en la carpeta predefinida **+palettes** del proyecto (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).
ru: В растровых уровнях стили палитры просто используются для рисования или корректировки изображения, и между стилями и уже нарисованными линиями не существует никакой связи. Эта палитра с именем **Raster Drawing Palette** используется всеми уровнями растра, принадлежащими определенному проекту, и хранится в папке проекта **+palettes** по умолчанию (см. :ref:`Папки проекта по умолчанию <project_default_folders>`).

source: All the editing performed in palettes and styles is not saved until you save the related Toonz level, the palette itself, or the **Save All** command is used (see :ref:`Saving Levels <saving_levels>` ).
es: Cualquier edición realizada en las paletas y estilos permanecerá en memoria y no será guardada hasta que el nivel correspondiente sea guardado, la paleta en sí misma sea guardada, o se utilice el comando **Guardar todos los niveles** o **Guardar todo** (ver :ref:`Guardado de niveles <saving_levels>` ).
ru: Все изменения, выполняемые в палитрах и стилях, не сохранятся до тех пор, пока вы не сохраните соответствующий уровень Toonz, саму палитру или команду **Сохранить все** (см. :ref:`Сохранение уровней<saving_levels>`).

source: The Palette Editor
es: El editor de Paleta
ru: Редактор палитры

source: The Palette Editor displays the styles of the current animation level that are (or can be) used, to draw and paint the level.
es: El editor de Paleta muestra los estilos del nivel de animación actual, que se encuentran en uso o pueden ser usados para dibujar y pintar en el mismo.
ru: Редактор палитр отображает стили текущего уровня анимации, которые (или могут быть) использованы для рисования и поскраски уровня.

source: |palette|
es: |palette_es|

source: The default palette of any new **Toonz Vector** level contains only the plain black color; the default palette of a **Toonz Raster** level contains either the plain black color, for new levels, or the colors recognized during the cleanup process, for cleaned up levels from scans. Any palette always contains the **Color_0** item, that allows you to remove any style from *lines* and filled *areas*.
es: De forma predefinida, la paleta de un nuevo nivel **Vectorial de Toonz** contendrá sólo el color negro; la de un nivel de **Imagen de Toonz** contendrá, o bien sólo el color negro, en el caso de niveles nuevos, o los colores reconocidos durante el proceso de limpieza, en el caso de niveles escaneados y limpiados. En cualquier caso, una paleta siempre contendrá el elemento **Color_0**, que permite eliminar cualquier estilo de *líneas* y *áreas* rellenas.
ru: Палитра по умолчанию любого нового уровня **Toonz Vector** содержит только простой черный цвет; палитра по умолчанию уровня **Toonz Raster** содержит либо простой черный цвет для новых уровней, либо цвета, распознаваемые в процессе очистки, для очищенных уровней от сканирования. Любая палитра всегда содержит элемент **Color_0**, который позволяет удалить любой стиль из *линий* и заполненных *областей*.

source: Each palette can contain up to 4096 styles.
es: Cada paleta puede estar compuesta por hasta 4096 estilos.
ru: Каждая палитра может содержать до 4096 стилей.

source: Styles in the Palette Editor can be displayed in different modes:
es: En el editor de Paleta es posible visualizar los estilos en diferentes modos:
ru: Стили в Редакторе палитр могут отображаться в разных режимах:

source: **Small Thumbnails View** displays styles as small squares. The style index is displayed at the bottom right corner. Full name of the style can be displayed as a tooltip.
es: **Vista de miniaturas pequeñas** permite visualizar los estilos como rectángulos de tamaño pequeño. El índice del estilo se muestra en la esquina inferior derecha. El nombre completo del estilo puede verse como una descripción, al posar el puntero sobre el estilo.
ru: Просмотр в режиме **Маленьких иконок** отображает стили в виде маленьких квадратов. Индекс стиля отображается в правом нижнем углу. Полное имя стиля может отображаться в виде всплывающей подсказки.

source: **Medium Thumbnails View** displays styles as medium squares. You can read the first letters of the name of the style directly inside the chips; the style index is displayed at the bottom right corner. Full name of the style can be displayed as a tooltip.
es: **Vista de miniaturas medianas** permite visualizar los estilos como rectángulos de tamaño mediano. Es posible leer las primeras letras del nombre del estilo directamente sobre el estilo; el índice del estilo se muestra en la esquina inferior derecha. El nombre completo del estilo puede verse como una descripción, al posar el puntero sobre el estilo.
ru: Просмотр в режиме **Средних иконок** отображает стили в виде средних квадратов. Вы можете прочитать первые буквы названия стиля прямо внутри фишек; индекс стиля отображается в правом нижнем углу. Полное название стиля может отображаться в виде всплывающей подсказки.

source: **Large Thumbnails View** displays styles as large squares. You can read the first letters of the name of the style directly inside the chips; the style index is displayed at the bottom right corner. Full name of the style can be displayed as a tooltip.
es: **Vista de miniaturas grandes** permite visualizar los estilos como rectángulos de tamaño grande. Es posible leer las primeras letras del nombre del estilo directamente sobre el estilo; el índice del estilo se muestra en la esquina inferior derecha. El nombre completo del estilo puede verse como una descripción, al posar el puntero sobre el estilo.
ru: Просмотр в режиме **Больших иконок** отображает стили в виде больших квадратов. Вы можете прочитать первые буквы названия стиля прямо внутри фишек; индекс стиля отображается в правом нижнем углу. Полное название стиля может отображаться в виде всплывающей подсказки.

source: **List View** displays style thumbnails next to their names in a list; the index of the style is displayed as a tooltip. If the palette styles refer to a studio palette, its path will be displayed along with the style name (see :ref:`Using the Studio Palette <using_the_studio_palette>` ).
es: **Vista de lista** permite visualizar pequeñas miniaturas junto a sus nombres, en forma de lista; el índice del estilo puede verse como una descripción, al posar el puntero sobre el mismo. Si los estilos de la paleta hicieran referencia a una paleta de estudio, su ruta será mostrada junto con el nombre del mismo (ver :ref:`Uso de la Paleta de estudio <using_the_studio_palette>` ).
ru: Просмотр в режиме **Посмотреть список** отображает миниатюры стилей рядом с их именами в списке; индекс стиля отображается в виде всплывающей подсказки. Если стили палитры ссылаются на Studio Palette, ее путь будет отображаться вместе с именем стиля (см. :ref:`Использование Studio Palette <using_the_studio_palette>`).

source: By default the Palette editor is *active*, that means that it automatically displays the styles of the current animation level, but it can be made *inactive* in order not to be updated when you select a different level. In this way, by opening more than one Palette editor it will be possible to simultaneously compare and edit several palettes referring to different animation levels.
es: De forma predefinida, los editores de **Paleta** se encuentran *activos*, esto significa que mostrarán de forma automática los estilos del nivel de animación seleccionado, sin embargo es posible dejarlos *inactivos*, para que no se actualicen al seleccionar otro nivel. De esta manera, abriendo más de un editor de **Paleta**, será posible comparar y editar simultáneamente las paletas de varios niveles de animación.
ru: По умолчанию редактор палитр *активен*, это означает, что он автоматически отображает стили текущего уровня анимации, но его можно сделать *неактивным*, чтобы не обновляться при выборе другого уровня. Таким образом, открыв более одного редактора палитр, можно будет одновременно сравнивать и редактировать несколько палитр, относящихся к разным уровням анимации.

source: Palettes also can be saved as independent files in TPL format to be loaded back into the scene to retrieve colors, or to be used with the **External Palette** effect (see :ref:`Using the File Browser <using_the_file_browser>` and :ref:`External Palette <external_palette>` ).
es: Es posible guardar paletas como archivos independientes, en formato TPL, que podrán ser cargados luego en una escena para recuperar colores o para ser usados con el efecto **External Palette** (ver :ref:`Uso del Explorador de archivos <using_the_file_browser>` y :ref:`External Palette <external_palette>` ).
ru: Палитры также могут быть сохранены как независимые файлы в формате TPL для загрузки обратно в сцену для получения цветов или для использования с эффектом **Внешняя палитра** (см. :ref:`Использование файлового браузера <using_the_file_browser>` и :ref:`Внешняя палитра <external_palette>`).

source: Most of the palette editing described below can be applied to the **Palette** viewer available in the **Studio Palette** as well (see :ref:`Using the Studio Palette <using_the_studio_palette>` ).
es: También es posible aplicar la mayoría de los procedimientos de edición de paletas, descriptos más abajo, al visor de **Paleta** disponible en la **Paleta de estudio** (ver :ref:`Uso de la Paleta de estudio <using_the_studio_palette>` ).
ru: Большая часть редактирования палитры, описанного ниже, может быть применима и к средству просмотра **Палитра**, доступному в **Studio Palette** (см. :ref:`Использование Studio Palette <using_the_studio_palette>`).

source: **To change the palette display mode:**
es: **Para cambiar el modo de visualización de la paleta:**
ru: **Чтобы изменить режим отображения палитры:**

source: Do one of the following:
es: Hacer una de las siguientes cosas:
ru: Выполните одно из следующих действий:

source: Click the option button (|option|) on the right of the top bar of the **Palette Editor**, and choose a display mode from the menu that opens.
es: Hacer clic en el botón de opciones (|option|) a la derecha de la barra superior del editor de **Paleta** y elegir un modo de visualización en el menú.
ru: Нажмите кнопку параметров (|option|) справа от верхней панели **Редактора палитры** и выберите режим отображения в открывшемся меню.

source: Use the standard zoom **+** or **-** shortcut keys in the **Palette Editor** to increase or decrease the styles chips size.
es: Usar los atajos normalmente usados para controlar el zoom (**+** o **-**) en el editor de **Paleta**, para aumentar o disminuir el tamaño de las miniaturas de estilos.
ru: Используйте стандартные горячие клавиши **+** или **-** в **Редакторе палитр**, чтобы увеличить или уменьшить размер фишек стилей.

source: **To make the Palette editor inactive or active:**
es: **Para hacer que un editor de Paleta quede activo o inactivo:**
ru: **Чтобы сделать Редактор палитры неактивным или активным:**

source: Click the **Switch** button (|switch|) on the right of the **Palette Editor** title bar.
es: Hacer clic en el botón de **Encendido** (|switch|) a la derecha de la barra de título del editor de **Paleta**.
ru: Нажмите кнопку **Switch** (|switch|) справа от строки заголовка **Редактора палитр**.

source: **To save a palette with a different name in a different location:**
es: **Para guardar una paleta con un nombre y ubicación distintos:**
ru: **Чтобы сохранить палитру под другим именем в другом месте:**

source: Click the **Save Palette As** button (|save_as|) in the top bar of the **Palette Editor**.
es: Hacer clic en el botón **Guardar paleta como** (|save_as|) en la barra superior del editor de **Paleta**.
ru: Нажмите кнопку **Сохранить палитру как** (|save_as|) в верхней панели **Редактора палитр**.

source: In the browser that opens choose a location and name for the palette you want to save, and click the **Save** button.
es: En el Explorador emergente elegir una ubicación y un nombre para la paleta que se desee guardar y hacer clic en el botón **Guardar**.
ru: В открывшемся браузере файлов выберите местоположение и имя палитры, которую вы хотите сохранить и нажмите кнопку **Сохранить**.

source: The **Save Palette As** command creates a copy of the palette with a different file name and location, but does not change the name and location of the palette used in the scene.
es: El comando **Guardar paleta como** crea una copia de la paleta con un nombre de archivo y ubicación distintos, pero no cambia el nombre y ubicación de la paleta usada en la escena.
ru: Команда **Сохранить палитру как** создает копию палитры с другим именем файла и местоположением, но не меняет имя и расположение палитры, используемой в сцене.

source: Arranging Palette Styles and Pages
es: Orden de estilos y páginas en una paleta
ru: Организация стилей и страниц палитры

source: Palette styles can be added, named, reordered and arranged in pages. They can be copied and pasted from one position to another, or from one palette to another.
es: Es posible agregar, renombrar, reordenar y separar en páginas a los estilos de una paleta. También es posible copiarlos y pegarlos de una posición a otra, o de una paleta a otra.
ru: Стили палитры могут быть добавлены, названы, переупорядочены и расположены на страницах. Их можно копировать и вставлять из одной позиции в другую или из одной палитры в другую.

source: When styles used for painting drawings are **Cut**, lines and areas painted with them will be displayed in **red**; if they are **Deleted**, you will be prompted whether to delete the styles only and show the lines and areas painted with them in red, or to delete the lines and areas painted with them as well.
es: Cuando a los estilos usados para pintar dibujos se les aplica la operación **Cortar**, las líneas y áreas pintadas con ellos serán mostradas en *rojo*; en caso de aplicárseles la operación **Borrar**, se consultará acerca de si sólo borrar los estilos (y mostrar las líneas y áreas que lo usaban en *rojo*) o si se debe borrarlas también.
ru: Когда для рисования рисунков используются стили **Вырезать**, линии и области, закрашенные ими, будут отображаться **красным**; если они **удалены**, вам будет предложено удалить только стили и показать линии и области, закрашенные ими красным, или также удалить линии и области, закрашенные ими.

source: **To select a style:**
es: **Para seleccionar un estilo:**
ru: **Чтобы выбрать стиль:**

source: Click it in the **Palette Editor**.
es: Hacer clic en el editor de **Paleta**.
ru: Нажмите на его в **Редакторе палитры**.

source: Use the number keys on the main or numerical keyboards to select the corresponding style.
es: Usar las teclas numéricas del teclado para seleccionar el estilo correspondiente.
ru: Используйте цифровые клавиши на основной или цифровой клавиатуре, чтобы выбрать соответствующий стиль.

source: When in **Medium/Large Thumbnails View** a visual cue of which key shortcut corresponds to which style is shown on the upper center of each style chip.
es: En los modos de visualización **Vista de miniaturas medianas/grandes** se mostrará, en el centro superior de cada estilo, un número indicando el atajo de teclado que deberá presionarse para seleccionarlo.
ru: При отображении **средних или больших иконок** визуальная подсказка того, какая комбинация клавиш соответствует стилю, отображается в верхнем центре каждого чипа стиля.

source: In case of having more than 10 styles in the current palette, you can use the **Tab key** on the keyboard to switch to the next bank of 10 styles.
es: En caso de tener una paleta con más de 10 estilos, es posible usar la tecla **Tab** en el teclado, para cambiar al siguiente banco de 10 estilos.
ru: Если в текущей палитре более 10 стилей, вы можете использовать клавишу **Tab** на клавиатуре, чтобы переключиться на следующий банк из 10 стилей.

source: **To select multiple styles:**
es: **Para seleccionar varios estilos:**
ru: **Чтобы выбрать несколько стилей:**

source: Shift-click to extend the selection.
es: Hacer Mayúsculas + clic para extender la selección.
ru: Shift-клик, чтобы расширить выделение.

source: Ctrl-click (PC) or Cmd-click (Mac) to add a style to, or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o remover un estilo de la selección.
ru: Нажмите, удерживая нажатой клавишу Ctrl (PC) или Cmd (Mac), чтобы добавить стиль или удалить его из выделения.

source: **To add a new style:**
es: **Para agregar un nuevo estilo:**
ru: **Чтобы добавить новый стиль:**

source: Click the **New Style** button (|new_style|) in the top bar of the palette editor.
es: Hacer clic en el botón **Nuevo estilo** (|new_style|) en la barra superior del editor de **Paleta**.
ru: Нажмите кнопку **Новый стиль** (|new_style|) в верхней панели редактора палитры.

source: **To name a style:**
es: **Para renombrar un estilo:**
ru: **Чтобы назвать стиль:**

source: When styles are displayed in **Medium/Large Thumbnails View** or **List View** modes, double-click the style name to edit it.
es: Cuando los estilos están siendo visualizados en los modos **Vista de miniaturas medianas/grandes** o **Vista de lista**, hacer doble clic sobre el nombre del estilo para editarlo.
ru: Когда стили отображаются в режимах **Средние или большие иконки** или **Посмотреть список**», дважды щелкните имя стиля, чтобы отредактировать его.

source: **To edit palette styles with the Edit menu commands:**
es: **Para editar estilos de una paleta usando los comandos del menú Editar:**
ru: **Чтобы отредактировать стили палитры с помощью команд меню Правка:**

source: Select the styles you want to edit.
es: Seleccionar los estilos que se desee editar.
ru: Выберите стили, которые вы хотите редактировать.

source: Do any of the following:
es: Hacer una de las siguientes cosas:
ru: Выполните любое из следующих действий:

source: Use the **Cut** command to eliminate selected styles from the palette and keep them in memory for further operations.
es: Usar el comando **Cortar** para eliminar los estilos seleccionados de la paleta y mantenerlos en memoria para posteriores operaciones.
ru: Используйте команду **Вырезать**, чтобы удалить выбранные стили из палитры и сохранить их в памяти для дальнейших операций.

source: Use the **Copy** command to keep in memory selected styles for further operations.
es: Usar el comando **Copiar** para copiar los estilos seleccionados y mantenerlos en memoria para posteriores operaciones.
ru: Используйте команду **Копировать**, чтобы сохранить выбранные стили в памяти для дальнейших операций.

source: Use the **Paste Insert** command to paste styles kept in memory in the palette, after the currently selected style. **Cut** styles will be added preserving their indexes; **Copied** styles will be added using new indexes.
es: Usar el comando **Pegar (insertar)** para pegar los estilos mantenidos en memoria en la paleta, luego del estilo actualmente seleccionado. Los estilos **Cortados** serán agregados preservando sus índices, los **Copiados** lo harán usando nuevos índices.
ru: Используйте команду **Вставить вставку**, чтобы вставить стили, хранящиеся в памяти в палитре, после выбранного в данный момент стиля. **Вырезанные** стили будут добавлены с сохранением их индексов; **Скопированные** стили будут добавлены с использованием новых индексов.
