Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/production_workflow.po
Languages: es

source: Production Workflow
es: Proceso de producción

source: Traditional Workflow
es: Proceso tradicional de producción

source: The following is an example of how OpenToonz allows the management of a traditional animation production.
es: El siguiente es un ejemplo de cómo OpenToonz posibilita la administración de una producción de animación tradicional.

source: |traditional_workflow|
es: |traditional_workflow_es|

source: Scanning
es: Escaneo

source: Hand-drawn elements are first defined in an OpenToonz Xsheet, and then acquired by using a scanner. These elements can consist of animation levels, i.e. sequences of drawings belonging to the same animation, or background images and overlays.
es: Primero, se definen los elementos dibujados a mano en una Planilla de OpenToonz, para luego ser incorporados usando un escáner. Estos elementos pueden consistir en niveles de animación (secuencias de dibujos pertenecientes a la misma animación) o imágenes de fondo o que serán superpuestas sobre la animación.

source: The scanned images then pass through a cleanup process, and are auto centered when necessary, using their pegbar holes as a guide and their related field guide setting. In the case of lineart drawings, these are further prepared for the painting process.
es: Las imágenes escaneadas pasan luego por un proceso de limpieza y son centradas automáticamente cuando sea necesario, usando las perforaciones de las hojas como guía, así como la correspondiente guía de campos.

source: See :ref:`Scanning Paper Drawings <scanning_paper_drawings>` .
es: Ver :ref:`Escaneo de dibujos en papel <scanning_paper_drawings>` .

source: Paperless Drawing
es: Dibujo digital

source: Additional drawings and animation levels can be drawn directly in OpenToonz. Drawings can be an important part of the scene, such as a background or a character’s prop, or incidental elements needed to achieve a particular result, for example a mask image to create a matte effect.
es: Dibujos y niveles de animación adicionales pueden ser dibujados directamente en OpenToonz. Los dibujos pueden ser una parte importante de la escena, tal como los fondos o elementos de utilería, así como elementos casuales necesarios para lograr algún resultado particular, por ejemplo: una imagen para ser usada como máscara en un efecto de transparencia.

source: See :ref:`Drawing Animation Levels <drawing_animation_levels>` .
es: Ver :ref:`Dibujo de niveles de animación <drawing_animation_levels>` .

source: Color Model
es: Modelo de color

source: Color models are created for accurate color-referencing during production, when painting characters and props. They can be drawings made in OpenToonz, scanned images processed in OpenToonz, or images coming from a 3rd party software.
es: Los modelos de color son creados para servir como una referencia precisa de color durante una producción, para pintar personajes y utilería. Pueden ser dibujos hechos en OpenToonz, imágenes escaneadas procesadas en OpenToonz o imágenes provenientes de otros programas.

source: In case of OpenToonz drawings, the color model palette can be defined by creating styles and colors to be used for painting animation levels.
es: En caso de tratarse de dibujos hechos en OpenToonz, la paleta del modelo de color puede ser definida creando estilos y colores para que sean usados al pintar niveles de animación.

source: See :ref:`Managing Palettes and Styles <managing_palettes_and_styles>` and :ref:`Using a Color Model <using_a_color_model>` .
es: Ver :ref:`Administración de paletas y estilos <managing_palettes_and_styles>` y :ref:`Uso de un modelo de color <using_a_color_model>` .

source: Ink & Painting
es: Entintado y pintura

source: Animation levels scanned and cleaned up in OpenToonz, and those made directly in OpenToonz, are painted by using the styles stored in the palette and a set of tools.
es: Tanto los niveles de animación escaneados y luego limpiados en OpenToonz, como aquellos creados directamente en OpenToonz, son pintados usando los estilos almacenados en la paleta y un conjunto determinado de herramientas.

source: Palette styles are interactively “linked” to drawn lines and filled areas by using indexes. The main advantage of this method is that if you edit a style of the palette, all the lines and filled areas using that style will be automatically updated. This allows you to change or calibrate colors also after the painting process has been done, without correcting the style line by line, or area by area.
es: Los estilos de la paleta están "vinculados" de forma interactiva a las líneas dibujadas y a las áreas pintadas, mediante el uso de un índice numérico. La principal ventaja de este método es que si se edita un estilo de la paleta, todas las líneas y áreas de relleno que lo hayan usado, serán actualizadas de forma automática. Esto permite cambiar o calibrar los colores incluso después de realizado el proceso de pintado, sin necesidad de corregir los colores línea a línea o área a área.

source: See :ref:`Managing Palettes and Styles <managing_palettes_and_styles>` and :ref:`Painting Animation Levels <painting_animation_levels>` .
es: Ver :ref:`Administración de paletas y estilos <managing_palettes_and_styles>` y :ref:`Pintura de niveles de animación <painting_animation_levels>` .

source: Compositing
es: Composición

source: All OpenToonz painted levels and images are exposed in the Xsheet where the timing of all the elements of a scene can be controlled. Images, animations and clips from 3rd party software can be loaded as well.
es: Todos los niveles e imágenes pintadas en OpenToonz son expuestos en la Planilla o la Línea de tiempo, donde es posible controlar la temporización de todos los elementos de una escena. También es posible cargar imágenes, animaciones y clips de video creados en otros programas.

source: After adding and arranging the required elements to the Xsheet as layered columns, they are then animated by using interpolated keys placed on necessary parameters. Elements that can be animated in this way include the camera, columns, pegbars and the table.
es: Luego de agregar y acomodar los elementos necesarios en columnas de la Planilla (o en capas de la Línea de tiempo), estos son animados mediante el uso de fotogramas claves colocados en los parámetros necesarios. Los elementos que pueden ser animados de esta manera incluyen: cámaras, columnas/capas, barras de sujeción y la mesa.

source: Special FX, such as blurs, lights, keys, masks, warps, gradients, etc. can be applied to the content of Xsheet columns, and can also be animated by setting key value to the parameters.
es: Es posible aplicar efectos tales como desenfoques, luces, recortes, máscaras, deformaciones, gradientes, etc. al contenido de las columnas de la Planilla (o capas de la Línea de tiempo), los que también podrán ser animados estableciendo fotogramas clave en sus parámetros.

source: Object and special FX transformations are mapped in the function editor window, where set key values and related interpolations can be controlled and modified by using function curves or numerical columns.
es: La animación de las transformaciones de los objetos y efectos pueden ser visualizados en el panel Editor de funciones, donde es posible controlar los valores de los fotogramas clave, así como las interpolaciones entre los mismos, mediante una planilla de valores o un editor de gráficas.

source: See :ref:`Working in Xsheet <working_in_xsheet>` , :ref:`Creating Movements <creating_movements>` , :ref:`Applying Special FX <applying_special_fx>` and :ref:`Editing Using Spreadsheet and Curves <editing_curves_and_numerical_columns>` .
es: Ver :ref:`Trabajo en la Planilla/Línea de tiempo <working_in_xsheet>` , :ref:`Creación de movimientos <creating_movements>` , :ref:`Aplicación de efectos <applying_special_fx>` y :ref:`Edición usando la planilla y curvas <editing_curves_and_numerical_columns>` .

source: Render Farm
es: Granja de procesamiento

source: The scene is rendered in order to compose all the transformations and applied special FX in a sequence of frames in the format and resolution you prefer.
es: La escena es procesada, para componer todas las transformaciones y efectos aplicados, en una secuencia de fotogramas en el formato y resolución deseados.

source: The OpenToonz render farm allows you to batch-render OpenToonz scenes by using a series of computers connected on the same network using TCP/IP.
es: La granja de procesamiento de OpenToonz permite realizar un procesamiento por lotes de escenas de OpenToonz, usando una serie de computadoras conectadas a la misma red, mediante el protocolo TCP/IP.

source: See :ref:`Rendering the Animation <rendering_the_animation>` and :ref:`Using the Toonz Farm <using_the_toonz_farm>` .
es: Ver :ref:`Proceso de una animación <rendering_the_animation>` y :ref:`Uso de Toonz Farm <using_the_toonz_farm>` .

source: Paperless Workflow
es: Proceso digital de producción

source: The following is an example of how OpenToonz allows the management of a paperless animation production.
es: El siguiente es un ejemplo de cómo OpenToonz posibilita la administración de una producción de animación digital.

source: |paperless_workflow|
es: |paperless_workflow_es|

source: Preproduction: Concept
es: Preproducción: Concepto

source: Even if a paperless project can be run regardless of the script, the concept of a format with few settings and a stable cast of characters will ease the arrangement of libraries to be prepared before the actual episode production.
es: Aunque es posible ejecutar un proyecto digital prescindiendo del guion, tener el concepto de formato con una serie de parámetros y elenco de personajes estables que lo componen, facilitará la previa creación de bibliotecas, antes de comenzar la producción de los episodios, en sí mismos.

source: Preproduction: Graphic Design
es: Preproducción: Diseño

source: The graphic design of characters, props and locations is equally important, in order to find out a style that will fit well both with the drawing capabilities of the software and with the cutout animation technique.
es: El diseño de personajes, utilería y entornos es igualmente importante para poder encontrar un estilo que se adapte bien, tanto a las capacidades de dibujo como a las de animación del programa.

source: In particular when designing character models and props, for which you could develop a specific line style to apply to vectors, or use very neat lines typical of vector animations, you should consider a design where the model animation pivot points can be easily disguised under drawings features (for example the pivot point of a ponytail linked to the character’s head can be disguised under a ribbon).
es: En particular, al diseñar modelos de personajes y utilería (para los cuales es posible desarrollar un estilo de línea vectorial específico, así como usar líneas bien precisas típicas de las animaciones vectoriales) debería considerarse un diseño en donde los puntos de pivote de los modelos a ser animados puedan disimularse fácilmente bajo alguna otra característica del dibujo (por ejemplo, el punto de pivote de una cola de caballo vinculada a la cabeza, puede ser disimulado bajo una gomita).

source: Preproduction: Storyboard
es: Preproducción: Storyboard

source: While usually the storyboard is used by the director to control the rhythm of the action, in case of a paperless production it also identifies all the elements needed for the production of each scene, by listing all of the character animations and poses, and identifying all of the props and backgrounds that are needed to implement the story.
es: Si bien usualmente el storyboard es usado por el director para controlar el ritmo de la acción, en el caso de una producción digital también sirve para identificar todos los elementos necesarios para la producción de cada escena, permitiendo hacer un listado de todas las animaciones y poses de los personajes e identificar todos los elementos de utilería y fondos que serán necesarios para implementar la historia.

source: The animatic is created starting from the scanned storyboard drawings. In OpenToonz, or in a third-party software, the storyboard drawings are imported, timing is adjusted and camera movements are set. Audio files too can be imported for reference.
es: El animatic es creado a partir de los dibujos escaneados del storyboard. En OpenToonz, igual que en otros programas, los dibujos del storyboard son importados, su temporización es ajustada y se definen los movimientos de cámara. También es posible importar archivos de sonido como referencia.

source: In case the animatic is created in OpenToonz, it can also be split so that each cut can be used as a starting point for the final compositing of each scene.
es: En caso en que el animatic sea creado en OpenToonz, también puede ser dividido de tal forma que cada sección sea también usada como punto de partida para la composición final de cada escena.

source: Libraries
es: Bibliotecas

source: Libraries are prepared by drawing directly in OpenToonz all of the elements composing the scenes, such as locations, characters, props, etc.
es: Las bibliotecas se preparan dibujando directamente en OpenToonz todos los elementos que componen las escenas, tales como entornos, personajes, utilería, etc.

source: As far as the characters are concerned, they will be decomposed in multiple levels (i.e. head, torso, arms etc.) used as skeleton components rejoined through a hierarchy which at the end will make models available to the animators.
es: En lo que respecta a los personajes, éstos serán divididos en varios niveles (cabeza, cuerpo, brazos, etc.) que serán usados como componentes del esqueleto y vueltos a reunir mediante una jerarquía que, finalmente, los dejará prontos para su uso por parte de los animadores.

source: According to the storyboard analysis, the drawings needed both for the canonical turn-around model (i.e. a collection of models as seen from different points of view: front, back, side and three-quarter views) and for additional movements are prepared. Starting from these reference animations, such as running or walking cycles, jumping, may be stored as well in order to be re-used in the scene production.
es: De acuerdo al análisis del storyboard, se prepararán los dibujos necesarios, tanto para el giro canónico del modelo (una colección de dibujos vistos desde diferentes puntos de vista: frontal, trasero, lateral y tres cuartos), como para otros movimientos adicionales. A partir de estas referencias, se podrán producir también animaciones, tales como ciclos de corridas, caminatas, saltos, etc. para ser reutilizadas durante la producción de las escenas.

source: Props and backgrounds can be also created with third-party software, including rendered images from 3D software.
es: También es posible crear elementos de utilería o fondos usando otros programas, incluyendo imágenes procesadas en programas 3D.

source: See :ref:`Drawing Animation Levels <drawing_animation_levels>` and :ref:`Creating Cutout Animation <creating_cutout_animation>` .
es: Ver :ref:`Dibujo de niveles de animación <drawing_animation_levels>` y :ref:`Creación de animación por recortes <creating_cutout_animation>` .

source: Layout
es: Puesta en escena

source: In the layout phase, all of the elements that are necessary for the scene (backgrounds, props, characters, reference animations) are loaded from the library in Xsheet, usually as Sub-Xsheets. They are put in place according to the animatic. Basic animation is achieved by setting key positions for animated characters or importing reference animations.
es: En la fase de puesta en escena, todos los elementos necesarios para una escena (fondos, utilería, personajes, animaciones de referencia) son cargados desde la biblioteca en la Planilla o la Línea de tiempo, usualmente como Sub-planillas. Éstos son colocados en sus lugares de acuerdo al animatic. Un nivel básico de animación puede ser introducido, mediante el uso de fotogramas clave de posición para los personajes animados o también importando animaciones de referencia.

source: Camera movements and animation timing previously set in the animatic are refined.
es: Los movimientos de cámara y la temporización de la animación, previamente establecida en el animatic, es refinada.

source: See :ref:`Working in Xsheet <working_in_xsheet>` and :ref:`Using Sub-Xsheets <using_sub-xsheets>` .
es: Ver :ref:`Trabajo en la Planilla/Línea de tiempo <working_in_xsheet>` y :ref:`Uso de sub-planillas <using_sub-xsheets>` .

source: Animation
es: Animación

source: The animation for the scene defined in the layout is refined by adding key position to the character movements. Character poses are added by tweaking the model to achieve a more fluid animation.
es: La animación de la escena, definida en la puesta en escena, se refinará agregando fotogramas clave de posición o rotación para los movimientos de los personajes. Se agregarán poses intermedias a los personajes, retocando la animación para hacerla más fluida.

source: The right speed for all the movements is set by controlling interpolation mode in the function editor.
es: Es posible lograr la velocidad correcta de animación para cada movimiento, controlando el modo de interpolación en el Editor de funciones.

source: See :ref:`Animating Objects <animating_objects>` and :ref:`Using the Function Editor <using_the_function_editor>` .
es: Ver :ref:`Animación de objetos <animating_objects>` y :ref:`Uso del Editor de funciones <using_the_function_editor>` .

source: Special FX
es: Efectos

source: Special FX, such as blur, glow, color corrections, particles, are applied to the scene elements.
es: Se aplicarán efectos, como desenfoque, halos, correcciones de color, partículas, etc. a los diferentes elementos de la escena, según se considere necesario.

source: Additional animation elements related to special FX, for example masks or images for the particles effect, are drawn directly in the scene, or imported from external files.
es: También es posible dibujar directamente en OpenToonz o importar, elementos adicionales de animación (tales como máscaras o imágenes para el efecto de partículas) relacionados con efectos usados en la escena.

source: See :ref:`Applying Special FX <applying_special_fx>` .
es: Ver :ref:`Aplicación de efectos <applying_special_fx>` .

source: Render
es: Procesamiento

source: The scene has to be rendered in order to compose all the transformations and applied special FX in a sequence of frames in the format and resolution you prefer.
es: Para poder componer todas las transformaciones y efectos de la escena en una secuencia de imágenes de un determinado formato y resolución, es necesario procesarla.
