Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/scanning_paper_drawings.po
Languages: es

source: If you are defining the level directly in Xsheet/Timeline, right-click the level cells and select **Level Settings** from the menu that opens. In the Level Settings window, type in the **Path:** field, or use the browser button, to set the path for the saving location.
es: Si se estuviera definiendo el nivel directamente en la Planilla/Línea de tiempo, hacer clic derecho sobre las celdas del nivel y elegir **Opciones de nivel...** en el menú. En la ventana de Opciones de nivel, ingresar texto en el campo **Ruta:** o usar el botón de Explorar para definir la ruta a usar para la ubicación de guardado.

source: If in the browser you choose any project default folder, in the **Path:** field the full path will be replace by the related default folder alias (see :ref:`Project Default Folders <project_default_folders>` ).
es: Si en el Explorador de archivos se escogiera alguna de las carpetas predefinidas del proyecto activo, en el campo **Ruta:** la ruta completa será reemplazada por una referencia relativa a la misma (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).

source: Scanning Drawings
es: Escaneo de los dibujos

source: According to the driver you are using, internal or TWAIN, the scanning process will be controlled either by the Scan Settings dialog or the TWAIN interface.
es: De acuerdo al controlador que se estuviera utilizando (interno o TWAIN) el proceso de escaneo será controlado por el diálogo de Opciones de escaneo o por la propia interfaz TWAIN.

source: |scan_settings|
es: |scan_settings_es|

source: The Scan Settings dialog allows you to define the following:
es: El diálogo Opciones de escaneo permitirá definir lo siguiente:

source: **Paper Format** sets the size for the drawings to be scanned. The option menu contains a list of already defined formats.
es: **Formato de papel:**, permite definir el tamaño de los dibujos a ser escaneados. El menú de opciones contendrá una lista de los formatos disponibles.

source: **Reverse Order** makes the scanning process in a reverse order, starting from the last selected frame to the first one.
es: **Orden inverso**, permite realizar el proceso de escaneo en orden inverso, comenzando desde el último fotograma seleccionado, y llegando hasta el primero.

source: **Paper Feeder** lets the scanner use the automatic document feeder, in case the scanner has one, to scan all the selected drawings without having to insert one image at a time into the scanner.
es: **Alimentador de papel**, permite que el escaner utilice el alimentador automático de documentos, en caso de que posea uno, para escanear todos los dibujos seleccionados sin necesidad de insertarlos uno por uno en el escaner.

source: **Mode** is for setting the scanning mode among: **Black and White**, **Greyscale** and **Color**.
es: **Modo:** permite establecer el modo de escaneo, entre: **Blanco y negro**, **Escala de grises** y **Color**.

source: The TWAIN interface is related to the scanner you are using and will be available only when the TWAIN drivers, provided with the scanner, are installed on your computer. Refer to the scanner documentation for more details.
es: La interfaz TWAIN correspondiente al escaner usado estará disponible sólo cuando los controladores TWAIN, provistos con el escaner, se encontraran instalados en el sistema. Recurrir a la documentación del escaner para más detalles.

source: The Scan Settings dialog can be used in combination with the TWAIN interface settings to set the Reverse Order option.
es: El diálogo Opciones de escaneo podrá ser usado en combinación con las opciones de la interfaz TWAIN, para lograr realizar un escaneo en orden inverso.

source: The settings, either defined in the Scan Settings dialog or in the TWAIN interface, will be used to scan the drawings selected in the Xsheet/Timeline. In case you select several drawings, and you are using the scanner paper feeder, all the drawings to be scanned will be taken from the feeder; if you are not using the paper feeder, you will be prompted to replace the drawing on the scanner bed, before scanning the following drawing.
es: Las opciones, definidas a través del diálogo de Opciones de escaneo o de la interfaz TWAIN, serán usadas para escanear los dibujos seleccionados en la Planilla/Línea de tiempo. En caso de haber seleccionadas varias celdas y de que se estuviera utilizando un alimentador de papel, todos los dibujos a ser escaneados serán tomados automáticamente desde el alimentador; en caso de no estar usando un alimentador de papel, se solicitará reemplazar el dibujo en el escáner, antes de escanear el próximo.

source: You can also select non-consecutive drawings and drawings from different animation levels. Levels will be scanned starting from the first selected column/layer. Only exposed drawings will be scanned according the level numbering order, regardless of the way the animation level is exposed in one or several Xsheet columns (or Timeline layers). The opposite order will be followed if the **Reverse Order** option is on.
es: También será posible seleccionar dibujos no consecutivos, así como dibujos de distintos niveles de animación. Los niveles serán escaneados comenzando desde la primera columna/capa seleccionada. Sólo los dibujos expuestos serán escaneados, de acuerdo al orden numérico del nivel, sin importar la forma en que el nivel se encontrara expuesto en las columnas de la Planilla (o capas de la Línea de tiempo). Sin embargo, si la opción **Orden inverso** se encontrara activada, se seguirá un orden inverso durante el escaneo.

source: As soon as a drawing is scanned, it is saved and its name and number displayed in the Xsheet/Timeline turn black, as the level now has physical drawings saved on disk.
es: Tan pronto como un dibujo haya sido escaneado será guardado, y su nombre y número en la Planilla/Línea de tiempo se tornarán negros, indicando que ahora esa celda se refiere a un nivel cuyo contenido está guardado en el disco.

source: Images are saved as compressed TIF files with a progressive four-digits number written between the file name and the file extension, e.g. ``animation.0001.tif`` , ``animation.0002.tif`` , etc. They are displayed in the OpenToonz browser with a double dot before the file extension, e.g. ``animation..tif`` .
es: Las imágenes serán guardadas como archivos comprimidos en forma TIF, usando una numeración progresiva de cuatro dígitos, escrita entre el nombre base y la extensión del archivo, p.ej: ``animación.0001.tif`` , ``animación.0002.tif`` , etc. Se mostrarán en el Explorador de archivos de OpenToonz con un doble punto antes de la extensión del archivo, p.ej: ``animación..tif`` .

source: If you need to scan again an animation level, or a part of it, select the relevant drawings and scan them again. Drawings can be also inserted by editing the level sequence (see :ref:`Renumbering and Adding Frames in a Level <renumbering_and_adding_frames_in_a_level>` ).
es: Si se necesitara escanear nuevamente un nivel de animación o una parte del mismo, seleccionar los dibujos relevantes y escanearlos nuevamente. También podrán insertarse dibujos, editando la secuencia del nivel (ver :ref:`Renumeración y adición de fotogramas a un nivel <renumbering_and_adding_frames_in_a_level>` ).

source: **To scan an animation level:**
es: **Para escanear un nivel de animación:**

source: In the Xsheet/Timeline, select the drawings you want to scan.
es: En la Planilla/Línea de tiempo, seleccionar los dibujos que se desee escanear.

source: Choose Scan & Cleanup → **Scan Settings...** and use the dialog to control scan options.
es: Elegir Escaneo y limpieza → **Opciones de escaneo...** y usar las opciones en el diálogo para controlar el proceso de escaneo.

source: If you are using the internal drivers, choose Scan & Cleanup → **Scan**: the selected drawings will be scanned and automatically saved.
es: Si se estuvieran usando los controladores internos, escoger Escaneo y limpieza → **Escanear**: los dibujos seleccionados serán escaneados y guardados automáticamente.

source: If you are using the TWAIN drivers, choose Scan & Cleanup → **Scan**, and guide the scanning process by using the TWAIN interface that opens: the selected drawings will be scanned and automatically saved.
es: Si se estuvieran usando los controladores TWAIN, elegir Escaneo y limpieza → **Escanear**, realizar el proceso de escaneado usando la interfaz TWAIN emergente: los dibujos seleccionados serán escaneados y guardados automáticamente.

source: In case you selected several drawings, do one of the following:
es: En caso de haber seleccionado varios dibujos, realizar alguna de las siguientes acciones:

source: If you are using the scanner paper feeder, wait for all of the drawings to be scanned.
es: Si se estuviera utilizando el alimentador de papel del escaner, esperar a que todos los dibujos hayan sido escaneados.

source: If you are not using the paper feeder, you will be prompted to replace the drawing on the scanner bed, before scanning the following drawing.
es: Si no se estuviera utilizando un alimentador de papel, se solicitará reemplazar el dibujo en el escaner, antes de proceder a escanear el siguiente dibujo.

source: After a drawing is scanned, or several drawings are scanned at once by using the paper feeder, in some TWAIN interfaces you may need to use a specific command (such as **Back to Application**) to return to OpenToonz before proceeding with the next scanning session. Refer to the scanner documentation for more details.
es: Luego de que un dibujo ha sido escaneado, o varios si es estuviera usando un alimentador de papel, en algunas interfaces TWAIN es posible que fuera necesario usar un comando específico (como **Regresar a la aplicación**) para regresar a OpenToonz, antes de poder proceder con la siguiente sesión de escaneo. Consultar la documentación del escaner por más detalles.

source: Setting the Cropbox
es: Definición del marco de recorte

source: When using directly supported scanners it is possible to define a *cropbox* smaller than the paper format to optimize the scanning process. When the *cropbox* is set the final scanned image will be the size of the selected paper format, but only the area defined by the *cropbox* is actually scanned, thus speeding up the scanning operations.
es: Al usar escaners soportados en forma directa, será posible definir un *marco de recorte* más pequeño que el formato de papel escogido, para optimizar el proceso de escaneo. Cuando se hubiera definido un *marco de recorte*, la imagen producida seguirá siendo del tamaño del formato de papel escogido, sin embargo sólo el área definida por el *marco de recorte* será escaneada, acelerando así las operaciones de escaneo.

source: Once defined the cropbox will be used for any scanning performed for the scene.
es: Una vez definido, el marco de recorte será usado para cualquier escaneo realizado en la escena.

source: The cropbox size information is not saved along with the scene file; it is also automatically reset when working on a new scene.
es: La información de tamaño del marco de recorte no será guardada con la escena; también será restablecida automáticamente al comenzar a trabajar en una nueva escena.

source: **To define the scanning cropbox:**
es: **Para definir el marco de recorte de escaneo:**

source: Choose Scan & Cleanup → **Set Cropbox**: the drawing currently placed in the scanner is scanned and the cropbox is displayed in *red*.
es: Elegir Escaneo y limpieza → **Definir marco de recorte**: el dibujo colocado en el escaner será leído y se mostrará el marco de recorte en color *rojo*.

source: Use the handles along the cropbox to set its size, and click and drag anywhere to change its position.
es: Usar las asas en los lados del marco de recorte para definir su tamaño, arrastrar en otra parte para desplazarlo.

source: The cropbox default size is the same as the size of the scanned image.
es: El tamaño predefinido del marco de recorte será igual al tamaño de la imagen a ser escaneada.

source: The cropbox cannot be moved outside the area of the scanned image.
es: El marco de recorte no podrá ser desplazado fuera del área de la imagen a ser escaneada.

source: **To use the defined cropbox when scanning:**
es: **Para usar el marco de recorte al escanear:**

source: Scan drawings after defining the cropbox size (see above ).
es: Escanear dibujos luego de haber definido el marco de recorte (ver más arriba).

source: **To dismiss the scanning cropbox visualization:**
es: **Para dejar de ver el marco de recorte:**

source: Choose Scan & Cleanup → **Set Cropbox**.
es: Elegir Escaneo y limpieza → **Definir marco de recorte**.

source: **To reset the scanning cropbox:**
es: **Para restablecer el marco de recorte de escaneo:**

source: Choose Scan & Cleanup → **Reset Cropbox**.
es: Elegir Escaneo y limpieza → **Restablecer marco de recorte**.
