Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/scanning_paper_drawings.po
Languages: es

source: Scanning Paper Drawings
es: Escaneo de dibujos en papel

source: Currently OpenToonz DOES NOT SUPPORT the native scanning functionality, as described in this page. Instead you can use the provided GTS scanning and cleaning software, please follow `this link to download GTS <https://opentoonz.github.io/e/download/gts.html>`_ .
es: Actualmente OpenToonz NO SOPORTA las funciones nativas de escaneo, tal como se describen en esta página. Se sugiere el uso del programa GTS con capacidades de escaneo y limpieza de imágenes, por favor seguir `este enlace para descargar GTS <https://opentoonz.github.io/es/download/gts.html>`_ .

source: This manual page is preserved in its original form, in case the scanning code of OpenToonz is reactivated in a future version.
es: Esta página del manual ha sido preservada en su forma original, en caso de que, en una futura versión, el código de escaneo de OpenToonz sea reactivado.

source: In order to be managed by OpenToonz, paper drawings have to be scanned into OpenToonz. Paper drawings can be both animation levels, consisting of a large number of sequenced drawings, and other elements such as backgrounds and overlays.
es: Para poder ser usados en OpenToonz, los dibujos en papel deberán ser escaneados. Los dibujos en papel podrán contener tanto niveles de animación, compuestos de una gran cantidad de secuencias de dibujos, como también otros elementos tales como fondos y sobreimpresos.

source: The scan process can be done in different modes, and in case autocenter is needed it has to follow specific guidelines.
es: Es posible realizar el proceso de escaneo en distintos modos y, en caso de que fuera necesario utilizar el centrado automático, se deberá seguir una guía específica al respecto.

source: Animation levels have to be defined first and then scanned according to a defined set of parameters.
es: Primero deberán ser definidos los niveles de animación a ser escaneados, para luego poder ser escaneados de acuerdo al conjunto de parámetros establecido.

source: Supported Scanners
es: Escaners soportados

source: OpenToonz supports directly, by using internal drivers, some specific scanners via a USB connection; all the other scanners are supported via any type of connection by using TWAIN drivers.
es: OpenToonz soporta directamente (mediante el uso de controladores internos), algunos escaners específicos vía conexión USB; todos los demás escaners son soportados mediante el uso de controladores TWAIN.

source: |define_scanner|
es: |define_scanner_es|

source: For an updated list of directly supported scanners, please visit the `OpenToonz Web site <https://opentoonz.github.io/e/>`_ .
es: Para obtener una lista de los escaners soportados directamente, por favor visitar el `sitio web de OpenToonz <https://opentoonz.github.io/es/>`_ .

source: If your scanner is supported via internal drivers, the scanning process is managed completely by OpenToonz and the Scan Settings dialog; if it is not, the scanning process is managed by the TWAIN interface.
es: Si el escaner que se desea usar es uno de los soportados mediante controladores internos, el proceso de escaneo será administrado completamente por OpenToonz, a través del diálogo Opciones de escaneo; si no lo fuera, el proceso de escaneo será administrado por la interfaz de TWAIN.

source: On Windows, the TWAIN drivers provided with the scanner need to be installed. Note that if you decide to use internal drivers, you have to disable the **Windows Image Acquisition (WIA)** service on your computer; if you want to use TWAIN drivers, you have to enable it.
es: En Windows, se deberán instalar los controladores TWAIN provistos con el escaner. Nótese que si se decidiera el uso de los controladores internos, deberá deshabilitarse el servicio **Adquisición de imágenes de Windows (WIA)** en el sistema; si en cambio se decidiera usar los controladores TWAIN, dicho servicio deberá estar habilitado.

source: On macOS, you need to install the TWAIN drivers only if you are going to use them. Note that if you decide to use internal drivers, any TWAIN driver referring to that scanner has to be removed.
es: En macOS, se deberán instalar los controladores TWAIN sólo si se decidiera usarlos. Nótese que si se decidiera el uso de los controladores internos, deberá quitarse cualquier controlador TWAIN que se refiera a ese escaner.

source: The driver you want to use must be selected according to your scanner before starting the scanning process. You can choose whether to use the internal or TWAIN drivers; in the latter case, you have to select which driver to use from a list based on the TWAIN drivers installed on your computer.
es: El controlador deberá ser elegido de acuerdo al escaner a usar, antes de comenzar el proceso de escaneo. Se podrá escoger si se usarán los controladores internos o los TWAIN; en este último caso deberá seleccionarse cuál controlador se usará desde una lista basada en los controladores TWAIN instalados en el sistema.

source: When using TWAIN drivers you need to specify the driver every time you restart OpenToonz: the dialog box is automatically displayed when you select any Scan related command.
es: Al usar controladores TWAIN, se deberá especificar el controlador cada vez que se reinicie OpenToonz: el diálogo se mostrará automáticamente al seleccionar cualquier comando relacionado con las funciones de escaneo.

source: **To install TWAIN drivers:**
es: **Para instalar los controladores TWAIN:**

source: Refer to the scanner documentation for more details.
es: Recurrir a la documentación del escaner para obtener más detalles.

source: **Windows only - To disable or enable the Windows Image Acquisition (WIA) service:**
es: **Sólo Windows - Para deshabilitar el servicio Adquisición de imágenes de Windows (WIA):**

source: Open the Control Panel → Administrative Tools → **Services** dialog.
es: Abrir el diálogo Panel de control → Sistema y seguridad → Herramientas administrativas → **Servicios**, o Menú Inicio → Herramientas administrativas de Windows → **Servicios**.

source: Right-click the **Windows Image Acquisition (WIA)** service and choose **Properties** from the menu that opens.
es: Hacer clic derecho sobre el servicio **Adquisición de imágenes de Windows (WIA)** y elegir **Propiedades** en el menú.

source: In the Properties dialog do one of the following:
es: En el diálogo Propiedades realizar una de las siguientes acciones:

source: Set the **Startup Type** option to **Disabled** to use internal drivers.
es: Definir el **Tipo de inicio:** en **Deshabilitado**, para usar los controladores internos de OpenToonz.

source: Set the **Startup Type** option to **Automatic** to use TWAIN drivers.
es: Definir el **Tipo de inicio:** en **Automático**, para usar los controladores TWAIN.

source: Restart the computer.
es: Reiniciar el sistema.

source: **Macintosh only - To remove the scanner TWAIN drivers:**
es: **Sólo macOS - Para eliminar los controladores TWAIN del escaner:**

source: **To define the scanner:**
es: **Para definir el escaner:**

source: Choose Scan & Cleanup → **Define Scanner...**.
es: Elegir Escaneo y limpieza → **Definir escaner**.

source: Do one of the following:
es: Realizar una de las siguientes acciones:

source: If your scanner is directly supported, choose Scanner Driver → **Internal**, and click the **OK** button.
es: Si el escaner fuera uno de los soportados directamente, elegir Controlador → **Internal**, y hacer clic en el botón **Aceptar**.

source: If your scanner is not directly supported, be sure that TWAIN drivers are installed, and choose Scanner Driver → **TWAIN**, and click the **OK** button: in the dialog that opens, select the TWAIN driver related to your scanner.
es: Si el escaner no fuera uno de los soportados directamente, asegurarse de que los controladores TWAIN se encuentren instalados, y elegir Controlador → **TWAIN**, luego hacer clic en el botón **Aceptar**: en el diálogo emergente seleccionar el controlador TWAIN correspondiente al escaner que se usará.

source: Scanning Modes
es: Modos de escaneo

source: Drawings can be scanned mainly in three different modes: *black and white*, *greyscale* and *color*.
es: Es posible escanear dibujos en tres modos principales: *blanco y negro*, *escala de grises* y *color*.

source: The first two modes can be used to acquire standard lineart drawings whose outline is usually made in a single color, that during the scanning is acquired as black or dark grey. Even if the outline color is lost during the scanning, later on you can assign one or more colors to it during the painting process.
es: Los dos primeros modos podrán ser usados para escanear dibujos normales, cuyos contornos estén compuestos de un único color que, durante el escaneo será procesado como negro o gris oscuro. Aún si el color de los contornos se viera modificado durante el escaneo, más adelante será posible asignarle un nuevo color, durante el proceso de pintura.

source: **Black and white** scanning gives you the most immediate results, and fewer parameters need to be set. Once a **Threshold:** value is set, pixels of the scanned image are considered as either black or white. Due to the simplicity of this concept, less time is required to scan the image, and scanned files are lighter to manage. Even if images show hard edges, the proper antialiasing will be added during the cleanup process.
es: **Blanco y negro**, es el modo de escaneo que produce el resultado más inmediato y para el que se necesita regular menos parámetros. Una vez que se haya definido el valor de **Umbral:**, los píxeles de la imagen escaneada serán considerados como blancos o negros. Debido a la simplicidad de este concepto, se requerirá menos tiempo para escanear las imágenes y los archivos generados serán de menor tamaño. Aunque las imágenes resultantes presenten bordes duros, se podrá agregar un grado de suavizado de bordes apropiado, durante el proceso de limpieza.

source: **Greyscale** scanning, being based on a range of grey values, requires a longer scanning time. Determining **Brightness:** and **Contrast:** parameters depends considerably on the individual animated sequence and on what you want to achieve. The greyscale mode also offers **Autoadjust** options during the cleanup process, useful to even the differences between drawings made by key animators and those made by in-betweeners. See :ref:`Autoadjusting Greyscale Lineart Drawings <autoadjusting_greyscale_lineart_drawings>` .
es: **Escala de grises**, este modo de escaneo se basa en un rango de valores de gris y requiere un tiempo de escaneo mayor. La determinación de los niveles de los parámetros de **Brillo:** y **Contraste:** dependerá considerablemente de cada secuencia animada y de lo que se desee lograr. El modo Escala de grises también posibilita el uso de las opciones de **Ajuste automático** durante el proceso de limpieza, que puede resultar útil para compensar las diferencias en los niveles de gris de los dibujos hechos por los animadores principales y los intermediadores. Ver :ref:`Ajuste automático de dibujos en escala de grises <autoadjusting_greyscale_lineart_drawings>` .

source: **Color** scanning is for scanning colored lineart and other colored images as backgrounds and overlays. Using colors in lineart allows you to draw different lines with different colors, for example a character outline in black and its body shadow in red or in blue. As colored lines can be identified later during the cleanup process, scanning colored artwork in colors allows you to preserve different line colors with no need of intensive painting work. See :ref:`Processing Colored Lineart Drawings <processing_colored_lineart_drawings>` .
es: **Color**, este modo es usado para escanear dibujos y otras imágenes en color, como fondos y sobreimpresos. El uso de color en los contornos de dibujos permite dibujar distintas líneas con diferentes colores, por ejemplo el contorno de un personaje en negro y la sombra sobre su cuerpo en rojo. Como las líneas de color podrán ser identificadas durante el proceso de limpieza, escanear los dibujos en color permitirá preservar dichos tonos, ahorrando luego en el proceso de pintura. Ver :ref:`Procesamiento de dibujos en color <processing_colored_lineart_drawings>` .

source: Scanning Guidelines for Autocentering
es: Guía de escaneo para usar el Centrado automático

source: To autocenter scanned drawings during the cleanup process, the pegbar holes need to be detected on the images (see :ref:`Autocentering <autocentering>` ). For this reason they have to be scanned in black, by properly preparing the scanner and performing the scanning process according to the following guidelines.
es: Para poder centrar automáticamente dibujos durante el proceso de escaneo, los huecos de registro necesitan poder ser detectados en las imágenes (ver :ref:`Centrado automático <autocentering>` ). Por esta razón deberán ser escaneadas sobre un fondo negro, mediante una preparación apropiada del escaner, y la realización del proceso de escaneo estar de acuerdo a la siguiente guía.

source: Preparing Scanners
es: Preparación del escaner

source: If you use the scanner automatic paper feeder, you should stick a piece of thin black tape in the feeder on the opposite side of the scanner lamp. Be sure to stick the black tape in a position to face the peg holes when the paper is fed into the scanner.
es: Si se utilizara el alimentador automático de papel del escaner, se deberá adherir un trozo de cinta negra en el alimentador, del lado opuesto a la lámpara del escaner. Asegurándose de adherir la cinta negra en una posición enfrentada a los huecos de registro, cuando el papel sea transportado dentro del escaner.

source: If you use the scanner bed, you should place a black sheet of paper under the scanner cover, so that when a drawing is scanned facing down the glass of the scanner bed, the black paper will be behind it. The black paper must be larger than your animation paper, but it does not have to cover the entire scanner bed.
es: Si se utilizara el escaner de forma horizontal, se deberá adherir una hoja de papel negra a la tapa del escaner, para que cuando se escanee una hoja enfrentada al vidrio del escaner, el papel negro quede detrás de la misma. La hoja negra deberá ser más grande que el papel de animación, pero no tendrá por qué cubrir la totalidad del área del escaner.

source: Scanning Artwork
es: Preparación del material

source: It is better to use quite thick animation paper for your artwork: very thin paper may jam the scanner, and the scanner light may pass through picking up some grey from the black paper or tape placed behind it. When this happens, the process will take longer to perform and will produce a poor quality result.
es: Será mejor usar un papel de grosor alto para dibujar sobre él: es probable que un papel muy fino se atasque en el mecanismo del escaner con mayor facilidad, y que la luz del escaner traspase el papel, captando el color negro de la hoja o cinta colocada detrás. En caso de que esto suceda, el proceso de limpieza tomará más tiempo y producirá resultados de una menor calidad.

source: Avoid using *black* or *colored* paper reinforcements around the pegbar holes in your drawing sheets. The scanner has to read the exact shape of the hole punches, and colored reinforcements may cause holes to be scanned larger than their actual size. If you do use *white* reinforcements, make sure they are aligned directly over the peg holes: if the holes are slightly covered by the reinforcement, the registration may fail.
es: Evitar el uso de refuerzos *negros* o de *color* alrededor de los huecos de registro en las hojas de dibujo. El escaner deberá ser capaz de leer la forma exacta de los huecos de registro, y es posible que dichos refuerzos hagan que los huecos sean escaneados con un tamaño mayor que el real. Si se usaran refuerzos de color *blanco*, asegurarse de que éstos se encuentren alineados directamente sobre los huecos de registro: si los huecos se encontraran parcialmente bloqueados por el refuerzo, es posible que el **Centrado automático** falle.

source: Do not draw too close to the pegbar holes. Avoid drawing anything with the same shape or area of the pegbar hole in the pegbar holes area; leave at least 1 cm (~1/2”) of clear space between the pegbar holes and the rest of your drawings. Lines drawn near the pegbar holes may cause the registration to fail.
es: Evitar dibujar muy cerca de los huecos de registro. También evitar dibujar cualquier forma similar a un hueco cerca del área de los huecos de registro; dejar al menos 1 cm (~1/2”) de espacio en blanco entre los huecos de registro y el resto de los dibujos. Las líneas dibujadas cerca del área de los huecos de registro podrán causar que el **Centrado automático** falle.

source: Defining Animation Levels to Scan
es: Definición de niveles de animación a ser escaneados

source: To scan an animation level, first you have to define its name, the number of frames it is made of, and the way its drawings are numbered. Its size and resolution will be set during the scanning session.
es: Para escanear un nivel de animación, primero será necesario definir su nombre, la cantidad de fotogramas del que esté compuesto, así como la forma en que sus dibujos deberán estar numerados. Su tamaño y resolución serán definidos durante la propia sesión de escaneo.

source: The definition can be made drawing by drawing directly in the Xsheet/Timeline, or at once by using the **New Level** dialog. You can assign it the name and the numbering order you prefer.
es: Su definición puede ser hecha dibujo a dibujo en la Planilla/Línea de tiempo, o todo de una vez mediante el uso del dialogo **Nuevo nivel**, donde será posible asignarle un nombre y el orden de numeración que se desee.

source: In case you use the **New Level** dialog you can set the number of drawings the level is made of, the animation step to expose the level repeating its frames, and the increment, that sets the way the level drawings are numbered. For example a **Step:** value 2 repeats each drawing twice in the Xsheet column (or Timeline layer), while an **Increment:** value 2 numbers the drawings 1, 3, 5, etc.
es: En caso de que usarse el diálogo **Nuevo nivel**, será posible definir la cantidad de dibujos que comprenderá el nivel, el intervalo de exposición del mismo, así como el patrón de incremento de su numeración. Por ejemplo, un valor de **Exposición:** de 2 repetirá cada dibujo dos veces en la columna de la Planilla (o capa de la Línea de tiempo), mientras que con un **Incremento:** de 2 sus dibujos serán numerados: 1, 3, 5, etc.

source: |new_scan_level|
es: |new_scan_level_es|

source: By default scanned drawings are saved in the **+inputs** directory of the current project; if the *+inputs* definition uses the $scenepath variable, they are saved only if the scene is saved (see :ref:`Project Default Folders <project_default_folders>` ).
es: De forma predefinida los dibujos escaneados serán guardados en la carpeta **+inputs** del proyecto activo; si en la definición de la carpeta *+inputs* se hubiera utilizado la variable $scenepath, serán guardados únicamente si la escena hubiera sido guardada con anterioridad (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).

source: You can change the location by using either the **Path:** field in the **New Level** dialog, or the **Level Settings** window in case you define a level directly in Xsheet/Timeline.
es: Es posible cambiar la ubicación, tanto usando el campo **Ruta:** del diálogo **Nuevo nivel**, como la ventana **Opciones de nivel** en caso de que el nivel hubiera sido definido directamente en la Planilla/Línea de tiempo.

source: Settings such as the length of the level and the numbering order can be edited later, as you are free to arrange the images composing your animation level the way you prefer (see :ref:`Editing Animation Levels <editing_animation_levels>` ).
es: Las opciones, tales como la longitud del nivel y el orden de numeración podrán ser modificadas más adelante, ya que se dispone de total libertad de ordenar las imágenes que componen un nivel de animación como se desee (ver :ref:`Edición de niveles de animación <editing_animation_levels>` ).

source: When an animation level is defined, the name and numbers for the drawings of the level are displayed in *red* as no level actually exists yet; the column/layer cells where the level is exposed are colored in *light blue*, the color denoting full-color images (see :ref:`Working with Columns/Layers <working_with_xsheet_columns>` ).
es: Cuando se define un nivel de animación, el nombre y los números de los dibujos del mismo serán mostrados en color *rojo*, ya que el nivel aún no existe realmente; las celdas de la columna/capa donde se encuentra expuesto el nivel aparecerán en color *azul claro*, denotando que se trata de un nivel de Imagen (ver :ref:`Trabajo con columnas/capas <working_with_xsheet_columns>` ).

source: **To define an animation level directly in Xsheet:**
es: **Para definir un nivel de animación, directamente en la Planilla/Línea de tiempo:**

source: Double-click a cell, then type a name and a number; the name and the number must be separated by a space.
es: Hacer doble clic sobre una celda, luego ingresar un nombre y un número (éstos deberán estar separados por un espacio).

source: Press **Enter** to add a new drawing, and type a different number that will be assigned to the new drawing.
es: Presionar **Intro** para agregar un nuevo dibujo e ingresar otro número, que será asignado al nuevo dibujo.

source: Go on adding all the drawings you need.
es: Continuar agregando todos los dibujos necesarios.

source: Click a different cell to end the process.
es: Hacer clic sobre otra celda para finalizar el proceso.

source: **To define an animation level with the New Level dialog:**
es: **Para definir un nivel de animación, usando el diálogo Nuevo nivel:**

source: Select a cell in the Xsheet/Timeline where you want to place your animation level to scan and choose Level → New → **New Level...**
es: Seleccionar una celda en la Planilla/Línea de tiempo donde se desee ubicar el nivel de animación a escanear, y elegir Nivel → Nuevo → **Nuevo nivel...**

source: Right-click the cell in the Xsheet/Timeline where you want to place your animation level to scan and choose **New Level** from the menu that opens.
es: Hacer clic derecho sobre una celda en la Planilla/Línea de tiempo donde se desee ubicar el nivel a ser escaneado, y elegir **Nuevo nivel** en el menú.

source: If any level is already exposed in the cell column/layer, it will shift down/right from the cell you selected on.
es: Si ya hubiera un nivel expuesto en la celda de esa columna/capa, será desplazado desde la celda seleccionada hacia abajo/derecha.

source: In the New Level dialog choose **Scan Level** from the **Type:** option menu and define its settings, then click the **OK** button.
es: En el diálogo Nuevo nivel elegir **Nivel de escaneo** en la opción **Tipo:** y definir sus opciones, luego hacer clic en **Aceptar**.

source: **To define the saving location for the level to be scanned:**
es: **Para definir la ubicación de guardado para el nivel a ser escaneado:**

source: If you are using the **New Level** dialog, type in the **Path:** field, or use the browser button, to set the path for the saving location.
es: Si se estuviera usando el diálogo **Nuevo nivel**, ingresar en el campo **Ruta:** o usar el botón de Explorar para definir la ruta para la ubicación de guardado.
