Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/setting_up_a_scene.po
Languages: es

source: Setting Up a Scene
es: Configuración de una escena

source: Scene Settings and Project Default Settings
es: Opciones de escena y opciones predefinidas de proyecto

source: When you start working on a scene, automatically it will belong to the current project, inheriting its settings and default folders. In this way all the scenes belonging to a project are created with the same settings, assuring the consistency of the production (see :ref:`Managing Projects <managing_projects>` ).
es: Al comenzar a trabajar en una nueva escena, ésta será parte del proyecto activo, heredando sus opciones y carpetas predefinidas. De esta manera todas las escenas pertenecientes a un mismo proyecto son creadas con las mismas opciones, asegurando la consistencia de la producción (ver :ref:`Administración de proyectos <managing_projects>` ).

source: Settings concern different tasks you may perform in OpenToonz, such as the scanning, or cleanup process, the camera size and resolution, the frame rate, the output options, etc. They can be accessed in dialogs you can open with commands available in the related menu; for example the scan and cleanup settings commands are available in the Scan & Cleanup menu.
es: Las opciones se refieren a diferentes tareas que es posible desarrollar en OpenToonz, tales como escaneo, limpieza de imágenes escaneadas, el tamaño y la resolución de la cámara, la velocidad de fotogramas, las opciones de salida, etc. Las mismas pueden ser accedidas a través de diálogos que es posible abrir con comandos disponibles en los menúes apropiados; por ejemplo las opciones de escaneo y limpieza se encuentran disponibles en el menú Escaneo y limpieza.

source: Settings for a particular scene can always be changed independently from the other ones, and will be automatically saved when the scene is saved.
es: Las opciones de una escena particular siempre pueden ser cambiadas de forma independiente a las de otras y se guardarán automáticamente al guardar la escena.

source: If you want to change the default values you can save current scene settings as default, so that all new scenes created for that project will have those values.
es: Si se desea cambiar los valores predefinidos, es posible guardar las opciones de la escena actual como valores predefinidos, de forma que todas las nuevas escenas creadas para ese proyecto contengan esos valores.

source: **To save current scene settings as project default settings:**
es: ** Para guardar las opciones de la escena actual como predefinidos del proyecto:**

source: Select File → Project Management → **Save Default Settings**: all the settings from the current scene will become the project default.
es: Seleccionar Archivo → Administración de proyectos → **Guardar opciones predefinidas**: todas las opciones de la escena actual se transformarán en predefinidas para el proyecto.

source: Choosing the Working Unit
es: Elección de unidades de trabajo

source: Positions, distances and sizes can be expressed in several units of measure: inches, millimeters, centimeters, fields and pixels.
es: Las posiciones, distancias y tamaños pueden ser expresados en varias unidades de medida: pulgadas, milímetros, centímetros, campos y píxeles.

source: The field unit is equal to 1/2 inch on the horizontal dimension, and it depends on the A/R set in the field guide information of the Scene Settings... dialog on the vertical dimension (see :ref:`Using the Viewer <using_the_work_area>` ). For example if the A/R value is 1.77778, two horizontal fields are equal to an inch, while one vertical field equals to an inch divided by 1.77778.
es: La unidad *campo* equivale a 1/2 pulgada en la dimensión horizontal y para su dimensión vertical depende del valor **Proporción:** definido en la información de guía de campos del diálogo Opciones de la escena (ver :ref:`Uso del Visor <using_the_work_area>` ). Por ejemplo: si el valor Proporción es 1.77778, dos campos equivaldrán horizontalmente a una pulgada, mientras que en el sentido vertical equivaldrán a una pulgada dividida entre 1.77778.

source: In the Files → Preferences... → Interface dialog you can set the following default units:
es: En el diálogo Archivo → Preferencias... → Interfaz es posible definir las siguientes unidades predefinidas:

source: The **Unit** is used to display all measures in text fields, and applied when moving or changing the size of stage objects.
es: La **Unidades** se usan para mostrar todas las medidas en los campos de ingreso de valores y son aplicadas al mover o cambiar el tamaño de los objetos de la escena.

source: The **Camera Unit** is used to display and define the camera size in the Xsheet → Camera Settings... dialog (see :ref:`Defining Camera Settings <defining_camera_settings>` ).
es: Las **Unidades de cámara** se usan para mostrar y definir el tamaño de las cámaras en el diálogo Planilla → Opciones de cámara... (ver :ref:`Definición de Opciones de cámara<defining_camera_settings>` ).

source: You can also express values in an unit different from the default one by entering any of the following units and abbreviations: in, inch, " , ' ' (two apostrophes), cm, mm, fld, field and px, after the input value itself. As soon as the value is entered it's converted in the default unit.
es: También es posible expresar los valores en una unidad distinta a la predefinida, ingresando cualquiera de las unidades y abreviaturas siguientes: in, inch, " , ' ' (dos comillas simples), cm, mm, fld, field y px, luego del valor numérico. En cuanto el valor es ingresado es convertido a las unidades predefinidas.

source: If a value without a specific unit is used, it is supposed to be expressed in the default unit.
es: Si se usa un valor sin una unidad específica, se asume que se encuentra expresado en las unidades predefinidas.

source: **To set the default working units:**
es: **Para definir las unidades predefinidas:**

source: Choose File → Preferences... → Interface.
es: Elegir Archivo → Preferencias... → Interfaz.

source: Do one of the following:
es: Hacer uno de lo siguiente:

source: In the **Unit** option menu choose the unit you want to use as default.
es: En la opción **Unidades:** elegir la unidad deseada como predefinida.

source: In the **Camera Unit** option menu choose the unit you want to use to express the camera size.
es: En la opción **Unidades de cámara:** elegir la unidad a usar para expresar el tamaño de la cámara.

source: Setting the Frame Rate
es: Definición de la velocidad

source: |scene_settings|
es: |scene_settings_es|

source: The frame rate is the number of frames per second of animation, and has to be set according to the type of output you have to render, for instance it should usually be 24 for cinematic production, 25 for PAL output, or 30 for NTSC.
es: La **Velocidad (fps)** es la cantidad de fotogramas que transcurren durante un segundo de animación, y debe ser determinado de acuerdo al tipo de formato de salida que se deberá procesar, por ejemplo usualmente deberá ser 24 para una producción cinematográfica, 25 para PAL o 30 para NTSC.

source: The current scene frame rate can be set in the Scene Settings... dialog, and it is displayed in the bottom bar of any Viewer pane. In case the play back is activated, the actual frame rate is displayed on its left.
es: La velocidad de fotogramas de la escena actual puede ser definida en el diálogo Opciones de escena..., y es mostrada en la barra inferior del panel del Visor. Al activar la reproducción, la velocidad real también es mostrada a su izquierda.

source: Apart from affecting the playback speed when previewing or rendering a scene, the frame rate also determines the frame count of an audio file when it is imported into the Xsheet (see :ref:`Creating a Soundtrack <creating_a_soundtrack>` ).
es: Además de afectar la velocidad de reproducción al previsualizar o procesar una escena, la velocidad también determina la cantidad de fotogramas de un archivo de audio, al ser importado a la Planilla (ver :ref:`Creación de una banda de sonido <creating_a_soundtrack>` ).

source: Even if a scene has been composited with a specific frame rate for a certain output, it is possible to render it out at a different frame rate by using the Stretch from FPS: To: option in the Output Settings... → More Settings dialog section (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: Aunque una escena haya sido creada usando una determinada velocidad y para un cierto tipo de formato de salida, es posible procesarla a una velocidad distinta, usando la opción **Estirar (fps) Desde: Hasta:** en el diálogo Opciones de salida... → Más opciones. (ver :ref:`Elección de Opciones de salida <choosing_the_output_settings>` ).

source: |stretch_fps_to|
es: |stretch_fps_to_es|

source: **To set the frame rate:**
es: **Para definir la velocidad:**

source: Choose Xsheet → Scene Settings... → More.
es: Elegir Planilla → Opciones de escena...

source: In the Frame Rate text field set the frame rate value.
es: En el campo **Velocidad (fps):** ingresar el valor de fotogramas por segundo.

source: Defining Camera Settings
es: Definición de opciones de cámara

source: |camera_settings|
es: |camera_settings_es|

source: The Current Camera Settings dialog, that can be opened from the Xsheet menu, contains parameters for defining the current camera frame size and resolution.
es: El diálogo Opciones de cámara actual, que puede ser abierto desde el menú Planilla, contiene parámetros para definir el tamaño y resolución de la cámara actual.

source: More than one camera can be defined for each scene, in order to have different output resolutions, or to shot only a particular area of the scene (see :ref:`Using the Stage Schematic <using_the_stage_schematic>` ).
es: Es posible definir más de una cámara en una escena, para poder tener varias resoluciones de salida o para enfocar sólo un área en particular de la escena (ver :ref:`Uso del Diagrama de escenario <using_the_stage_schematic>` ).

source: The camera frame size can be expressed in any unit, but will be visualized in the default one chosen in the Preferences... → Interface dialog (see :ref:`Choosing the Working Unit <choosing_the_working_unit>` ).
es: El tamaño de la cámara puede ser expresado en cualquier unidad, sin embargo será mostrado en la unidad predefinida elegida en el diálogo Preferencias... → Interfaz (ver :ref:`Elección de unidades de trabajo <choosing_the_working_unit>` ).

source: In OpenToonz the Camera is defined by different parameters:
es: En OpenToonz una Cámara es definida por medio de distintos parámetros:

source: X (Width) and Y (Height) frame size of the camera, expressed in the default Camera Unit (usually inches).
es: **Tamaño** horizontal (X) y vertical (Y) de la imagen vista por la cámara, expresado en Unidades de cámara (usualmente pulgadas).

source: **A/R** is the aspect ratio value resulting by dividing Width/Height.
es: **Proporción** es el resultado de dividir ancho/altura.

source: X and Y resolution **Pixels** of the resulting image frame seen by the camera.
es: **Píxeles** horizontales (X) y verticales (Y) de la imagen vista por la cámara.

source: X and Y **DPI** values, calculated using the standard formulas: XDpi=XPx/Width, and YDpi=YPx/Height. This two fields can be forced to have the same value, by activating the equal-sign button between them.
es: **PPP** (píxeles por pulgada) horizontales (X) y verticales (Y), calculados usando las fórmulas estándar: pppX=píxX/tamX y pppY=píxY/tamY. Es posible forzar a que estos dos parámetros tengan el mismo valor, activando el botón con el símbolo de igual, que se encuentra entre ellos.

source: When inserting a value in one field, the others change accordingly as needed for having a consistent camera. You can decide which set of values has to be considered fixed by OpenToonz. The lock-shaped buttons and the radio buttons at the leftmost column of the camera parameters, let you select which column and row of values has to be preserved by OpenToonz, while changing the others as needed.
es: Al ingresar un valor en uno de los campos, los otros cambiarán de la forma apropiada como sea necesario para mantener valores consistentes de cámara. Es posible decidir cuál conjunto de valores OpenToonz debe mantener fijo. Los botones con forma de candado y los botones alternativos a la izquierda del diálogo permiten seleccionar qué fila y columna de valores deberá ser preservada por OpenToonz, al cambiar los otros como sea necesario.

source: The **Use Current Level Settings** button let you set the camera for framing exactly the content of the selected level. Just press this button and OpenToonz will calculate the appropriate values for the camera.
es: El botón **Usar opciones del nivel actual** permite definir una cámara que se ajuste exactamente al contenido del nivel seleccionado. Basta con presionarlo para que OpenToonz calcule los valores apropiados para la cámara.

source: Camera resolutions can also be selected from a list of predefined camera settings. You can add any camera preset you define to the list, as well as remove any predefined camera from it.
es: La resolución de la cámara también puede ser seleccionada de una lista de opciones predefinidas de cámara. Es posible agregar nuevos ajustes prestablecidos, así como eliminarlos.

source: The predefined cameras list is saved in the file ``reslist.txt`` stored in the projectroot (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
es: La lista de ajustes predefinidos de cámara es almacenada en el archivo` `reslist.txt`` en el directorio principal de proyectos (ver :ref:`Definición del directorio principal de proyectos <setting_the_projectroot>` ).

source: **To add a preset camera resolution:**
es: **Para agregar un ajuste predefinido de cámara:**

source: Set the resolution and A/R for the camera you want to save.
es: Definir la **Resolución** y **Proporción** de la cámara que se desea guardar.

source: Click the **Add** button on the right of the preset cameras list.
es: Hacer clic en el botón **Agregar** a la derecha de la lista de ajustes predefinidos.

source: Assign a name to the camera resolution and click the **OK** button.
es: Asignar un nombre al ajuste de cámara y presionar el botón **Aceptar**.

source: **To remove a preset camera resolution:**
es: **Para eliminar un ajuste predefinido de cámara:**

source: Select the camera resolution you want to remove in the preset cameras list.
es: Seleccionar el ajuste de cámara que se desea eliminar de la lista.

source: Click the **Remove** button on the right of the preset cameras list.
es: Hacer clic en el botón **Eliminar** a la derecha de la lista de ajustes predefinidos.

source: Color Calibration using Look-up Tables
es: Calibración de color usando Tablas de consulta

source: OpenToonz can manage the previsualization of color through the use of 3D Look-up Tables. By applying a 3D LUT file, properly configured for the current display monitor, it will be possible to work on different color spaces, such as `Rec. 709 <https://en.wikipedia.org/wiki/Rec._709>`_, `DCI-P3 <https://en.wikipedia.org/wiki/DCI-P3>`_ or `Rec. 2020 <https://en.wikipedia.org/wiki/Rec._2020>`_.
es: OpenToonz es capaz de administrar la previsualización del color a través del uso de Tablas de consulta 3D (más conocidas como 3D Look-up Tables). Mediante la aplicación de un archivo 3D LUT, apropiadamente configurado para el monitor que se esté usando, será posible trabajar en distintos espacios de color, tales como `Rec. 709 <https://en.wikipedia.org/wiki/Rec._709>`_, `DCI-P3 <https://en.wikipedia.org/wiki/DCI-P3>`_ o `Rec. 2020 <https://en.wikipedia.org/wiki/Rec._2020>`_.

source: Once a 3DLUT is active, all colors displayed on Viewer, Combo Viewer, Flipbook, Color Model, Palette, and Style Editor will be corrected.
es: Una vez que se haya configurado un 3DLUT, todos los colores visualizados en el Visor, el Visor compuesto, el Reproductor, el Modelo de color, la Paleta y el Editor de estilos se mostrarán con la correspondiente corrección de color.

source: Currently, only the .3dl file format is supported. It must follow specification written `here <http://download.autodesk.com/us/systemdocs/help/2009/lustre_ext1/index.html?url=WSc4e151a45a3b785a24c3d9a411df9298473-7ffd.htm,topicNumber=d0e8061>`_.
es: Actualmente, sólo se soporta el formato de archivo .3dl. El mismo deberá seguir las especificaciones descriptas en el siguiente `enlace <http://download.autodesk.com/us/systemdocs/help/2009/lustre_ext1/index.html?url=WSc4e151a45a3b785a24c3d9a411df9298473-7ffd.htm,topicNumber=d0e8061>`_.

source: Currently, only the Windows version of OpenToonz can detect the currently connected monitor. For other platforms only one 3D LUT file can be applied for any type of monitors. (Even on Windows, connecting multiple different monitors at the same time is not supported for now. It will only identify the first registered monitor).
es: Actualmente, sólo la versión de Windows de OpenToonz será capaz de detectar el monitor actual conectado. Para otras plataformas simplemente aplicar un archivo 3D LUT para cualquier tipo de monitor. (Inclusive en Windows, no será posible detectar varios monitores de distintos tipos conectados al mismo tiempo. Se detectará únicamente el monitor registrado en primer lugar).

source: PLEASE NOTE: At the moment, using Plastic deformation together with this feature causes a display issue such that the deformed image is not shown in *Camera Stand* mode of the Viewer.
es: POR FAVOR NOTAR: Actualmente, al usar deformaciones hechas mediante la herramienta Plástico, mientras esta opción se encuentre activa, se producirá un problema que impedirá la correcta visualización de la imagen deformada en el modo **Vista de mesa de trabajo** del Visor.

source: **To apply a 3DLUT file for previsualizing color:**
es: **Para aplicar un archivo 3DLUT para calibrar la previsualización del color:**

source: Activate the **Color Calibration using 3D Look-up Table** option.
es: Activar la opción **Calibración de color usando una tabla de consulta 3D**.

source: In the **3DLUT File for [monitor]:** option, press the file browser button to navigate and select the desired .3DL file.
es: En la opción **Archivo 3DLUT para [monitor]:**, presionar el botón del Explorador de archivos para navegar y seleccionar el archivo .3DL deseado.

source: Restart OpenToonz for the changes to take effect.
es: Reiniciar OpenToonz para que los cambios entren en vigor.

source: Assigning Memory for the Undo Operations
es: Asignación de memoria para las operaciones Deshacer

source: All the operations performed in the software can be undone by using the Edit → Undo command, even to go back for several steps.
es: Todas las operaciones realizadas pueden ser deshechas, usando el comando Editar → Deshacer.

source: Undo operations require computer memory in order to be performed, and some of them may require more memory than some others, according to their complexity.
es: Deshacer operaciones requiere de memoria para almacenarlas previamente y es posible que algunas de ellas requieran más que otras, de acuerdo a su complejidad.

source: To prevent most of the computer memory to be used by undo operations while you work, a situation that slows down the software performance, it is possible to set a limit for it by specifying the Undo Memory Size (MB) in the Files → Preferences... → General dialog.
es: Para prevenir que esto llegue a usar una cantidad significativa de memoria del sistema y enlentecer el rendimiento del programa, es posible establecer un límite, usando la opción **Deshacer - Tamaño de memoria (MB)** en el diálogo Archivo → Preferencias... → General.

source: As soon as the limit is reached, the oldest undo operations will be discarded to make room for the new ones.
es: Tan pronto como el limite es alcanzado, las operaciones más antiguas almacenadas serán descartadas para hacer espacio para las nuevas.

source: Optimizing the Memory Usage
es: Optimización del uso de memoria

source: When working with Raster images, predominantly being animation levels scanned with OpenToonz or GTS, an extensive usage of computer memory may be required during the cleanup, painting and rendering processes.
es: Al trabajar con imágenes de mapa de bits (en general niveles de animación escaneados con OpenToonz o GTS), es posible que se requiera un uso intensivo de memoria durante los procesos de limpieza, pintado y procesamiento de los mismos.

source: After a certain amount of time the computer performance may worsen, as the memory gets fragmented because of the several writing and reading accesses. To prevent this behavior, the Minimize Raster Memory Fragmentation* option can be activated in the Files → Preferences... → General dialog. When activated, a section of computer memory is reserved and used only for operations concerning Raster images.
es: Luego de cierto tiempo, es posible que el rendimiento del sistema decrezca a medida que la memoria comienza a quedar fragmentada por el uso de sucesivos procesos de escritura, lectura y borrado. Para prevenir esta situación, es posible activar la opción **Minimizar fragmentación de imágenes en memoria** en el diálogo Archivo → Preferencias... → General. Al estar activada, una porción de la memoria del sistema será reservada solamente para su uso en operaciones relativas a imágenes de mapa de bits.

source: If you are working mainly with vector images, that have been drawn inside OpenToonz, this option should be deactivated, as the reserved memory section would be otherwise unused by the computer.
es: Si se trabaja principalmente con imágenes vectoriales creadas en OpenToonz, esta opción debería permanecer desactivada, ya que de otro modo esa sección reservada de memoria quedaría prácticamente inutilizada.

source: The change set for this option is valid only after OpenToonz is restarted.
es: Los cambios definidos para esta opción será válidos recién luego de que OpenToonz sea reiniciado.
