Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/using_the_particles_effect.po
Languages: es

source: For example with a horizontal scattering between 1 and 8, and a Swing value with the minimum and maximum set to 10, the particle will be shifted with a random value of between 1 and 8 to the right for 10 frames; then at frame 11 the scattering changes, so that the random value between 1 and 8 will shift the particle to the left for the following 10 frames.
es: Por ejemplo, para una dispersión horizontal de entre 1 y 8, y un valor de **Swing** con su mínimo y máximo en 10, la partícula será desplazada usando un valor aleatorio de entre 1 y 8 hacia la derecha durante 10 fotogramas; luego en el fotograma 11 la dispersión cambiará, de manera que la partícula sea desplazada usando un valor aleatorio de entre 1 y 8 hacia la izquierda, durante los siguientes 10 fotogramas.

source: Particles birth properties can be transformed during their lifetime, for example particles can rotate, or change size, by using additional settings available in the Animation page.
es: Las propiedades de nacimiento de las partículas podrán ser transformadas a lo largo de su vida, por ejemplo éstas podrán rotar o cambiar su tamaño, mediante el uso de las opciones adicionales presentes en la solapa **Animation** (Animación).

source: Rotation
es: Rotation (Rotación)

source: Controls the way each particle rotates around its center throughout its life.
es: Permite controlar la forma en que las partículas rotarán alrededor de su centro a lo largo de su vida.

source: Rotation Speed
es: Rotation Speed (Velocidad de rotación)

source: Makes the particles rotate constantly as frames increase, and is expressed in degree per frame. Positive values makes the particle spin clockwise.
es: Permite lograr que las partículas roten de forma constante, a medida que avanzan los fotogramas; la propiedad estará expresada en grados por fotograma. Valores positivos harán que las partículas roten en sentido horario.

source: Unlike the directional **Speed** parameter, this parameter is not a birth attribute. This means that if in a 20 frames animation you animate the **Rotation Speed** value from -30 to 30, during the animation all the particles will rotate together, counterclockwise for the first 10 frames, then clockwise for the next 10 frames.
es: A diferencia de **Speed** (Velocidad), que otorga una velocidad direccional, esta no es una propiedad de nacimiento de las partículas. Esto significa que si en una animación de 20 fotogramas se animara el valor **Rotation Speed** (Velocidad de rotación) desde -30 a 30, durante dicha animación todas las partículas rotarán juntas en sentido antihorario durante 10 fotogramas y luego en sentido horario durante los siguientes 10 fotogramas.

source: Extra Speed
es: Extra Speed (Velocidad extra)

source: Sets the minimum and maximum value that is randomly added to the rotational speed, thus creating a more chaotic rotation.
es: Permite definir el valor mínimo y máximo que será adicionado aleatoriamente a la velocidad de rotación, creando así una rotación más caótica.

source: A particle animation with a fixed rotation speed, and with extra speed including smooth swing.
es: Una animación de partículas con una velocidad de rotación fija, y con una velocidad extra incluyendo un efecto suave de péndulo.

source: Sets the way the spinning is performed; options are the following:
es: Permite definir la forma en que los valores de rotación serán usados; las opciones disponibles son las siguientes:

source: **Random**, adds the extra speed values to the rotation of the particles at each frame.
es: **Random** (Aleatorio), adicionará los valores extra a la rotación de las partículas en cada fotograma.

source: **Smooth**, reaches the rotational extra speed value by interpolating values, in order to create a smooth movement. The interpolation lasts as many frames as set by the swing value; when the extra speed value is reached, new values for each parameter are generated.
es: **Smooth** (Suave), permitirá alcanzar los valores adicionales de rotación mediante una interpolación suave, para crear una movimiento suave. La interpolación durará tantos fotogramas como se indique en el valor **Rotation Swing** (Péndulo de rotación); una vez se hubiera alcanzado el valor de rotación adicional, se generarán nuevos valores para cada parámetro.

source: Rotation Swing
es: Rotation Swing (Péndulo de rotación)

source: Sets the minimum and maximum number of frames throughout which the extra speed values will vary, while remaining either positive or negative. This allows you to set a swinging movement where each swing lasts a random number of frames, having a random extra speed at each frame.
es: Permite definir la cantidad mínima y máxima de fotogramas a lo largo de los cuales variarán los valores de dispersión horizontal y vertical, mientras se mantienen siendo positivos o negativos. Esto permitirá definir el movimiento pendular, donde cada ciclo pendular durará una cierta cantidad aleatoria de fotogramas, y teniendo una dispersión aleatoria en cada fotograma.

source: Follow Particles Movement
es: Follow Particles Movement (Seguir el movimiento de las partículas)

source: Rotates the particles according to their movement direction. The particle preserves its original orientation when the movement is horizontal to the right.
es: Permite rotar las partículas de acuerdo a la dirección de su movimiento. Las partículas preservarán su orientación original cuando su movimiento sea horizontal hacia la derecha.

source: A particle animation without and with the Follow Particles Movement option.
es: Una animación de partículas sin y luego con la opción **Follow Particles Movement** activa.

source: Opacity
es: Opacity (Opacidad)

source: Sets a fade-in process at the beginning of particles life, and a fade-out process at the end, according to the set minimum and maximum opacity values.
es: Permite definir un proceso de *fundido entrante* al comienzo de la vida de las partículas, así como uno de *fundido saliente* al final de la misma, de acuerdo a los valores máximos y mínimos establecidos.

source: Sets the minimum and maximum opacity values for the fade-in and fade-out processes. Values are expressed as a percentage, where 100 is the original opacity.
es: Permite definir los valores máximo y mínimo de opacidad para los procesos de fundido entrante y saliente. Los valores estarán expresados como porcentajes, donde 100 representará al valor original de opacidad de las partículas.

source: The fade-in process begins from the minimum value and reaches the maximum value at the end; the fade-out process begins from the maximum value and reaches the minimum value at the end.
es: El proceso de *fundido entrante* comenzará desde el valor mínimo y alcanzará el máximo al final; el proceso de *fundido saliente* comenzará desde el valor máximo y alcanzará el mínimo al final.

source: Fade-in Frames
es: Fade-in Frames (Fotogramas de fundido entrante)

source: Sets the number of frames the fade-in process lasts, starting from the first frame of the particle life.
es: Permite establecer la cantidad de fotogramas de duración del fundido entrante, comenzando desde el primer fotograma de la vida de cada partícula.

source: Fade-out Frames
es: Fade-out Frames (Fotogramas de fundido saliente)

source: Sets the number of frames the fade-out process lasts, starting from the last frame of the particle life and counting backward.
es: Permite establecer la cantidad de fotogramas de duración del fundido saliente, comenzando desde el último fotograma de la vida de cada partícula y contando hacia atrás.

source: Sets the opacity of the images used for the trail: the minimum value is the opacity of the oldest particle in the trail; the maximum value is the opacity of the youngest one (see :ref:`Trail <trail>` ).
es: Permite definir la opacidad de las imágenes usadas para la estela: el valor mínimo representa a la opacidad de la partícula más antigua en la estela; el valor máximo a la opacidad de la más reciente (ver :ref:`Trail (Estela) <trail>` ).

source: Size Increase
es: Size Increase (Aumento del tamaño)

source: Size Intensity
es: Size Intensity (Intensidad del tamaño)

source: Sets the minimum and maximum scaling factor to be applied to the particle in each frame. Positive values are for increasing the size of the particles, negative ones for decreasing it. Values are expressed as a percentage.
es: Permite definir el factor mínimo y máximo de escala a ser aplicado a las partículas en cada fotograma. Valores positivos incrementarán el tamaño de las partículas, mientras que los negativos lo disminuirán. Los valores son expresados en forma de porcentaje.

source: Sets if and which control image has to be used to control particles size increase (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *imagen de control* para controlar el incremento del tamaño de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de control <defining_control_images>`).

source: If used, the size increase value range defined above will be distributed according to the brightness value of the control image: particles will increase in size faster where the image is brighter.
es: Si se usara, el rango de valores de incremento de tamaño definido más arriba será distribuido de acuerdo a los valores de luminosidad de la *imagen de control*: las partículas incrementarán su tamaño más rápidamente donde la imagen sea más luminosa.

source: Colors
es: Colors (Colores)

source: Particles can fade to specific colors at their birth, during their life and just before their death, by specifying settings in the Color page. The color parameters are birth attributes, i.e. they are assigned to the particles when they are generated.
es: Será posible controlar el color de las partículas en el momento de su nacimiento, durante toda su vida y justo antes de su muerte, mediante la definición de las opciones de la solapa **Colors** (Colores).

source: Birth Color
es: Birth Color (Color de nacimiento)

source: Sets the range of colors to which particles fade at their birth, by defining a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ).
es: Permite definir el rango de colores a los que las partículas serán fundidas en el momento de su nacimiento, mediante un gradiente de colores (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ).

source: Sets if and which control image has to be used to define the particles birth colors (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *imagen de control* para definir los colores de nacimiento de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de control <defining_control_images>`).

source: If used, particles will pick their birth color from the control image pixels according to their birth position.
es: Si se usara, se escogerá el color de nacimiento de las partículas a partir del color de los píxeles de la *imagen de control*, de acuerdo a la posición en que se produzca el nacimiento de cada partícula.

source: A control image used to assign color to the generated particles.
es: Una imagen de control usada para asignar color a las partículas generadas.

source: Birth Spread
es: Birth Spread (Dispersión de nacimiento)

source: Sets a spread value that will be added to the red, green and blue values of the color to which particles fade at their birth.
es: Permite definir un valor de dispersión que será adicionado a los valores de rojo, verde y azul del color de nacimiento de la partícula.

source: In this way particles will fade to a range of colors spreading from the colors defined in the spectrum or in the control image.
es: De esta manera será posible que las partículas se fundan a una gama de colores, a partir de los colores definidos en el gradiente o en la *imagen de control*.

source: Birth Intensity
es: Birth Intensity (Intensidad de nacimiento)

source: Sets the intensity of the birth color-fading.
es: Permite definir la intensidad del fundido a un color, al momento del nacimiento.

source: Pick Control Image's Color for Every Frame
es: Pick Control Image's Color for Every Frame (Tomar color de imagen de control en cada fotograma)

source: When activated, at every frame the Control Image pixels will be sampled in the current position of the particles, changing their color.
es: Cuando se encuentre activa, en cada fotograma se tomarán muestras de los píxeles de la *imagen de control* en las posiciones de cada partícula, para cambiar su color.

source: Fade-in Color
es: Fade-in Color (Color de fundido entrante)

source: Sets the range of colors to which particles fade at a certain number of frames after their birth, by defining a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ).
es: Permite definir el rango de colores a los que las partículas serán fundidas, una cierta cantidad de fotogramas después de su nacimiento, mediante un gradiente de colores (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ).

source: Sets if and which control image has to be used to define the particles fade-in colors (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *imagen de control* para definir los colores de fundido entrante de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de control <defining_control_images>`).

source: If used, particles will pick their fade-in color from the control image pixels according to their position.
es: Si se usara, se escogerá el color de fundido entrante de las partículas a partir del color de los píxeles de la *imagen de control*, de acuerdo a la posición de las mismas.

source: Fade-in Spread
es: Fade-in Spread (Dispersión de fundido entrante)

source: Sets a spread value that will be added to the red, green and blue values of the color to which particles fade in.
es: Permite definir un valor de dispersión que será adicionado a los valores de rojo, verde y azul del color al que las partículas serán fundidas.

source: Frame Range
es: Frame Range (Rango de fotogramas)

source: Fade-in Intensity
es: Fade-in Intensity (Intensidad de fundido entrante)

source: Sets the intensity of the fade-in process.
es: Permite definir la intensidad del proceso de fundido entrante.

source: Fade-out Color
es: Fade-out Color (Color de fundido saliente)

source: Sets the range of colors to which particles fade starting from a certain number of frames before their death, by defining a color spectrum (see :ref:`Defining Colors and Color Spectrums <defining_colors_and_color_spectrums>` ).
es: Permite definir el rango de colores a los que las partículas serán fundidas, una cierta cantidad de fotogramas antes de su muerte, mediante un gradiente de colores (ver :ref:`Definición de colores y espectros de colores <defining_colors_and_color_spectrums>` ).

source: Sets if and which control image has to be used to define the particles fade-out colors (see :ref:`Defining Control Images <defining_control_images>` ).
es: Permite establecer si deberá usarse una *imagen de control* para definir los colores de fundido saliente de las partículas y cuál deberá ser usada (ver :ref:`Definición de imágenes de control <defining_control_images>`).

source: If used, particles will pick their fade-out color from the control image pixels according to their position.
es: Si se usara, se escogerá el color de fundido saliente de las partículas a partir del color de los píxeles de la *imagen de control*, de acuerdo a la posición de las mismas.

source: Fade-out Spread
es: Fade-out Spread (Dispersión de fundido saliente)

source: Sets a spread value that will be added to the red, green and blue values of the color to which particles fade out.
es: Permite definir un valor de dispersión que será adicionado a los valores de rojo, verde y azul del color al que las partículas serán fundidas.

source: Fade-out Intensity
es: Fade-out Intensity (Intensidad de fundido saliente)

source: Sets the intensity of the fade-out process.
es: Permite definir la intensidad del proceso de fundido saliente.
