Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/whats_new.po
Languages: fa

source: What's New in OpenToonz
fa: چیز های جدید در اوپن تونز

source: In this section you can find a list of Highlights in the latest release of OpenToonz; these may include New Features, Bug Fixes or Enhancements to already existent features. Here, you can also find links to past versions' Release Notes, to keep track of OpenToonz development history throughout time.
fa: در این بخش شما می توانید لیستی از موارد برجسته در آخرین نسخه اوپن تونز را پیدا کنید. این ها ممکن است شامل ویژگی های جدید، رفع مشکل ها یا بهبود هایی در ویژگی های در حال حاضر موجود باشد. در اینجا، می توانید لینک هایی به یادداشت های انتشار نسخه های گذشته پیدا کنید؛ برای پیگیری تاریخچه توسعه اوپن تونز در طول زمان.

source: v1.4
fa: نسخه ۱.۴

source: Highlights
fa: موارد برجسته

source: |new| **Stop-Motion panel** & Canon DSLR Camera Capture support (Windows only).
fa: |new| **Stop-Motion panel** & Canon DSLR Camera Capture support (فقط ویندوز).

source: |new| Toolbar: Now tool availability is **Context Aware**.
fa: |new| نوار ابزار: Now tool availability is **Context Aware**.

source: |new| Fill Tool: Can now be used in **Raster Levels**.
fa: |new| ابزار Can now be used in **Raster Levels** :Fill.

source: |new| Playback: New **Short Play** command.
fa: |new| پخش: New **Short Play** command.

source: |new| Import/Export: **XDTS File Support** (Celsys and Toei Animation xsheet file format).
fa: |new| وارد کردن/خروجی گرفتن: **XDTS File Support** (Celsys and Toei Animation xsheet file format).

source: |new| Effects: **Corridor Gradient Iwa**.
fa: |new| افکت ها: **Corridor Gradient Iwa**.

source: |new| Effects: **Spin Gradient Iwa**.
fa: |new| افکت ها: **Spin Gradient Iwa**.

source: |new| Shortcuts: New shortcuts for **Next/Previous Keyframe** commands.
fa: |new| میانبر ها: میانبر های جدید برای دستور های **کی فریم بعدی/قبلی**.

source: |new| Viewer: **Color settings** for Viewer Background in Level editing mode.
fa: |new| Viewer: **تنظیمات رنگ** for Viewer Background in Level editing mode.

source: |new| UI: New Help menu options **Online Manual**, **What's New**, **Community Forum** and **Report a Bug**.
fa: |new| رابط کاربری: New Help menu options **Online Manual**, **What's New**, **Community Forum** and **Report a Bug**.

source: |new| UI: New **Korean** translation. (Initial version)
fa: |new| رابط کاربری: ترجمه **کره ای** جدید. (نسخه اولیه)

source: |new| Effects: **Help in English and Spanish**.
fa: |new| افکت ها: **Help به انگلیسی و اسپانیایی**.

source: |new| OpenToonz Manual: New **Spanish** translation.
fa: |new| کتابچه راهنمای اوپن تونز: ترجمه **اسپانیایی** جدید.

source: |enhancement| UI: **Updated/Reorganized Menus**.
fa: |enhancement| رابط کاربری: **Updated/Reorganized Menus**.

source: |enhancement| Level Settings window: Now can act upon **Multiple Selected levels**.
fa: |enhancement| پنجره Now can act upon **Multiple Selected levels** :Level Settings.

source: |enhancement| Effects: Added **Swap Colors Button** in Gradient effects.
fa: |enhancement| افکت ها: Added **Swap Colors Button** in Gradient effects.

source: |enhancement| Animate Tool: Precise control using **Alt** key.
fa: |enhancement| ابزار Precise control using **Alt** key :Animate.

source: |enhancement| Brush Tool: Remember last brush preset used.
fa: |enhancement| ابزار Remember last brush preset used :Brush.

source: |enhancement| Control Point Editor Tool: Make **Control Points easier to select**.
fa: |enhancement| ابزار Make **Control Points easier to select** :Control Point Editor.

source: |enhancement| Sound: **Improved Sound Quality** for Playback and Scrubbing. (Linux only)
fa: |enhancement| صدا: **کیفیت صدا بهبود یافته** برای پخش و Scrubbing. (فقط لینوکس)

source: ...and much more!
fa: ...و خیلی بیشتر!

source: Please see the `v1.4 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.4.0>`_ hosted in GitHub, for the full list of new features, enhancements and bug fixes.
fa: لطفا برای لیست کامل ویژگی های جدید، بهبود ها و رفع مشکل ها، `یادداشت های انتشار نسخه ۱.۴ <https://github.com/opentoonz/opentoonz/releases/tag/v1.4.0>`_ میزبانی شده در گیت هاب را مشاهده کنید.

source: Previous Versions of OpenToonz
fa: نسخه های قبلی اوپن تونز

source: Here you can find links to previous versions' full Release Notes, hosted in GitHub:
fa: در اینجا شما می توانید لینک هایی به یادداشت های انتشار کامل نسخه های قبلی، میزبانی شده در گیت هاب پیدا کنید:

source: `v1.3 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.3.0>`_
fa: `یادداشت های انتشار نسخه ۱.۳ <https://github.com/opentoonz/opentoonz/releases/tag/v1.3.0>`_

source: `v1.2.1 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.2.1>`_
fa: `یادداشت های انتشار نسخه ۱.۲.۱ <https://github.com/opentoonz/opentoonz/releases/tag/v1.2.1>`_

source: `v1.2 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.2.0>`_
fa: `یادداشت های انتشار نسخه ۱.۲ <https://github.com/opentoonz/opentoonz/releases/tag/v1.2.0>`_

source: `v1.1.3 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.3>`_
fa: `یادداشت های انتشار نسخه ۱.۱.۳ <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.3>`_

source: `v1.1.2 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.2>`_
fa: `یادداشت های انتشار نسخه ۱.۱.۲ <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.2>`_

source: `v1.1 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.0>`_
fa: `یادداشت های انتشار نسخه ۱.۱ <https://github.com/opentoonz/opentoonz/releases/tag/v1.1.0>`_

source: `v1.0.3 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.0.3>`_
fa: `یادداشت های انتشار نسخه ۱.۰.۳ <https://github.com/opentoonz/opentoonz/releases/tag/v1.0.3>`_

source: `v1.0.2 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.0.2>`_
fa: `یادداشت های انتشار نسخه ۱.۰.۲ <https://github.com/opentoonz/opentoonz/releases/tag/v1.0.2>`_

source: `v1.0 Release Notes <https://github.com/opentoonz/opentoonz/releases/tag/v1.0>`_
fa: `یادداشت های انتشار نسخه ۱.۰ <https://github.com/opentoonz/opentoonz/releases/tag/v1.0>`_
