Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: When duplicating files, the new files will be renamed by appending an underscore followed by progressive numbering.
es: Al duplicar archivos, los nuevos archivos creados serán renombrados agregándoles un guion bajo ( _ ) seguido de un número progresivo.

source: You can also separate the colors of an image or image sequence by using the **Separate Colors...** command. For more details on its options, please see the :ref:`Separate Colors <separate_colors>` section.
es: También es posible separar los colores de una imagen o secuencia de imágenes, mediante el uso del comando **Separar colores...** Para obtener más detalles acerca de sus opciones, por favor ver la sección :ref:`Separación de colores <separate_colors>` section.

source: When renaming, files will be renamed according to the name you specify; an option allows you also to delete the original files. This can be used both for renaming sequences of image files in one shot, and for converting sequence numbering modes to the OpenToonz standard one (i.e. a progressive four-digits number written between the file name and the file extension) by selecting only the first file of a sequence.
es: Al renombrar archivos, esto se hará de acuerdo al nombre que se especifique; una opción también permite borrar los archivos originales. Es posible usar esta función, tanto para renombrar secuencias de imágenes de una toma, como para convertir formatos de numeración de una secuencia al formato estándar de OpenToonz (con un número progresivo de cuatro dígitos, entre el nombre base y la extensión del archivo) seleccionando únicamente el primer archivo de la secuencia.

source: When premultiplied, the file alpha channel is modified to be properly displayed in OpenToonz. Images which have a meaningful alpha channel come in two types: premultiplied or straight. A non-premultiplied (straight) image can be recognized when it's loaded in OpenToonz because its edges, where there is a complete transparence on one side and opacity on the other, are not smooth, but displays show a solid halo; by premultiplying the image it's possible to fix this problem. This is available only for full-color images.
es: Mediante la premultiplicación, el canal alfa es modificado para ser mostrado de forma correcta en OpenToonz. Las imágenes que cuentan con información de canal alfa, pueden contenerla en dos formatos distintos: premultiplicado o directo. Es posible reconocer a una imagen que contenga un canal alfa directo (no premultiplicado) por la apariencia de sus bordes, en los que se puede apreciar un pasaje abrupto entre opacidad y transparencia, así como un halo sólido; mediante la premultiplicación de su canal alfa es posible corregir este problema. Esta opción se encuentra disponible únicamente para imágenes normales.

source: When converting files, a dialog prompts the frame range to convert, a saving location, a name, the new format with related options and a color for the background of the converted file. It is also possible to select more files at once but, in this case, the frame range and the file name fields won’t be available. All levels, images and clips supported by OpenToonz can be converted. The PLI vector files can also be converted to the SVG format.
es: Al convertir archivos, un diálogo emergente permitirá elegir el rango a ser convertido, la ubicación de guardado, el nuevo nombre y formato de archivo, con sus opciones correspondientes, así como el color del fondo de la imagen generada, en caso de que dicho formato no soporte transparencias. También será posible elegir más de un archivo a la vez, aunque en este caso los campos de rango de fotogramas y nombre de archivo no estarán disponibles. Todos los niveles, imágenes y clips de video soportados por OpenToonz podrán ser convertidos. Los archivos vectoriales PLI también podrán ser convertidos al formato SVG.

source: The **Convert...** command is also available in the File menu as **Convert File...**.
es: El comando **Convertir...** también se encuentra disponible en el menú Archivo → **Convertir archivo...**

source: When converting files to TLV format, it's possible to choose the painted or unpainted TLV formats; all levels, images and clips supported by OpenToonz can be converted, except for PSD files.
es: Al convertir archivos al formato TLV, será posible escoger entre los formatos *pintado* o *no pintado*; todos los niveles, imágenes y clips de video soportados por OpenToonz podrán ser convertidos, excepto los archivos PSD.

source: The conversion to the unpainted TLV format is available when one or several files are selected and it's meant for lineart images: the images and levels are converted into black lineart images with a transparent background, so that they can be painted with the same techniques and tools you can use for other Toonz Raster levels (see :ref:`Painting Animation Levels <painting_animation_levels>` ). In particular if images have some transparency, transparent pixels remain transparent, while solid pixels are transformed into black ones; if images have no transparency, white and lighter pixels will be assumed as transparent, while dark pixels are transformed into black ones.
es: La conversión al formato TLV no pintado se encuentra disponible cuando hay uno o más archivos seleccionados, conteniendo contornos de dibujos: los archivos serán convertidos en imágenes que presentarán contornos negros sobre un fondo transparente, de manera que puedan ser pintadas usando las mismas técnicas y herramientas utilizadas en otros niveles de Imagen de Toonz (ver :ref:`Pintura de niveles de animación <painting_animation_levels>` ). En particular, si las imágenes ya contuvieran alguna transparencia, los píxeles que ya fueran trasparentes permanecerán así, mientras que los sólidos serán transformados en negros; si las imágenes no contuvieran una transparencia previa, los píxeles blancos y los de mayor claridad serán tomados como transparentes, mientras que los oscuros serán transformados en negros.

source: The conversion to the painted TLV format is available when two files are selected or when the selected files are Raster Full color without antialiasing. In the case of the two files, one is meant to be the lineart and the other a painted version of the same image: the images and levels are converted into painted lineart images with a palette, so that they can be edited with the same techniques and tools you can use for other Toonz Raster levels (see :ref:`Managing Palettes and Styles <managing_palettes_and_styles>` and :ref:`Painting Animation Levels <painting_animation_levels>` ). In the case of conversion from Raster Full color without antialiasing, an Heuristic is used to recognize lines and painted areas creating a TLV level where the lines are seen as ink and the painted areas as paint.
es: La conversión al formato TLV pintado se encuentra disponible cuando hay dos archivos seleccionados o cuando los archivos seleccionados son archivos de imagen que no contengan suavizado de bordes. En el caso de haber dos archivos seleccionados, uno deberá contener los contornos del dibujo y el otro la versión pintada de la misma imagen: los archivos serán convertidos en imágenes que presentarán contornos negros pintados, utilizando una determinada paleta, de manera que puedan ser editadas usando las mismas técnicas y herramientas utilizadas en otros niveles de Imagen de Toonz (ver :ref:`Administración de paletas y estilos <managing_palettes_and_styles>` y :ref:`Pintura de niveles de animación <painting_animation_levels>` ). En caso de una conversión a partir de imágenes normales sin suavizado de bordes, se utilizará un cálculo heurístico para reconocer las líneas y áreas pintadas, creando un nivel TLV donde las líneas serán consideradas como tinta y las áreas pintadas como pintura.

source: In particular if images have some transparency, transparent pixels remains transparent, while solid pixels are transformed into lines according to their color; if images have no transparency, white and lighter pixels will be assumed as transparent, while dark pixels are transformed into black lines.
es: En particular, si las imágenes ya contuvieran alguna transparencia, los píxeles que ya fueran trasparentes permanecerán así, mientras que los sólidos serán transformados en líneas de acuerdo a su color; si las imágenes no contuvieran una transparencia previa, los píxeles blancos y los de mayor claridad serán tomados como transparentes, mientras que los oscuros serán transformados en negros.

source: When converting to the TLV format, sequence numbering modes different from the OpenToonz standard one (i.e. a progressive four-digits number written between the file name and the file extension) are supported, so that only the first file of a sequence is required to be selected to include the whole sequence in the conversion.
es: Al convertir al formato TLV, se soportan formatos de numeración de secuencias distintos al estándar de OpenToonz (con un número progresivo de cuatro dígitos, entre el nombre base y la extensión del archivo), de manera que sólo será necesario seleccionar el primer elemento de una secuencia para incluirla en la conversión.

source: **To Duplicate files:**
es: **Para duplicar archivos:**

source: Select the files you want to duplicate.
es: Seleccionar los archivos que se desee duplicar.

source: Right-click any of the selected files and choose **Duplicate** from the menu that opens.
es: Hacer clic derecho sobre cualquiera de ellos y elegir **Duplicar** en el menú.

source: **To Rename files:**
es: **Para renombrar archivos:**

source: Select the files you want to rename.
es: Seleccionar los archivos que se desee renombrar.

source: Right-click any of the selected files and choose **Rename** from the menu that opens.
es: Hacer clic derecho sobre alguno de los archivos seleccionados y elegir **Renombrar** en el menú.

source: In the dialog that opens assign a new name to the file and choose whether to **Delete Original Files** by activating the related option.
es: En el diálogo emergente asignar un nuevo nombre al archivo y elegir si se desea **Borrar archivos originales** activando la opción correspondiente.

source: Click the **Rename** button.
es: Hacer clic en el botón **Renombrar**.

source: **To Premultiply full-color images:**
es: **Para Premultiplicar imágenes con canal alfa:**

source: Select the files you want to premultiply.
es: Seleccionar los archivos que se desee premultiplicar.

source: Right-click any of the selected files and choose **Premultiply** from the menu that opens.
es: Hacer clic derecho en alguno de los archivos seleccionados y elegir **Premultiplicar** en el menú.

source: **To Convert a file to a different format:**
es: **Convertir un archivo a un formato distinto:**

source: Right-click the file you want to convert and choose **Convert...** from the menu that opens. The Convert window change depending on the format of the selected files.
es: Hacer clic derecho sobre el archivo que se desee convertir y elegir **Convertir...** en el menú. La ventana Convertir cambiará sus opciones, dependiendo del formato de los archivos que se hubiera seleccionado.

source: Choose the frame range to convert, the saving location, a name, the new format, and the background color of the converted file.
es: Elegir el rango de fotogramas a convertir, la ubicación de guardado, el nombre, el nuevo formato y el color de fondo del archivo convertido.

source: Activate the **Skip Existing Files** to to prevent overwriting already exixting files.
es: Activar la opción **Omitir archivos existentes** para prevenir la sobrescritura de archivos ya existentes.

source: If needed, set the options for the file format chosen pressing the **Options** button and inserting the new values.
es: Su fuera necesario, definir las opciones para el formato de archivo escogido, presionando el botón **Opciones** y seleccionando las opciones deseadas.

source: Click the **Convert** button.
es: Hacer clic en el botón **Convertir**.

source: **To Convert several files at once to a different format:**
es: **Para Convertir varios archivos a la vez a un formato distinto:**

source: Select the files you want to convert.
es: Seleccionar los archivos que se desee convertir.

source: Right-click any of the selected files and choose **Convert...** from the menu that opens.
es: Hacer clic derecho en alguno de los archivos seleccionados y elegir **Convertir...** en el menú.

source: Check the number of files you are going to convert reading the value from the header of the Convert window.
es: Comprobar la cantidad de archivos que se va a convertir en la barra de título de la ventana Convertir.

source: Choose the saving location, the new format, and the background color of the converted files.
es: Elegir la ubicación de guardado, el nuevo formato y el color de fondo que tendrán los archivos convertidos.

source: If needed, set the options for the file format chosen pressing the Options button and inserting the new values.
es: Su fuera necesario, definir las opciones para el formato de archivo escogido, presionando el botón **Opciones** y seleccionando las opciones deseadas.

source: **To Convert files to the unpainted TLV format:**
es: **Para Convertir archivos al formato TLV no pintado:**

source: Select the lineart files you want to convert.
es: Seleccionar los archivos con contornos de dibujos que se desee convertir.

source: Right-click any of the selected files and choose **Convert** from the menu that opens.
es: Hacer clic derecho en alguno de los archivos seleccionados y elegir **Convertir...** en el menú.

source: Select **Unpainted tlv** from the Mode drop down menu.
es: Definir el **Formato de archivo:** en **TLV** y el **Modo:** en **TLV no pintado**.

source: Choose the saving location and, if you have selected one sequence, the frame range.
es: Elegir la ubicación de guardado y, si se hubiera seleccionado una secuencia, el rango de fotogramas de la misma a ser convertido usando las opciones **Inicio:** y **Fin:**.

source: Activate the **Skip Existing Files** to to prevent overwriting already existing files.
es: Activar la opción **Omitir archivos existentes** para evitar sobrescribir accidentalmente archivos ya existentes.

source: Activate the **Apply Autoclose**.
es: Activar la opción **Aplicar sellado automático**.

source: Choose how to manage Antialiasing fom the drop down menu. You can preserve the original antialiasing selecting **Keep Original Antialiasing**; add some antialiasing selecting **Add Antialiasing with Intensity:** and writing an intensity value in the righthand input field; remove the antialiasing selecting the **Remove Antialiasing using Threshold:** option and writing a threshold value in the righthand input field.
es: Elegir cómo administrar el Suavizado de bordes usando el menú desplegable. Es posible preservar el suavizado de bordes original seleccionando **Mantener original**; agregar suavizado de bordes seleccionando la opción **Agregar suavizado de bordes usando Intensidad** e ingresando un valor de intensidad en el campo de la derecha; eliminar el suavizado de bordes preexistente seleccionando la opción **Eliminar suavizado de bordes usando Umbral** e ingresando un valor para el umbral en el campo de la derecha.

source: Choose how to manage the Palette of the TLV file(s) you are going to create. By default a new palette will be created. If you prefer to use an existing palette press the button next the palette field and use the Browser to locate the palette file (TPL) you wish to use. Set a **Tolerance** value for the correlation between the RGB value of the areas and the indexes color of the palette.
es: Elegir cómo administrar la paleta de los archivos TLV que serán creados. De forma predefinida se creará una nueva paleta. También es posible utilizar una paleta ya existente, presionando el botón a la derecha del campo de **Paleta:** y utilizar el Explorador de archivos para localizar su archivo TPL correspondiente. Es posible establecer un valor de **Tolerancia: ** para la correlación entre el valor RVA de las áreas y los índices de color de la paleta.

source: **To Convert files to the painted TLV format from two images:**
es: **Para Convertir archivos al formato TLV pintado, a partir de dos archivos:**

source: Select the lineart file and the painted version of the same file you want to convert.
es: Seleccionar el archivo de contornos y el de la versión pintada, correspondiente al mismo archivo, que se desee convertir.

source: Select **Painted tlv from two images** from the Mode drop down menu.
es: Definir el **Formato de archivo:** en **TLV** y el **Modo:** en **TLV pintado (a partir de dos imágenes)**.

source: Choose the folder where the unpainted files are located.
es: Escoger la **Carpeta con archivos no pintados:**.

source: Specify the Unpainted File Suffix used for naming the unpainted version of the files (default is _np, but you can use anything you like when preparing the files for convertion).
es: Especificar el **Sufijo de archivos no pintados:** usado al nombrar las versiones no pintadas de los archivos (de forma predefinida es _np, pero es posible usar cualquier sufijo, al preparar los archivos para su conversión).

source: **To Convert files to the painted TLV format from non AA source:**
es: **Para Convertir archivos al formato TLV pintado, a partir de originales sin suavizado de bordes:**

source: Select the *raster full color* file you want to convert.
es: Seleccionar los archivos de imagen que se desee convertir.

source: Choose the output folder.
es: Elegir la carpeta de salida.

source: Activate the **Apply Autoclose** if needed.
es: Activar la opción **Aplicar sellado automático** si fuera necesario.

source: Choose how to manage the Palette of the TLV file(s) you are going to create. By default a new palette will be created. If you prefer to use an existing palette press the button next the palette field and use the Browser to locate the palette file (TPL) you wish to use.
es: Elegir cómo administrar la paleta de los archivos TLV que serán creados. De forma predefinida se creará una nueva paleta. También es posible utilizar una paleta ya existente, presionando el botón a la derecha del campo de **Paleta:** y utilizar el Explorador de archivos para localizar su archivo TPL correspondiente.

source: Separate Colors
es: Separación de colores

source: The **Separate Colors** feature, allows for separating single drawing by colors of pencils, generating independent image files to make it easier to use them in a subsequent compositing workflow.
es: La función **Separar colores** permite separar un dibujo según el color de sus tintas, generando archivos de imagen independientes para hacer más sencillo su uso en un posterior flujo de trabajo de composición.

source: Unlike conventional *threshold-based* algorithms, this feature can produce more natural results, since it separates pixels in a more flexible way, by using the HLS color space.
es: A diferencia de algoritmos convencionales *basados en umbrales*, esta función es capaz de producir resultados más naturales, debido a que separa los píxeles de una manera más flexible, usando el espacio de color TSL.

source: Currently this is a "utility" feature, which means that it's independent from the current loaded scene or active project. It just works on selected raster image files in the File Browser.
es: Actualmente esta característica está implementada como una "utilidad", lo que significa que es independiente de la escena actualmente cargada o del proyecto activo. Funciona sobre los archivos de imagen seleccionados en el Explorador de archivos.

source: The produced output images contain an alpha channel equal to the line intensity.
es: Las imágenes producidas por la misma contendrán un canal alfa equivalente a la intensidad de las líneas.

source: You can compose the line by loading the separated images as levels, or you can also connect the levels to a **MatteIn** effect with some color card if you would like to alter the line color.
es: Es posible componer las líneas cargando las distintas imágenes separadas como niveles o también es posible conectar los niveles a un efecto **MatteIn**, usando una placa de color, si se desea alterar el color de la línea.

source: The available parameters are:
es: Los parámetros disponibles son:

source: **Preview Frame:**, defines the frame to be shown in the preview area.
es: **Fotograma a previsualizar:**, define el fotograma a ser mostrado en el área de previsualización.

source: **Show Mask**, shows the **Alpha Matting** parameters results in the preview area.
es: **Mostrar máscara**, permite ver el resultado de los parámetros de la categoría **Transparencia alfa** en al área de previsualización.

source: **Show Alpha**, shows the generated alpha channel in the preview area. This is the alpha channel that will be present in the new generated image files, product of the separation work.
es: **Mostrar alfa**, permite ver el canal alfa generado en el área de previsualización. Este es el canal alfa que será incluido en los archivos a ser generados, producto del trabajo de separación.

source: **Pick Color**, lets the user pick a color from the left preview area. The picked color will be assigned to the currently selected color swatch.
es: **Escoger color**, permite escoger un color desde el área de previsualización de la izquierda. El color seleccionado será asignado a la miniatura de color seleccionada.

source: You can click and drag over any of the preview area images to pick an average color for the defined rectangle.
es: Es posible hacer clic y arrastrar sobre cualquiera de las imágenes del área de previsualización, para escoger el color promedio del marco rectangular definido.

source: **Paper Color:**, allows to define the paper color, used to calculate transparency of the separated images.
es: **Color del papel:**, permite definir el color del papel, uado para calcular la transparencia de las imágenes separadas.

source: **Main Color:**, allows to define the color for the main ink in the drawings. For better results, it's advised to pick the darkest color possible.
es: **Color principal:**, permite definir el color de la tinta principal usada en los dibujos. Para obtener el mejor resultado posible, se recomienda escoger el color más oscuro posible.

source: **Sub Color1:**, **Sub Color2:** and **Sub Color3:**, allows to define the color for the other respective color inks in the drawings you whish to separate. For better results, it's advised to pick the deepest (darkest, more saturated) color possible.
es: **Sub color 1:**, **Sub color 2:** y **Sub color 3:**, permite definir los colores correspondientes de las demás tintas usadas en el dibujo que se desea separar. Para obtener el mejor resultado posible, se recomienda escoger el color más profundo (oscuro y saturado) posible.

source: The **Sub Color3:** parameters will only show when **Sub3** suffix is enabled, in the **File Suffix:** parameters area.
es: Los parámetros del *Sub color 3:** sólo se mostrarán cuando el sufijo **Sub3** se encuentre activado, en el área **Sufijo de archivos:**.

source: **Sub Adjust:**, allows to adjust the prevalence of sub-colors with respect to the black ink.
es: **Ajuste de sub colores:**, permite ajustar la prevalencia de los sub colores respecto a la tinta negra.

source: **Border Smooth**, allows to make the intersection of lines having different colors smoother.
es: **Suavizado de bordes:**, permite lograr una mayor suavidad en la intersección de las líneas de diferente color.
