Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: Working in Xsheet/Timeline
es: Trabajo en la Planilla/Línea de tiempo

source: The Xsheet, the digital version of the traditional exposure sheet, allows you to control the timing of all of the elements of a scene. It is organized in columns and rows: each column contains a layer of the animation and each row represents a frame contents. Columns are divided into cells, representing the content of that column in a particular frame.
es: La Planilla, la versión digital de la planilla de exposición tradicional, permite controlar la temporización de todos los elementos de una escena. Se encuentra organizada en columnas y filas: cada columna contiene una capa de la animación y cada fila representa el contenido en un determinado fotograma. Las columnas están divididas en celdas, que definen el contenido de esa columna en un fotograma específico.

source: The Timeline is the horizontal counterpart of the Xsheet, it serves the same purpose, and has the same functionality. The main differences with the Xsheet are that in the Timeline the different levels are laid out in horizontal layers, while each frame content is represented by the columns of the Timeline.
es: La Línea de tiempo es la contrapartida horizontal de la Planilla, sirve al mismo propósito, y tiene exactamente la misma funcionalidad. La principal diferencia con la Planilla es que en la Línea de tiempo los niveles están dispuestos en capas horizontales, mientras que el contenido de cada fotograma está representado por las columnas de la Línea de tiempo.

source: In both of them, different items, generically called here as levels, can be loaded into the scene: animation levels, images for the background and overlays, and video clips.
es: En ambas, es posible cargar distintos elementos (denominados en forma genérica como *niveles*) para conformar una escena, como: niveles de animación, imágenes de fondo y para sobreimprimir, así como clips de video.

source: Other OpenToonz scenes can be loaded there as well: they will be nested inside a column/layer, and considered as a Sub-Xsheet of the current Xsheet/Timeline.
es: También es posible cargar allí otras escenas de OpenToonz: serán anidadas dentro de una columna/capa y serán consideradas como una sub-planilla de la Planilla/Línea de tiempo actual.

source: All of the Xsheet/Timeline contents can be checked in the viewer, where the animation can be played back, and the scene contents edited.
es: Es posible revisar todo el contenido de la Planilla/Línea de tiempo en el Visor, donde se podrá reproducir la animación, así como editar el contenido de la escena.

source: Using the Viewer
es: Uso del Visor

source: The viewer has different modes of visualizing the scene contents. According to your needs you can view the whole work area, only the elements included in the current camera shot, or visualize the whole scene in a 3D environment. The viewer can also be frozen, so that the visualization is not updated until you enter with the pointer in the viewer. When the preview mode is activated, the viewer can display the rendered animation as in the final render (see :ref:`Previewing the Animation <previewing_the_animation>` ).
es: El Visor ofrece distintos modos de visualizar el contenido de la escena. De acuerdo a las necesidades, será posible ver el área de trabajo completa, sólo los elementos incluidos en el encuadre de la cámara actual o visualizar la escena en un entorno 3D. También es posible congelar el Visor, para detener la actualización del mismo hasta que el puntero entre sobre él. Al activar el modo de previsualización, será posible mostrar en el Visor la animación, procesada del mismo modo que en el resultado final, a ser exportado (ver :ref:`Previsualización de la animación <previewing_the_animation>` ).

source: Camera Stand view, 3D view and Camera view modes.
es: Modos de vista: Mesa de trabajo, 3D y Cámara.

source: At the bottom of the viewer another customizable set of buttons is available. Some are used for playback (see :ref:`Using the Viewer <using_the_work_area>` ), some others are relevant only when using the Animate tool (|animate|) to animate objects and when previewing the animation in the viewer (see :ref:`Animating Objects <animating_objects>` and :ref:`Previewing the Animation <previewing_the_animation>` ).
es: En la parte inferior del Visor se encuentra disponible otro conjunto de botones personalizable. Algunos son usados para controlar la reproducción (ver :ref:`Uso del Visor <using_the_work_area>` ), otros son relevantes sólo al usar la herramienta Animar (|animate|) para animar objetos y al previsualizar la animación en el Visor (ver :ref:`Animación de objetos <animating_objects>` y :ref:`Previsualización de una animación <previewing_the_animation>` ).

source: Additional elements like a field guide, or the table, can be displayed or hidden, and the background color can be set (see :ref:`Customizing the Viewer <customizing_the_work_area>` ).
es: Es posible mostrar elementos adicionales como la guía de campos, la mesa de trabajo y establecer un color de fondo (ver :ref:`Personalización del Visor <customizing_the_work_area>` ).

source: **To switch the view mode in the viewer:**
es: **Para cambiar el modo del visualización en el Visor:**

source: Use the buttons available in the viewer title bar to do the following:
es: Usar los botones disponibles en la barra de título del Visor para realizar lo siguiente:

source: The **Camera Stand View** button (|camera_stand|) is for standard view, where any part of the work area can be displayed. When playing back the scene, the work area stands still, while all of the other elements, including the camera, move in relation to its position.
es: El botón **Vista de mesa de trabajo** (|camera_stand|) activa la vista normal, donde es posible ver cualquier parte del área de trabajo. Al reproducir la escena, el área de trabajo permanecerá estática, mientras todos los demás elementos, incluyendo la cámara, se mueven en relación a su posición.

source: The **3D View** button (|3d|) is for activating or deactivating the 3D view of the elements composing the scene (see :ref:`Working in a 3D Environment <working_in_a_3d_environment>` ).
es: El botón **Vista 3D** (|3d|) activa la vista tridimensional de los elementos de que componen la escena (ver :ref:`Trabajo en un entorno 3D <working_in_a_3d_environment>` ).

source: The **Camera View** button (|camera_view|) is for keeping the box representing the camera still, while all of the other elements move in relation to its position. It can help you to better understand the shot when there are camera trucks, or rotations.
es: El botón **Vista de cámara** (|camera_view|) permite que se mantenga estático el marco que representa al encuadre de la cámara, mientras que todos los demás elementos se mueven en relación a su posición. Puede ayudar a comprender mejor una toma, cuando existieran desplazamientos o rotaciones de cámara.

source: When a frame is selected in the Level Strip, the view mode is set accordingly to display that level only. Pressing one of these buttons will revert the viewer back to showing the whole scene content.
es: Cuando se seleccione un fotograma en la Cinta de nivel, el modo de visualización cambiará para mostrar únicamente el nivel seleccionado. En caso de presionarse uno de estos botones, el Visor regresará a mostrar todo el contenido de la escena.

source: **To freeze/un-freeze the viewer:**
es: **Para congelar/descongelar el visor:**

source: Click the Freeze button (|freeze|) in the viewer title bar to freeze/unfreeze the displayed content; when activated the word frozen is displayed at the center of the work area.
es: Hacer clic en el botón **Congelar** (|freeze|) en la barra de título del Visor, para congelar/descongelar el contenido mostrado; mientras esté activado aparecerá la palabra FROZEN en el centro del área del Visor.

source: **To update the viewer content when it is frozen:**
es: **Para actualizar el contenido del Visor cuando se encuentra congelado:**

source: Move the pointer over the viewer.
es: Mover el puntero sobre el Visor.

source: Using the File Browser
es: Uso del Explorador de archivos

source: All the elements you need for a scene can be retrieved by using a file browser.
es: Es posible obtener todos los elementos necesarios para una escena usando el Explorador de archivos.

source: You can either use the standard OpenToonz file browser to drag and drop levels or folders to the Xsheet/Timeline or the Scene Cast window, or use the Load Level... and Load Folder... commands from the File menu. In both cases you can perform a multiple selection to load several levels or folders at the same time, that will be exposed each in a separate column; if you use the Load Level... command, when loading an animation level you can also specify the frame range to load. When you use the Load Folder... command all the files contained in the folder (if supported) are loaded into the Xsheet/Timeline.
es: Es posible usar tanto el Explorador de archivos de OpenToonz para arrastrar y soltar niveles o carpetas a la Planilla/Línea de tiempo o el panel Componentes de la escena, como usar los comandos **Cargar nivel...** y **Cargar carpeta...** del menú Archivo. En ambos casos es posible realizar una selección múltiple para cargar varios niveles y carpetas al mismo tiempo, que serán expuestos cada uno en distintas columnas/capas; al usar el comando **Cargar nivel...** para cargar u nivel de animación, será posible además especificar un rango de fotogramas a ser cargado. Al usar el comando **Cargar carpeta...** todos los archivos contenidos en la carpeta serán cargados (si son soportados) en la Planilla/Línea de tiempo.

source: When a level is loaded, OpenToonz checks if its syntax matches one of the level formats specified into Preferences... → Loading → **Level Settings by File Format**. In this case the Level Settings specified will be applied. It is possible to add as many formats as you want, defining them by using a Regular Expression. This way, different settings can be automatically applied to different kind of levels.
es: Al cargar un nivel, OpenToonz comprueba si su sintaxis concuerda con la de uno de los formatos especificados en Archivo → Preferencias... → Carga → **Opciones de nivel según el formato de archivo**. En tal caso las Opciones de nivel especificadas serán aplicadas. Es posible agregar tantas definiciones de formato como se desee, utilizando una Expresión Regular. De esta manera, es posible aplicar de manera automática distintas opciones a los distintos tipos de nivel.

source: It is possible to **Ignore Alpha Channel on Levels in Column 1** by activating the option in Preferences... → Xsheet dialog section.
es: Es posible **Ignorar el canal alfa de los niveles en la columna 1** activando la opción presente en Archivo → Preferencias... → Planilla.

source: In the file tree available on the left there are the following main items:
es: En el árbol de carpetas del lado izquierdo, existen los siguientes elementos principales:

source: **My Computer** contains files and folders located in your computer.
es: **Este equipo** contiene archivos y carpetas ubicados en el sistema local.

source: **Network** allows the access to network computers.
es: **Red** permite acceder a los equipos de la red.

source: **My Documents** contains files and folders located in the OS My Documents folder.
es: **Documentos** contiene archivos y carpetas ubicadas en la carpeta Documentos del sistema operativo.

source: **Library** displays files and folder located in the ``Projectroot\library`` folder (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
es: **Biblioteca** muestra archivos y carpetas ubicados en la carpeta ``OpenToonz stuff\library`` (ver :ref:`Definición de la carpeta principal de proyectos <setting_the_projectroot>` ).

source: **History** contains recently saved scenes, organized in folders, one for each of the last seven days OpenToonz was used.
es: **Historial** contiene las escenas guardadas recientemente, organizadas en carpetas, una por cada uno de los últimos siete días en que fue usado OpenToonz.

source: **Projectroot** lists all the projects that have been created as folders containing the project information and material; the actual path of the projectroot is displayed in brackets (see :ref:`Using the Project Browser <using_the_project_browser>` ).
es: **Principal de proyectos** lista todos los proyectos que han sido creados, en forma de carpetas que contienen la información y material de cada uno; la ruta a la carpeta Principal de proyectos es mostrada entre paréntesis (ver :ref:`Uso del Explorador de proyectos <using_the_project_browser>` ).

source: In case more than one projectroot is defined, each will be displayed with the related projectroot path in brackets (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
es: En caso de que hubiera definida más de una carpeta principal de proyectos, se mostrará a cada una de ellas con su ruta entre paréntesis (ver :ref:`Definición de la carpeta principal de proyectos <setting_the_projectroot>` ).

source: **Version control** repository folder, labeled according to the version control configuration, contains the folders and files under the version control system (see :ref:`Using the Version Control <using_the_version_control>` ).
es: Carpeta del repositorio de **Control de versiones**, etiquetada de acuerdo a como se haya definido en la configuración del sistema de control de versiones, contiene las carpetas y archivos que se encuentren bajo el sistema de control de versiones (ver :ref:`Uso del Sistema de Control de Versiones <using_the_version_control>` ).

source: In case several repositories are defined, each will be displayed with its appropriate label (see :ref:`Configuring the Version Control in OpenToonz <configuring_the_version_control_in_toonz>` ).
es: En caso de que hubiera definido más de un repositorio, cada uno de ellos será mostrado con su etiqueta correspondiente (ver :ref:`Configuración del control de versiones en OpenToonz <configuring_the_version_control_in_toonz>` ).

source: You can open folders and sub-folders in order to retrieve files that are displayed in the area on the right. The current location path is displayed at the top of the browser; existing folders can be renamed and new folders can be created. Files can be displayed as icons or as a list, displaying additional informations that can be also used to sort them.
es: Es posible abrir carpetas y subcarpetas para obtener sus archivos, que serán mostrados en el área de la derecha. La ruta actual será mostrada en la parte superior del Explorador; las carpetas existentes podrán ser renombradas y nuevas carpetas ser creadas. Es posible mostrar los archivos en forma de íconos o de lista, mostrando información adicional, que también podrá ser usada para ordenarlos.

source: The way file icons are generated in the OpenToonz browser depends on the images resolution and on the **Level Strip Thumbnail Size** option set for the Level Strip frames in the Preferences... → Interface dialog section (see :ref:`Using the Level Strip <using_the_level_strip>` ).
es: La forma en la que se generarán las miniaturas de los archivos en el Explorador de OpenToonz dependerá de la resolución de las imágenes y de la opción **Miniaturas en Cinta de nivel** definida para los dibujos de la Cinta de nivel, en el diálogo Archivos → Preferencias... → Interfaz (ver :ref:`Uso de la Cinta de nivel <using_the_level_strip>` ).

source: Loading Levels
es: Carga de niveles

source: As part of the scene you can load Toonz Vector and Toonz Raster animation levels (PLI and TLV), Toonz palettes (TPL), Raster full-color images or image sequences (BMP, JPG, NOL, PNG, RGB, SGI, TGA, TIF and TIFF), video clips (AVI, MOV, and MP4 and WebM with the aid of FFMPEG, if installed), Photoshop documents (PSD), vector images (SVG) and audio files (AIFF, WAV and MP3 with the aid of FFMPEG, if installed). Images or clips with alpha channel information will retain their transparency information, once imported.
es: Como parte de la escena es posible cargar niveles de animación de tipo Vectorial de Toonz e Imagen de Toonz (PLI y TLV), paletas de Toonz (TPL), Imágenes o secuencias de imágenes (BMP, JPG, NOL, PNG, RGB, SGI, TGA, TIF y TIFF), clips de video (AVI, MOV, así como MP4 y WebM con la ayuda de FFMPEG, si se encontrara instalado), documentos de Photoshop (PSD), imágenes vectoriales (SVG) y archivos de sonido (AIFF, WAV y MP3 con la ayuda de FFMPEG, si se encontrara instalado). Una vez importadas, se preservará la información de transparencia, para las imágenes o clips que contengan información de canal alfa.

source: It is also possible to load legacy TZU and TZP files created with Toonz version 4.x: in this case the files will be automatically converted and loaded in the TLV format.
es: También será posible cargar archivos antiguos en formatos TZU y TZP, creados usando Toonz versión 4.x: en este caso, los archivos serán convertidos automáticamente y cargados en formato TLV.

source: SVG files are automatically converted and loaded in PLI format.
es: Los archivos SVG serán convertidos automáticamente y cargados en formato PLI.

source: Photoshop files can be loaded taking into account the layers the document is made of (see :ref:`Loading Photoshop Documents <loading_photoshop_documents>` ).
es: Es posible cargar los archivos de Photoshop, tomando en cuenta las capas de las que estén compuestos (ver :ref:`Carga de imágenes de Photoshop <loading_photoshop_documents>` ).

source: *Single image* files can have numbers and letters as part of their names, but they must comply with certain rules to be considered valid ones. Following are several descriptive examples of valid and invalid image file names:
es: Los nombres de archivo de *imágenes individuales* pueden contener números y letras, sin embargo deben seguir ciertas reglas para ser considerados válidos. A continuación se presentan varios ejemplos descriptivos de nombres de archivo de imagen válidos e inválidos:

source: Valid name types: ``a1.tga``, ``1a1.tga``, ``1aa.tga``, ``1aaa.tga``
es: Tipos de nombre válidos: ``a1.tga``, ``1a1.tga``, ``1aa.tga``, ``1aaa.tga``

source: Invalid name types: ``1.tga``, ``111.tga``, ``1a.tga``, ``111a.tga``
es: Tipos de nombre inválidos: ``1.tga``, ``111.tga``, ``1a.tga``, ``111a.tga``

source: *Image sequences* are recognized and loaded by OpenToonz file browser as a single animation level, if they are named with a progressive four-digits number written between the *base* file name and the file *extension*, e.g. ``animation.0001.tif`` , ``animation.0002.tif`` , ``etc.`` or ``animation_0001.tif`` , ``animation_0002.tif`` , ``etc.``. They are displayed in the file browser with a *double dot* or *an underscore and a dot* before the file extension: e.g. ``animation..tif`` or ``animation_.tif``
es: Las *secuencias de imágenes* son reconocidas por el Explorador de archivos de OpenToonz como si se tratara de un único nivel de animación, siempre y cuando su nombre contenga un número de cuatro dígitos entre el nombre *base* del archivo y su *extensión*, p.ej: ``animación.0001.tif`` , ``animación.0002.tif`` , ``etc.`` o ``animación_0001.tif`` , ``animación_0002.tif`` , ``etc.``. Se mostrarán en el Explorador de archivos con un *doble punto* o un *guión bajo y un punto* antes de la extensión del archivo: p.ej: ``animación..tif`` o ``animación_.tif``

source: From the browser, you can **View** images and clips you are going to load as levels by opening a flipbook whose default shrink factor and step can be set in the preferences dialog, and see the related file information by opening an **Info** box (see :ref:`Using the Flipbook <using_the_flipbook>` ).
es: Desde el Explorador de archivos es posible **Ver...** las imágenes y los clips, que se desee cargar como niveles, abriendo un Reproductor, cuyo factor de **Reducción** e **Intervalo** podrán ser definidos en el diálogo Archivo → Preferencias → Interfaz; también se podrá ver **Información...** relativa al archivo, en un diálogo (ver :ref:`Uso del Reproductor <using_the_flipbook>` ).

source: OpenToonz scenes (TNZ files) can be loaded as part of another scene as well, in such a case they are loaded as Sub-Xsheets (see :ref:`Loading a Scene as a Sub-Xsheet <loading_a_scene_as_a_sub-xsheet>` ).
es: También es posible cargar escenas de OpenToonz (archivos TNZ) como parte de otra escena, en tal caso serán cargadas como sub-planillas (ver :ref:`Cargar una escena como sub-planilla <loading_a_scene_as_a_sub-xsheet>` ).

source: When you load levels using the standard OpenToonz file browser, you can set whether to automatically expose them in the Xsheet/Timeline or not, by setting the **Expose Loaded Levels in Xsheet** option in the Preferences... → Loading dialog section. If activated, each level will be placed in a different column/layer, starting from the first empty one. If deactivated, the loaded levels will be stored in the Scene Cast, from where they can be selectively exposed in Xsheet columns or Timeline layers (see :ref:`Using the Scene Cast <using_the_scene_cast>` ).
es: Al cargar niveles usando el Explorador de archivos de OpenToonz, es posible definir si se deberán exponer automáticamente en la Planilla/Línea de tiempo o no, mediante la opción **Exponer niveles cargados en planilla** en el diálogo Archivo → Preferencias... → Carga. Cuando se encuentre *activada* (predefinido), cada nivel será colocado en una columna/capa distinta, comenzando por la primera disponible. En caso de estar *desactivada*, los niveles cargados se podrán encontrar en el panel **Componentes de la escena**, desde donde podrán ser selectivamente expuestos en columnas de la Planilla o capas de la Línea de tiempo (ver :ref:`Uso del panel Componentes de la escena <using_the_scene_cast>` ).

source: If you are loading one or several files located outside the default current project folders, you are prompted whether to **Import** them to the project database or to **Load** them from where they are. In the former case files will be copied to the appropriate project folder (PLI, TLV levels and their palettes in the *+drawings* folder; raster images, video clips and audio files in the *+extras* folder; standalone palettes in the *+palettes* folder, etc.) and loaded with a relative path from this new location (see :ref:`Managing Projects <managing_projects>` ); in the latter case they will be loaded using an absolute path to their original location.
es: Al cargar uno a más archivos ubicados fuera de las carpetas del proyecto activo, se solicitará definir si se desea **Importarlos** al proyecto activo o **Cargarlos** desde donde se encuentren. En el primer caso, los archivos serán copiados a la carpeta correspondiente del proyecto (los niveles PLI, TLV y sus paletas a la carpeta *+drawings*; las imágenes y clips de video y sonidos a la carpeta *+extras*; las paletas independientes a la carpeta *+palettes*, etc.) y cargados usando una ruta relativa desde esa nueva ubicación (ver :ref:`Administración de proyectos <managing_projects>` ); en el segundo caso, serán cargados usando una ruta absoluta apuntando a su ubicación original.
