Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: If any of the files you want to import has the same name of a file already existing in the destination project folder, you will prompted whether to keep the existing file, overwrite it with the new one, or rename it by adding a suffix you can choose. In this way you can control if files you are importing have already been imported previously, or manage files that just share the same name.
es: Si alguno de los archivo que se desee importar tuviera el mismo nombre que una ya existente en la carpeta de destino en el proyecto, se solicitará escoger si se deberá mantener el archivo ya existente allí, sobrescribirlo con el nuevo, o renombrarlo usando un sufijo para diferenciarlo. De esta manera es posible controlar si los archivos que se importan ya hubieran sido importados previamente o simplemente administrar archivos que tuvieran el mismo nombre por casualidad.

source: **WARNING:** It is heavily recomended to **Import** assets to the current project folders, as OpenToonz can ovewrite the files associated with levels exposed in the Xsheet/Timeline, each time the **Save Level**, **Save All Levels**, or **Save All** commands are invoked.
es: **ADVERTENCIA:** Se recomienda fuertemente **Importar** al proyecto actual los recursos que se desee usar, ya que es posible que OpenToonz sobrescriba los archivos cargados como niveles expuestos en la Planilla/Línea de tiempo, cada vez que se utilicen los comandos **Guardar nivel**, **Guardar todos los niveles** o **Guardar todo**.

source: Files loaded in a scene without importing can be imported later all at once by using the **Collect Assets** command (see :ref:`Collecting Assets <collecting_assets>` ).
es: Es posible importar en cualquier momento archivos que hubieran sido cargados en una escena desde sus ubicaciones originales, usando el comando **Recolectar recursos** (ver :ref:`Recolección de recursos <collecting_assets>` ).

source: The OpenToonz file browser displays only the relevant files that can be loaded in OpenToonz. To check the full content of a folder you can use the **Show Folder Contents** option (see below).
es: El Explorador de archivos de OpenToonz muestra sólo los archivos relevantes que es posible cargar en el programa. Para comprobar el contenido completo de una carpeta es posible usar la opción **Mostrar en carpeta** (ver más abajo).

source: **To choose the browser display mode:**
es: **Para elegir el modo de visualización del Explorador:**

source: Do one of the following:
es: Hacer una de las siguientes cosas:

source: Click the Icon button (|thumbnails|) in the bottom bar of the browser to display files with the related icons.
es: Hacer clic en el botón **Íconos** (|thumbnails|), en la barra superior del Explorador, para mostrar los archivos con sus correspondientes íconos.

source: Click the List button (|list|) in the bottom bar of the browser to display files in a list with related s; click the labels at the top of the columns to sort files accordingly; right-click the label at the top of the columns to open the menu that allows to toggle the visualization of the columns.
es: Hacer clic en el botón **Lista** (|list|), en la barra superior del Explorador, para mostrar los archivos como una lista mostrando distintas informaciones; es posible ordenar la lista haciendo clic en los títulos de las columnas; al hacer clic derecho sobre el título de cualquier columna, se podrá escoger cuál se desea ver u ocultar.

source: **To resize the browser sections:**
es: **Para redimensionar las secciones del Explorador:**

source: Do any of the following:
es: Hacer cualquiera de las siguientes cosas:

source: Click and drag the separator to resize sections.
es: Arrastrar el separador para redimensionar las secciones.

source: Click and drag the separator towards the window border to hide a section.
es: Arrastrar el separador hacia el borde de la ventana para ocultar una de las secciones.

source: Click and drag the separator collapsed to the window border toward the window center to display again the hidden section.
es: Arrastrar el separador colapsado de vuelta hacia el centro de la ventana para volver a mostrar una sección oculta.

source: **To rename an existing folder:**
es: **Para renombrar una carpeta existente:**

source: Double-click the folder name and rename it.
es: Hacer doble clic sobre su nombre y cambiarlo.

source: **To create a new folder:**
es: **Para crear una nueva carpeta:**

source: Click the new folder button (|new_folder|) in the bottom bar of the browser.
es: Hacer clic en el botón **Nueva** (|new_folder|) en la barra superior del Explorador.

source: **To move one folder up in the file tree:**
es: **Para moverse hacia una carpeta superior en el árbol de carpetas:**

source: Click the folder up button (|folder_up|) in the bottom bar of the browser.
es: Hacer clic en el botón **Arriba** (|folder_up|) en la barra superior del Explorador.

source: **To load levels from the Load Level browser:**
es: **Para cargar niveles desde el Explorador de la función Cargar nivel:**

source: Select the Xsheet/Timeline cell where you want to start exposing the level; if any level is already exposed in that cell, a new column/layer will be inserted to expose the new level.
es: Seleccionar la celda de la Planilla/Línea de tiempo donde se desee comenzar a exponer el nivel; si ya hubiera un nivel expuesto en esa celda, se insertará una nueva columna/capa para exponer el nuevo nivel.

source: Choose Level → **Load Level...**
es: Elegir Nivel → **Cargar nivel...**

source: Right-click in the Xsheet/Timeline cell and choose **Load Level...** from the menu that opens.
es: Hacer clic derecho en la celda de la Planilla/Línea de tiempo y elegir **Cargar nivel...** en el menú.

source: In the browser that opens select the file you want to load as a level; if you select a video or image sequence file, you can select the frame range you want to load by using the **Load Subsequence Level** options.
es: En el Explorador emergente seleccionar el archivo que se desee cargar como un nivel; si se seleccionara un video o secuencia de imágenes, será posible elegir el rango de fotogramas que se desee cargar, usando las opciones se la sección **Cargar sólo parte de la secuencia en el nivel**.

source: Click the Load button.
es: Hacer clic en el botón **Cargar**.

source: **To load levels from the OpenToonz standard browser:**
es: **Para cargar niveles usando el Explorador de archivos de OpenToonz:**

source: In the OpenToonz browser select the file you want to load as a level.
es: En el Explorador de archivos de OpenToonz seleccionar el archivo que se desee cargar como un nivel.

source: Drag and drop the selection to the Scene Cast pane or to the Viewer.
es: Arrastrar y soltar la selección al panel Componentes de la escena o al Visor.

source: Drag and drop the selection to the Xsheet/Timeline cell where you want to start exposing it.
es: Arrastrar y soltar la selección sobre la celda de la Planilla/Línea de tiempo donde se desee comenzar a exponerlo.

source: Right-click the selection and choose **Load** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Cargar** en el menú.

source: Files can also be loaded by dragging and dropping them from the Windows Explorer or macOS Finder to the Scene Cast, Xsheet/Timeline or Viewer.
es: También será posible cargar archivos arrastrando y soltándolos desde el Explorador de Windows o el Finder de macOS hacia los paneles Componentes de la escena, Visor o Planilla/Línea de tiempo.

source: **To load folders:**
es: **Para cargar carpetas:**

source: Select the Xsheet/Timeline cell where you want to start exposing the levels; if any level is already exposed in that cell, a new column/layer will be inserted to expose the new levels.
es: Seleccionar la celda de la Planilla/Línea de tiempo donde se desee comenzar a exponer los niveles; si ya hubiera expuesto algún nivel en dicha celda, se insertará una nueva columna/capa para exponer los nuevos niveles.

source: Use the File → **Load Folder...** command.
es: Usar el comando Archivo → **Cargar carpeta...**

source: In the File Browser that opens select the folder you want to load.
es: En el Explorador de archivos emergente, seleccionar la carpeta que se desee cargar.

source: Press the **OK** button.
es: Presionar el botón **Aceptar**.

source: Folders can also be loaded by dragging and dropping them from the Windows Explorer or macOS Finder to the scene cast, Xsheet/Timeline, or Viewer.
es: También será posible cargar carpetas arrastrando y soltándolas desde el Explorador de Windows o el Finder de macOS hacia los paneles Componentes de la escena, Visor o Planilla/Línea de tiempo.

source: When a level is loaded, OpenToonz checks if its syntax matches one of the level formats specified in Preferences → Loading → **Level Settings by File Format**. In this case the Level Settings specified when the corresponding **Edit** button is opened will be applied. It is possible to add as many file formats as you want, defining them by using a Regular Expression. This way, different settings can be automatically applied to different kind of levels.
es: Al cargar un nivel, OpenToonz comprueba si su sintaxis concuerda con uno de los formatos de nivel especificados en la sección Archivo → Preferencias → Carga → **Opciones de nivel según el formato de archivo**. En tal caso, se aplicarán las opciones especificadas en el dialogo que se abre al presionar el botón **Editar**. Será posible agregar tantos formatos de archivo como se desee, definiéndolos mediante una Expresión Regular. De esta manera, será posible aplicar diferentes opciones de forma automática, a distintos tipos de nivel.

source: **To load back a recently loaded level:**
es: **Para volver a cargar un nivel cargado recientemente:**

source: Choose Level → **Open Recent Level File**, then select the level you want to load from the available submenu.
es: Elegir Nivel → **Abrir nivel reciente** y seleccionar el nivel que se desee cargar desde la lista de niveles recientemente cargados.

source: **To make a multiple selection in the file browser:**
es: **Para hacer una selección múltiple en el Explorador de archivos:**

source: Click to select a file.
es: Hacer clic para seleccionar un archivo.

source: Ctrl-click (PC) or Cmd-click (Mac) to add to or remove a file from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o quitar un archivo de la selección.

source: Shift-click to extend the selection.
es: Hacer Mayúsculas-clic para extender la selección.

source: Right-click in the right area of the browser and choose **Select All** from the menu that opens to select all the files contained in the current folder.
es: Hacer clic derecho en el área de la derecha del Explorador y seleccionar **Seleccionar todo** en el menú, para seleccionar todos los archivos contenidos en la carpeta actual.

source: **To view a level in the flipbook:**
es: **Para visualizar un nivel en el Reproductor:**

source: In the OpenToonz browser or in the Xsheet/Timeline right-click the level you want to view and choose **View** from the menu that opens.
es: En el Explorador de OpenToonz o en la Planilla/Línea de tiempo, hacer clic derecho sobre el nivel que se desee visualizar y elegir **Ver...** en el menú.

source: Choose Windows → **Flipbook** and drag and drop in the window the file you want to view.
es: Elegir Ventanas → **Reproductor**, luego arrastrar y soltar en el panel el archivo que se desee visualizar.

source: By opening several Flipbook windows you can view several levels at the same time.
es: Mediante la apertura de varios Reproductores será posible visualizar varios niveles al mismo tiempo.

source: **To set the default shrink factor and step for the file Viewer:**
es: **Para definir el factor de Reducción y el Intervalo para el Reproductor:**

source: Choose File → Preferences... → Interface.
es: Elegir Archivo → Preferencias... → Interfaz.

source: Set the default **Viewer Shrink** and **Step** values.
es: Definir los valores para las opciones **Reducción** e Intervalo**.

source: **To view a level file information:**
es: **Para visualizar información de un archivo de nivel:**

source: In the OpenToonz browser or in the Xsheet/Timeline right-click the level whose info you want to view and choose **Info** from the menu that opens; if the file is a video or a sequence of images, use the slider at the bottom of the box to change the current frame and see the related information.
es: En el Explorador de OpenToonz o en la Planilla/Línea de tiempo, hacer clic derecho sobre el nivel cuya información se desee visualizar y elegir **Información...** en el menú; si el archivo se tratara de un video o secuencia de imágenes, será posible utilizar el deslizador en la parte inferior del dialogo para cambiar el **Fotograma actual** y poder ver la información correspondiente a cada uno de los mismos.

source: **To view the entire contents of the current folder:**
es: **Para ver el contenido completo de la carpeta actual:**

source: Right-click in the right area of the browser and choose **Show Folder Contents** from the menu that opens: the entire folder contents are displayed in a default OS window.
es: Hacer clic derecho en el área derecha del Explorador de archivos y elegir **Mostrar en carpeta** en el menú: se mostrará el contenido completo de la carpeta en el explorador de archivos predefinido del sistema operativo.

source: Loading Photoshop Documents
es: Carga de imágenes de Photoshop

source: Photoshop documents (PSD files) can be loaded as a scene element in OpenToonz taking into account the layers the document is made of, and their layering order; text layers are considered as standard layers, while layer styles are considered only when loading the document as a single image (see below).
es: Es posible cargar imágenes de Photoshop (archivos PSD) como elementos de las escenas de OpenToonz, tomando en cuenta las capas que las componen; las capas de texto serán consideradas como capas normales, mientras que los estilos de capas sólo serán tomados en cuenta al cargar el documento como una imagen completa (ver más abajo).

source: Supported formats are RGB or grayscale images, using 8 or 16 bits per channel color depth.
es: Los formatos soportados con RGB o escala de grises, usando una profundidad de color de 8 o 16 bits por canal de color.

source: When a Photoshop document is loaded, a dialog opens to set the way the document has to be exposed in the Xsheet. Options are the following:
es: Cuando una imagen de Photoshop es cargada, el diálogo emergente **Cargar como:** permite definir la forma en la que la imagen deberá ser expuesta en la Planilla/Línea de tiempo. Las opciones disponibles son las siguientes:

source: **Single Image**, flattens all the document layers into a single image. Only layers that were visible when the Photoshop document was saved are considered. The level name and path in Level Settings, and the scene cast, refer to the original name of the Photoshop document (see :ref:`Editing Level Settings <editing_level_settings>` and :ref:`Using the Scene Cast <using_the_scene_cast>` ).
es: **Imagen completa**, cargará las capas completamente compuestas, como una única imagen. Sólo las capas que se encontraban visibles en el momento en que la imagen fuera guardada serán consideradas. El nombre y la ruta del nivel en el diálogo Opciones de nivel y el panel Componentes de la escena, harán referencia al nombre original de la imagen de Photohsop (ver :ref:`Edición de Opciones de nivel <editing_level_settings>` y :ref:`Uso del panel Componentes de la escena <using_the_scene_cast>` ).

source: Photoshop documents can be loaded as a Single Image only if the *Maximize Compatibility* option was checked when saving the original file from Photoshop. If the option was deactivated, a dummy image is displayed instead; loading and saving again the document with the option activated fixes the problem.
es: Sólo será posible cargar las imágenes de Photoshop con la opción **Imagen completa**, si se hubiera utilizado la opción *Maximizar compatibilidad* al guardarla desde Photoshop. Si la opción hubiera estado desactivada, en su lugar se mostrará una imagen postiza; para corregir el problema bastará con volver a grabar la imagen desde Photoshop y recargarla en OpenToonz.

source: **Frames**, loads each document layer as a frame, and exposes them as a sequence in an Xsheet column. Any layer group defined in the original document is ignored. The level name and path in Level Settings, and the Scene Cast, refer to the original name of the Photoshop document with the #frames suffix (see :ref:`Editing Level Settings <editing_level_settings>` and :ref:`Using the Scene Cast <using_the_scene_cast>` ).
es: **Fotogramas**, cargará cada una de las capas de la imagen como un fotograma y los expondrá como una secuencia en la columna/capa de la Planilla/Línea de tiempo. Cualquier grupo que estuviera definido en la imagen original será ignorado. El nombre y la ruta del nivel en el diálogo Opciones de nivel y el panel Componentes de la escena, harán referencia al nombre original de la imagen de Photohsop, agregando el sufijo #frames (ver :ref:`Edición de Opciones de nivel <editing_level_settings>` y :ref:`Uso del panel Componentes de la escena <using_the_scene_cast>` ).

source: **Columns**, loads each document layer as a column, and it is possible to automatically create a Sub-Xsheet containing the columns by activating the **Expose in a Sub-Xsheet** option.
es: **Columnas**, cargará cada una de las capas de la imagen como una columna/capa y será posible, activando la opción **Exponer en una sub-planilla**, crear una sub-planilla que contenga todas las columnas/capas de la imagen original.

source: When a Photoshop document is loaded as Columns, it is also possible to set how new Level Names asre assigned. Options are the following:
es: Cuando se carga una imagen de Photoshop como Columnas, también será posible definir cómo se asignarán los nuevos **Nombres de nivel**. Las opciones disponibles son las siguientes:

source: **FileName#LayerName**, uses the PSD file name and layer names as the names of newly created levels.
es: **NombreArchivo#NombreCapa**, usará el nombre del archivo PSD y los nombres de las capas, como nombres de los nuevos niveles creados.

source: **LayerName**, uses the PSD layer names as the names of newly created levels.
es: **#Nombre de capa**, usará los nombres de las capas de la imagen PSD, como nombres de los nuevos niveles creados.

source: When a Photoshop document is loaded as Columns, it is also possible to set the way groups of layers have to be considered. Options are the following:
es: Cuando se carga una imagen de Photoshop como Columnas, también será posible definir cómo se considerarán los grupos de capas. Las opciones disponibles son las siguientes:

source: **Ignore groups**, overlooks any group of layers defined in the document, and each layer is exposed in a different column. The level name and path in Level Settings, and the scene cast, for each level refer to the original name of the Photoshop document with the #layerName suffix (see :ref:`Editing Level Settings <editing_level_settings>` and :ref:`Using the Scene Cast <using_the_scene_cast>` ).
es: **Ignorar grupos**, no tomará en cuenta los grupo de capas definidos en la imagen original y expondrá cada una de las capas en una columna/capa distinta. El nombre y la ruta del nivel en el diálogo Opciones de nivel y el panel Componentes de la escena, harán referencia al nombre original de la imagen de Photohsop, agregando el sufijo #nombredelacapa (ver :ref:`Edición de Opciones de nivel <editing_level_settings>` y :ref:`Uso del panel Componentes de la escena <using_the_scene_cast>` ).

source: **Expose layers in a group as columns in a Sub-Xsheet**, creates for each group a Sub-Xsheet containing each layer of the group as a column. If a group contains other groups, the Sub-Xsheet will contain other Sub-Xsheets that will contain the related layers as columns. The level name and path in Level Settings, and the scene cast, for each level refer to the original name of the Photoshop document with the #layerID suffix (see :ref:`Editing Level Settings <editing_level_settings>` and :ref:`Using the Scene Cast <using_the_scene_cast>` ).
es: **Exponer capas de un grupo como columnas en una sub-planilla**, creará una sub-planilla para cada grupo de capas de la imagen original, exponiéndola en una columna/capa distinta. Si un grupo contuviera anidados a otros grupos, la sub-planilla creada contendrá a su vez otras sub-planillas, que contendrán las correspondientes capas como columnas/capas de cada sub-planilla. El nombre y la ruta del nivel en el diálogo Opciones de nivel y el panel Componentes de la escena, harán referencia al nombre original de la imagen de Photohsop agregando el sufijo #nombredelacapa (ver :ref:`Edición de Opciones de nivel <editing_level_settings>` y :ref:`Uso del panel Componentes de la escena <using_the_scene_cast>` ).

source: **Expose layers in a group as frames in a column**, creates for each group a column containing each layer of the group as a cell. If a group contains other groups, they will be ignored. The level name and path in Level Settings, and the scene cast, for each level refer to the original name of the Photoshop document with the #groupID#group suffix (see :ref:`Editing Level Settings <editing_level_settings>` and :ref:`Using the Scene Cast <using_the_scene_cast>` ).
es: **Exponer capas de un grupo como fotogramas en una columna**, creará una columna/capa por cada grupo de capas de la imagen original, exponiéndola en una columna/capa distinta. Si un grupo contuviera anidados a otros grupos, la sub-planilla creada contendrá a su vez otras sub-planillas, que contendrán las correspondientes capas como columnas/capas de cada sub-planilla. El nombre y la ruta del nivel en el diálogo Opciones de nivel y el panel Componentes de la escena, harán referencia al nombre original de la imagen de Photohsop agregando el sufijo #nombredelgrupo#group (ver :ref:`Edición de Opciones de nivel <editing_level_settings>` y :ref:`Uso del panel Componentes de la escena <using_the_scene_cast>` ).

source: In order to be properly displayed in the final rendering, images based on Photoshop document layers have to be premultiplied either using the **Premultiply** option in the Level Settings dialog, or the Premultiply effect (see :ref:`Editing Level Settings <editing_level_settings>` and :ref:`Premultiply <premultiply>` ).
es: Para que puedan ser mostradas apropiadamente en la imagen procesada final, las imágenes basadas en capas provenientes de documentos de Photoshop deberán estar premultiplicadas, tanto mediante el uso de la opción **Premultiplicar** del diálogo de Opciones de nivel, como mediante el uso del efecto **Premultiply** (ver :ref:`Edición de Opciones de nivel <editing_level_settings>` y :ref:`Efecto Premultiply <premultiply>` ).

source: Executing Tasks in the File Browser
es: Ejecución de tareas en el Explorador de archivos

source: Some tasks concerning files can be executed directly in the File Browser.
es: Es posible llevar a cabo algunas tareas concernientes a archivos directamente en el Explorador de archivos.

source: Files can be duplicated, converted to a different format, converted to TLV (Toonz Raster image) format, renamed, premultiplied, and you can choose to separate their colors.
es: Es posible duplicar, convertir a otro formato, convertir a formato TLV (Imagen de Toonz), renombrar, premultiplicar y separar el color de archivos, usando el Explorador de archivos.
