Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: In the Timeline, click the horizontal strip available on the top of the clip, to select the whole clip.
es: En la Línea de tiempo, hacer clic en la banda horizontal en la parte superior del clip, para seleccionarlo por completo.

source: **To edit audio clips with the Edit menu commands:**
es: **Para editar clips de sonido con los comandos del menú Editar:**

source: Use the **Cut** command to eliminate the selection from the Xsheet/Timeline and keep it in memory for further operations. The cell elimination causes the following cells to shift up in the Xsheet or left in the Timeline.
es: Usar el comando **Cortar** para eliminar la selección de la Planilla/Línea de tiempo y mantenerla en memoria para operaciones futuras. La eliminación de celdas causará que las celdas siguientes sean desplazadas hacia arriba en la Planilla (o hacia la izquierda, en la Línea de tiempo).

source: Use the **Paste** command to paste the selection kept in memory in the Xsheet/Timeline, starting from the selected insertion cell. The command causes the following cells to shift down in the Xsheet or right in the Timeline.
es: Usar el comando **Pegar** para pegar la selección que se encuentra en memoria, a partir de la celda seleccionada. El comando causará que las celdas siguientes sean desplazadas hacia abajo en la Planilla (o hacia la derecha, en la Línea de tiempo).

source: **To move a clip selection in the Xsheet:**
es: **Para mover las celdas seleccionadas de un clip de sonido en la Planilla:**

source: **Click** the vertical strip available on the left of the clip cells, and drag them to move them to a new position.
es: Hacer **clic** en la banda vertical a la izquierda de las celdas seleccionadas del clip y arrastrar para mover la selección hacia una nueva posición.

source: **Ctrl-click** (PC) or **Cmd-click** (Mac) the vertical strip available on the left of the clip cells, and drag them to the new position duplicating them.
es: Hacer **Ctrl-clic** (PC) o **Cmd-clic** (macOS) en la banda vertical a la izquierda de las celdas seleccionadas del clip y arrastrar para duplicar la selección hacia una nueva posición.

source: **Shift-click** the vertical strip available on the left of the clip cells, and drag them to the new position inserting them if other audio clips are loaded in the destination cells.
es: Hacer **Mayúsculas-clic** en la banda vertical a la izquierda de las celdas seleccionadas del clip y arrastrar para mover la selección hacia una nueva posición, insertándola si ya hubiera otro clip de sonido expuesto en la ubicación de destino.

source: **Alt-click** the vertical strip available on the left of the clip cells, and drag them to the new position overwriting any other audio clips previously loaded in the destination cells.
es: Hacer **Alt-clic** en la banda vertical a la izquierda de las celdas seleccionadas del clip y arrastrar para mover la selección hacia una nueva posición, sobrescribiendo a otros clips de sonido expuestos en la ubicación de destino.

source: **To move a clip selection in the Timeline:**
es: **Para mover las celdas seleccionadas de un clip de sonido en la Línea de tiempo:**

source: **Click** the horizontal strip available on the top of the clip cells, and drag them to move them to a new position.
es: Hacer **clic** en la banda horizontal en la parte superior de las celdas seleccionadas del clip y arrastrar para mover la selección hacia una nueva posición.

source: **Ctrl-click** (PC) or **Cmd-click** (Mac) the horizontal strip available on the top of the clip cells, and drag them to the new position duplicating them.
es: Hacer **Ctrl-clic** (PC) o **Cmd-clic** (macOS) en la banda horizontal en la parte superior de las celdas seleccionadas del clip y arrastrar para duplicar la selección hacia una nueva posición.

source: **Shift-click** the horizontal strip available on the top of the clip cells, and drag them to the new position inserting them if other audio clips are loaded in the destination cells.
es: Hacer **Mayúsculas-clic** en la banda horizontal en la parte superior de las celdas seleccionadas del clip y arrastrar para mover la selección hacia una nueva posición, insertándola si ya hubiera otro clip de sonido expuesto en la ubicación de destino.

source: **Alt-click** the horizontal strip available on the top of the clip cells, and drag them to the new position overwriting any other audio clips previously loaded in the destination cells.
es: Hacer **Alt-clic** en la banda horizontal en la parte superior de las celdas seleccionadas del clip y arrastrar para mover la selección hacia una nueva posición, sobrescribiendo a otros clips de sonido expuestos en la ubicación de destino.

source: When it is not possible to release the selection, a red outline is displayed instead of the selection.
es: En caso de no ser posible reubicar la selección, se mostrará un contorno *rojo*, en vez de la selección.

source: **To trim an audio clip:**
es: **Para recortar un clip de sonido:**

source: Click and drag the starting of a clip to trim its starting part.
es: Hacer clic y arrastrar el comienzo de un clip para recortar su parte inicial.

source: Click and drag the ending of a clip to trim its ending part.
es: Hacer clic y arrastrar el final de un clip para recortar su parte finial.

source: Click and drag the marker of a trimmed clip to redefine the trimmed part.
es: Hacer clic y arrastrar el marcador de un clip ya recortado para redefinir el punto de recorte.

source: **To scrub audio clips:**
es: **Para revisar clips de sonido:**

source: Drag the Xsheet frame cursor up or down to scrub all the audio columns whose Camera Stand toggle is active.
es: Arrastrar el cursor de tiempo de la Planilla hacia arriba o abajo para revisar todas las columnas de sonido cuyo interruptor de **Visibilidad en mesa de trabajo** se encuentre activo.

source: Drag the Timeline frame cursor left or right to scrub all the audio layers whose Camera Stand toggle is active.
es: Arrastrar el cursor de tiempo de la Línea de tiempo hacia izquierda o derecha para revisar todas las capas de sonido cuyo interruptor de **Visibilidad en mesa de trabajo** se encuentre activo.

source: Drag the frame cursor in the viewer framebar to scrub all the audio columns whose Camera Stand toggle is active.
es: Arrastrar la barra de fotogramas del Visor para revisar todas las columnas/capas de sonido cuyo interruptor de **Visibilidad en mesa de trabajo** se encuentre activo.

source: Windows only: In the Xsheet, click and drag on the dashed vertical strip available on the right of the audio column cells, the selected section will be automatically played back.
es: Sólo Windows: En la Planilla, hacer clic y arrastrar sobre la banda vertical a la derecha de las celdas de una columna de sonido, la sección seleccionada será reproducida automáticamente.

source: Windows only: In the Timeline, click and drag on the dashed horizontal strip available on the bottom of the audio layer cells, the selected section will be automatically played back.
es: Sólo Windows: En la Línea de tiempo, hacer clic y arrastrar sobre la banda horizontal en la parte inferior de las celdas de una capa de sonido, la sección seleccionada será reproducida automáticamente.

source: Lip Synching
es: Sincronización labial

source: When you need to synchronize the movement of a character’s lips with the sound of the speech, you can take advantage of the possibility to examine the audio files loaded in the scene.
es: Cuando se necesite sincronizar el movimiento de los labios de un personaje con el sonido de una voz, se podrá aprovechar la posibilidad de examinar los archivos de sonido en la escena.

source: Once you have created different mouth images, you can analyze the audio files to find where to place specific mouth drawings. If mouth drawings belong to one single animation level, you can quickly change the mouth drawing at a specific frame by picking drawings from the level strip or by flipping through drawings using one of the **Skeleton** tool (|skeleton|) features (see :ref:`Using the Level Strip <using_the_level_strip>` and :ref:`Animating Models <animating_models>` ).
es: Una vez que se hayan creado distintos dibujos para la boca, será posible analizar los archivos de sonido para encontrar el lugar apropiado dónde ubicar cada dibujo específico. Si los dibujos de las bocas pertenecieran a un único nivel de animación, será posible cambiar el dibujo expuesto en cada fotograma, escogiendo dibujos en la Cinta de nivel o recorriendo secuencialmente los distintos dibujos, mediante el uso de una de las características de la herramienta **Esqueleto** (|skeleton|) (ver :ref:`Uso de la Cinta de nivel <using_the_level_strip>` y :ref:`Animación de modelos <animating_models>` ).

source: The breakdown of audio files can be done by looking at the sound wave in the scene column, for example to spot where each word starts; by scrubbing the loaded audio clips with the current frame cursor either in the Xsheet/Timeline frame ruler or in the Viewer framebar; and by listening to specific sections of the audio files.
es: Es posible realizar el análisis de los archivos de sonido mirando la forma de onda de la columna/capa apropiada en la Planilla/Línea de tiempo, por ejemplo para identificar el lugar de comienzo de cada palabra; revisando los clips de sonido cargados usando el cursor de tiempo en la Planilla/Línea de tiempo o la barra de fotogramas en el Visor; o escuchando secciones específicas de los archivos de sonido.

source: When mouth images are placed in the proper place, you can check the sync by scrubbing or selecting again the audio file section you are interested in, because while listening to the selected audio section, the viewer will display the related animation frames.
es: Una vez que los dibujos de las bocas hayan sido ubicados en los lugares apropiados, será posible revisar la sincronización arrastrando el cursor de tiempo o seleccionando nuevamente la sección de la columna/capa de sonido en la que se está interesado, ya que al reproducirse el sonido también se mostrarán las imágenes animadas en el Visor.

source: This technique can be used in any case you need the sound to be perfectly synchronized with the action, for example a character playing an instrument, or a scene based on the rhythm of a music.
es: Es posible usar esta técnica en cualquier caso en que sea necesario tener el sonido perfectamente sincronizado con la acción, por ejemplo si un personaje estuviera tocando un instrumento o una escena basada en el ritmo de una cierta música.

source: Drag the Xsheet/Timeline frame cursor forward or backwards to scrub all the audio levels whose Camera Stand toggle is active.
es: Arrastrar el cursor de tiempo de la Planilla/Línea de tiempo hacia adelante o atrás para revisar todos los niveles de sonido cuyo interruptor **Visibilidad en mesa de trabajo** se encuentre activado.

source: Drag the frame cursor in the Viewer framebar to scrub all the audio columns whose Camera Stand toggle is active.
es: Arrastrar el cursor de tiempo en la barra de fotogramas del Visor para revisar todos las columnas/capas de sonido cuyo interruptor **Visibilidad en mesa de trabajo** se encuentre activado.

source: Windows only: click and drag on the dashed strip available on the audio level cells: the selected section will be automatically played back.
es: Sólo Windows: hacer clic y arrastrar sobre la banda vertical de la derecha de las celdas de un nivel de sonido en la Planilla (o la banda horizontal de la parte inferior, en el caso de la Línea de tiempo): la sección seleccionada se reproducirá de forma automática.

source: **To flip through the mouth drawings:**
es: **Para recorrer secuencialmente los dibujos de una boca:**

source: Select in the Xsheet or Timeline the animation level containing the mouth drawings.
es: Seleccionar en la Planilla/Línea de tiempo el nivel de animación que contenga los dibujos de las bocas.

source: Right-click in the viewer over the mouth drawing you want to flip through, and choose the **Select** command related to the column/layer containing the drawing you clicked.
es: Hacer clic derecho en el Visor sobre el dibujo de la boca que se desee recorrer secuencialmente, y elegir el comando **Seleccionar columna** apropiado para seleccionar la columna/capa correspondiente.

source: Choose the **Skeleton** tool (|skeleton|) and set the tool mode to **Animate**.
es: Elegir la herramienta **Esqueleto** (|skeleton|) y colocarla en el Modo: **Animar**.

source: In the viewer click the label with the level name on the right of the current section pivot point and flip through following and previous frames by doing one of the following:
es: En el Visor hacer clic sobre la etiqueta que contiene el nombre el nivel, ubicado a la derecha del punto de pivote y recorrer secuencialmente los dibujos anteriores/siguientes realizando una de las siguientes acciones:

source: Drag up or down.
es: Arrastrar hacia arriba/abajo.

source: Click the up or down arrowheads.
es: Hacer clic en las flechas hacia arriba/abajo.

source: Importing Magpie Files
es: Importación de archivos de Magpie

source: It is possible to import into the Xsheet/Timeline .TLS files (i.e. Toonz Lip Sync) exported from Magpie, a lip-sync and animation timing tool.
es: Es posible importar archivos .TLS (Toonz Lip Sync) a la Planilla/Línea de tiempo. Estos archivos pueden ser exportados usando Magpie, un programa de sincronización labial y temporización de animación.

source: While Magpie takes care of the audio file analysis and phoneme recognition, importing the .TLS file into OpenToonz allows you to assign a frame from an animation level to each phoneme and automatically expose the result in an Xsheet column or Timeline layer; an additional column/layer displaying the speech text (as recognized in Magpie) is created for reference.
es: Si bien Magpie se encarga del análisis del archivo de sonido y del reconocimiento de fonemas, importar el archivo .TLS a OpenToonz permite asignar los fotogramas de un nivel de animación a cada fonema y exponer automáticamente el resultado en una columna de la Planilla o capa de la Línea de tiempo; también se creará como referencia una columna/capa adicional, donde se mostrará el texto de la locución (tal como haya sido reconocido por Magpie).

source: **To export the OpenToonz lip sync file in Magpie:**
es: **Para exportar el archivo de sincronización labial de OpenToonz desde Magpie:**

source: Copy the file ``export-toonz.lua`` available in ``OpenToonz stuff\config`` folder into the ``C:\Program Files (x86)\Third Wish Software & Animation\Magpie Pro\Scripts\Export`` folder.
es: Copiar el archivo ``export-toonz.lua`` disponible en la carpeta ``OpenToonz stuff\config`` a la carpeta ``C:\Program Files (x86)\Third Wish Software & Animation\Magpie Pro\Scripts\Export`` .

source: In Magpie choose File → Export and choose Toonz among the 2D software list to export the TLS file.
es: En Magpie, elegir File → Export y luego elegir **Toonz**, en la lista de formatos de programas 2D, para poder exportar el archivo TLS.

source: **To import a Magpie file:**
es: **Para importar un archivo de Magpie:**

source: Choose File → **Import Toonz Lip Sync File...**.
es: Elegir Archivo → Importar → **Importar sincro labial de Toonz...**

source: In the browser that opens retrieve the TLS file you exported from Magpie and click the **Load** button.
es: En el Explorador de archivos emergente elegir el archivo TLS que se exportó previamente desde Magpie y hacer clic en el botón **Cargar**.

source: In the dialog that opens choose the following:
es: En el diálogo emergente elegir lo siguiente:

source: Use **Frame Range** to define which section of the Magpie file you want to use to create the lip sync column in the Xsheet/Timeline.
es: Usar **Rango de fotogramas** para definir qué sección del archivo de Magpie se desea usar para crear la columna/capa de sincronización labial en la Planilla/Línea de tiempo.

source: Use the **Animation Level** section to retrieve the animation level you want to expose in the Xsheet/Timeline, and to specify which frame of the level has to be assigned to each phoneme; you can also use the viewer available at the bottom of the dialog to examine the frames of the selected animation level.
es: Usar la sección **Nivel de animación** para definir el nivel de animación que se desee exponer en la Planilla/Línea de tiempo, así como para especificar qué fotograma de ese nivel será asignado a cada fonema; también será posible usar el área de previsualización inferior para examinar los fotogramas del nivel de animación seleccionado.

source: Click the **Import** button.
es: Hacer clic en el botón **Importar**.

source: Importing Papagayo-NG Files
es: Importación de archivos de Papagayo-NG

source: It is possible to import into the Xsheet/Timeline DAT files exported from Papagayo-NG, a lip-sync and animation timing tool.
es: Es posible importar archivos .DAT a la Planilla/Línea de tiempo. Estos archivos pueden ser exportados usando Papagayo-NG, un programa de sincronización labial.

source: While Papagayo-NG takes care of the audio file analysis and phoneme recognition, importing the DAT file into OpenToonz allows you to assign a frame from an animation level to each phoneme and automatically expose the result in an Xsheet column or Timeline layer; to be able to hear the synched sound, the correspondent sound level should be manually loaded too.
es: Si bien Papagayo-NG se encarga del análisis del archivo de sonido y del reconocimiento de fonemas, importar el archivo .DAT a OpenToonz permite asignar los fotogramas de un nivel de animación a cada fonema y exponer automáticamente el resultado en una columna de la Planilla o capa de la Línea de tiempo; para poder escuchar el audio sincronizado, será necesario cargar y exponer el archivo de sonido correspondiente en la Planilla/Línea de tiempo.

source: **To export the OpenToonz lip sync file in Papagayo-NG:**
es: **Para exportar el archivo de sincronización labial desde Papagayo-NG:**

source: In Papagayo-NG, from the **Export:** dropdown menu, select **MOHO**.
es: En Papagayo-NG, en el menú desplegable **Export:**, seleccionar la opción **MOHO**.

source: Press the **Export** button, to export a .DAT file.
es: Hacer clic en el botón **Export** para exportar el archivo DAT.

source: **To import a Papagayo-NG file:**
es: **Para importar un archivo de Papagayo-NG:**

source: Expose in the Xsheet/Timeline at least one drawing of the level containing the mouth shapes set.
es: Exponer en la Planilla/Línea de tiempo, al menos un dibujo del nivel de animación que contiene el conjunto de bocas.

source: Select the cell of the column/layer where you want the lip sync to start, and using the right click menu choose the **Apply Lip Sync Data to Column** option or from Xsheet → **Apply Lip Sync Data to Column**.
es: Seleccionar la celda de la columna/capa donde se desee comenzar la sincronización labial y hacer clic derecho para seleccionar la opción **Aplicar datos de sincro labial a columna** en el menú o bien usar el comando Planilla → **Aplicar datos de sincro labial a columna**.

source: A dialog opens letting you choose which level drawings to assign to each phoneme.
es: En el diálogo emergente será posible seleccionar qué dibujos del nivel asignar a cada fonema.

source: Use the **Lip Sync Data File:** browser to retrieve the DAT file you exported from Papagayo-NG, and click the **Choose** button.
es: Usar el botón de Explorador de la opción **Archivo de datos de sincronización labial:** para obtener el archivo DAT exportado anteriormente desde Papagayo-NG, y hacer clic en el botón **Escoger**.

source: The **Insert at Frame:** parameter should already be showing the frame number of the cell you previously selected. Still, you can change it to make the lip sync start at another frame.
es: La opción **Insertar en fotograma:** ya debería estar mostrando el número de fotograma de la celda que se seleccionó en el paso 2. Aún así, será posible cambiarlo para hacer que la sincronización labial comience en otro fotograma.

source: Activate the **Extend Rest Drawing to End Marker** if you want to copy the *Rest Drawing* to all the remaining frames between the loaded lip sync ending, and the frame where the *End Marker* of the Xsheet/Timeline is set.
es: Activar la opción **Extender dibujo de reposo hasta el marcador de fin** si se deseara copiar el **Dibujo de reposo** a todos los fotogramas restantes entre el final de la sincronización labial cargada y el fotograma donde se encuentre el marcador de **Fin de reproducción** de la Planilla/Línea de tiempo.

source: Click the **Apply** button.
es: Hacer clic en el botón **Aplicar**.

source: Using Memos
es: Uso de Notas

source: Memos can be posted in the Xsheet/Timeline at specific positions in order to add notes and comments to the scene.
es: Es posible colocar Notas en logares específicos de la Planilla/Línea de tiempo, para dejar instrucciones o comentarios, incluidos como parte de la escena.

source: When editing a memo its color can be set, and the text you write can be formatted. Once posted, memos display the first letters of their content in order to be identified, and can be retrieved in the Xsheet/Timeline by navigating them.
es: Al editar una nota, será posible establecer su color de fondo, así como dar formato al texto escrito. Una vez creadas, las notas mostrarán el inicio de su contenido, como forma de identificarlas y será posible revisarlas en cualquier momento en la Planilla/Línea de tiempo.

source: **To post a memo:**
es: **Para crear una nota:**

source: Click the **Add New Memo** button at the top of the frame number column in the Xsheet (or at the top of the layers headers, in the Timeline).
es: Hacer clic en el botón **Agregar nueva nota** en la esquina superior izquierda de la Planilla/Línea de tiempo.

source: Type the memo text in the window that opens, format it and choose the memo color (see below) then click the **Post** button: the memo is posted at the current frame in the current column.
es: Ingresar el texto de la nota en la ventana emergente, darle formato y escoger el color de fondo (ver abajo) y luego hacer clic en el botón **Publicar**: la nota será ubicada en la celda seleccionada.

source: Click and drag the posted memo to change its position.
es: Si fuera necesario, hacer clic y arrastrar la nota para cambiar su posición.

source: **To format the text in the memo:**
es: **Para dar formato al texto en la nota:**

source: Select the text you want to format.
es: Seleccionar el texto que se desee formatear.

source: Click the arrow (|additional_settings|) displayed on the right of the selection to open the Text Toolbar.
es: Hacer clic en el botón con forma de flecha (|additional_settings|) mostrado a la derecha de la selección, para abrir la Barra de herramientas de texto.

source: Choose the font family, size, color, style and paragraph alignment by clicking on the relevant menu and buttons in the Text Toolbar.
es: Elegir la familia de tipografía, tamaño, color, estilo y alineación de párrafo haciendo clic en los menúes y botones correspondientes en la Barra de herramientas de texto.

source: **To change the memo color:**
es: **Para cambiar el color de fondo de la nota:**

source: Choose a color in the palette available at the bottom of the open memo; palette colors can also be selected and edited by using the Style Editor.
es: Elegir un color en la paleta disponible en la sección inferior de la ventana de edición de Nota; los colores de la paleta también podrán ser elegidos y editados usando el Editor de estilos.

source: **To navigate the memos posted in the Xsheet:**
es: **Para recorrer las notas colocadas en la Planilla/Línea de tiempo:**
