Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: Editing cells with the Fill Handle makes the cells placed below the selection to shift up/down in the Xsheet (or the cells placed to the right of the selection to shift left/right in the Timeline).
es: La edición de celdas con el Asa de relleno provocará que las celdas ubicadas por debajo de la selección se desplacen hacia arriba/abajo en la Planilla (o que las celdas ubicadas a la derecha de la selección se desplacen hacia la izquierda/derecha en la Línea de tiempo).

source: **To edit cell content with the Fill Handle in the Xsheet:**
es: **Para editar el contenido de celdas usando el Asa de relleno en la Planilla:**

source: If you want to repeat a cell content for some frames, select the cell and drag the fill handle down.
es: Si se desea *repetir* el contenido de una celda durante varios fotogramas, seleccionar la celda y arrastrar el asa de relleno hacia abajo.

source: If you want to lengthen a progressive sequence, select the cells where the sequence is exposed, and drag the fill handle down: sequence will be lengthen according to the progressive numbering. For example if the sequence is 1, 3, 5, the added images will be 7, 9, 11, etc. This works for any step the sequence may have.
es: Si se desea *extender* una secuencia progresiva, seleccionar las celdas donde ésta se encuentre expuesta y arrastrar el asa de relleno hacia abajo: la secuencia se extenderá de acuerdo al patrón de su numeración progresiva. Por ejemplo, si la secuencia fuera 1, 3, 5 los fotogramas agregados serían 7, 9, 11, etc. Esto funcionara así con cualquier patrón de numeración existente en la secuencia.

source: If you want a random sequence to be repeated, select the sequence and drag the fill handle down: the sequence will be lengthened according to the sequence numbering. For example if the sequence is 3, 6, 4, 1, the added images will be 3, 6, 4, 1, 3, 6, etc.
es: Si se desea *repetir* una secuencia aleatoria, seleccionarla y arrastrar el asa de relleno hacia abajo: la secuencia será extendida de acuerdo a su numeración. Por ejemplo, si la secuencia fuera 3, 6, 4, 1 las imágenes agregadas serán 3, 6, 4, 1, 3, 6, etc.

source: If you want a progressive sequence to be repeated, first copy the sequence first drawing at the end of the sequence, then select all and drag down the fill handle. For example if the sequence is 1, 2, 3, 4, copy the drawing 1 at the end of the sequence (the result will be 1, 2, 3, 4, 1), and the added drawings will be 2, 3, 4, 1, 2, etc.
es: Si se desea *repetir* una secuencia progresiva, en primer lugar copiar su fotograma inicial al final de la misma, luego seleccionar todas las celdas y arrastrar el asa de relleno hacia abajo. Por ejemplo, si la secuencia fuera 1, 2, 3, 4 copiar el dibujo 1 al final de la secuencia (resultando en 1, 2, 3, 4, 1), los dibujos agregados serán 2, 3, 4, 1, 2, etc.

source: If you want to delete some cells, select a region so that the cells you want to delete are in the last columns, and drag the fill handle up.
es: Si se desea *borrar* algunas celdas, seleccionar una región de manera que las celdas que se desee borrar queden en las últimas columnas de la selección, luego arrastrar el asa de relleno hacia arriba.

source: **To edit cell content with the Fill Handle in the Timeline:**
es: **Para editar el contenido de celdas usando el Asa de relleno en la Línea de tiempo:**

source: If you want to repeat a cell content for some frames, select the cell and drag the fill handle to the right.
es: Si se desea *repetir* el contenido de una celda durante varios fotogramas, seleccionar la celda y arrastrar el asa de relleno hacia la derecha.

source: If you want to lengthen a progressive sequence, select the cells where the sequence is exposed, and drag the fill handle to the right: sequence will be lengthen according to the progressive numbering. For example if the sequence is 1, 3, 5, the added images will be 7, 9, 11, etc. This works for any step the sequence may have.
es: Si se desea *extender* una secuencia progresiva, seleccionar las celdas donde ésta se encuentre expuesta y arrastrar el asa de relleno hacia la derecha: la secuencia se extenderá de acuerdo al patrón de su numeración progresiva. Por ejemplo, si la secuencia fuera 1, 3, 5 los dibujos agregados serían 7, 9, 11, etc. Esto funcionara así con cualquier patrón de numeración existente en la secuencia.

source: If you want a random sequence to be repeated, select the sequence and drag the fill handle to the right: the sequence will be lengthened according to the sequence numbering. For example if the sequence is 3, 6, 4, 1, the added images will be 3, 6, 4, 1, 3, 6, etc.
es: Si se desea *repetir* una secuencia aleatoria, seleccionarla y arrastrar el asa de relleno hacia la derecha: la secuencia será extendida de acuerdo a su numeración. Por ejemplo, si la secuencia fuera 3, 6, 4, 1 las imágenes agregadas serán 3, 6, 4, 1, 3, 6, etc.

source: If you want a progressive sequence to be repeated, first copy the sequence first drawing at the end of the sequence, then select all and drag the fill handle to the right. For example if the sequence is 1, 2, 3, 4, copy the drawing 1 at the end of the sequence (the result will be 1, 2, 3, 4, 1), and the added drawings will be 2, 3, 4, 1, 2, etc.
es: Si se desea *repetir* una secuencia progresiva, en primer lugar copiar su fotograma inicial al final de la misma, luego seleccionar todas las celdas y arrastrar el asa de relleno hacia la derecha. Por ejemplo, si la secuencia fuera 1, 2, 3, 4 copiar el dibujo 1 al final de la secuencia (resultando en 1, 2, 3, 4, 1), los dibujos agregados serán 2, 3, 4, 1, 2, etc.

source: If you want to delete some cells, select a region so that the cells you want to delete are in the last rows, and drag the fill handle to the left.
es: Si se desea *borrar* algunas celdas, seleccionar una región de manera que las celdas que se desea borrar queden en las últimas columnas de la selección, luego arrastrar el asa de relleno hacia la izquierda.

source: Stretching the Timing
es: Estiramiento de tiempo

source: If you need to change the timing of a selection of cells, a selected frame range, or the whole Xsheet/Timeline, you can use the Time Stretch dialog.
es: Si fuera necesario cambiar la temporización de una selección de celdas, un rango de fotogramas o la Planilla/Línea de tiempo completa, será posible usar el diálogo **Estirar tiempo**.

source: Options are the following:
es: Sus opciones son las siguientes:

source: **Stretch** defines if the new timing has to be applied to the **Selected Cells**, the **Selected Frame Range**, or to the **Whole Xsheet**.
es: **Estirar:** define si la nueva temporización deberá ser aplicada a las **Celdas seleccionadas**, al **Rango de fotogramas seleccionados** o a la **Planilla completa**.

source: **Old Range** displays the frame duration of the selection.
es: **Rango original:**, muestra la duración original de la selección, en fotogramas.

source: **New Range** defines the new frame duration of the selection.
es: **Nuevo rango:**, permite definir la nueva duración de la selección, en fotogramas.

source: **To stretch the Xsheet/Timeline timing:**
es: **Para estirar el tiempo de la Planilla/Línea de tiempo:**

source: Select the cells, or define the frame range you want to stretch.
es: Seleccionar las celdas o definir el rango de fotogramas que se desee estirar.

source: Choose Cells → **Time Stretch...**.
es: Elegir Celdas → **Estirar tiempo...**

source: Right-click the selection and choose **Time Stretch...** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Estirar tiempo...** en el submenú **Editar números de celdas**.

source: Define the time stretching options, then click the Stretch button.
es: Definir las opciones de estiramientode tiempo, luego hacer clic en el botón **Estirar**.

source: Working Globally with Frames
es: Trabajo global con fotogramas

source: It is possible to insert or delete frames affecting the Xsheet/Timeline as a whole, or a selection of Xsheet columns or Timeline layers.
es: Es posible insertar o borrar fotogramas, tanto afectando a la Planilla/Línea de tiempo de forma global, como a una selección de columnas/capas.

source: Inserting or deleting frames can be useful if you want to change the timing of the animation, for instance if you want to slow down or speed up an animation.
es: Insertar o borrar fotogramas puede resultar útil cuando se desee cambiar la temporización de la animación, por ejemplo en caso de que fuera necesario enlentecer o acelerar una animación.

source: When a frame is inserted, the current frame cells are duplicated, and all the following cells are shifted down (right in the Timeline). If animation keys are defined for object transformations and FX parameters, they will be shifted down (or right in the Timeline) as well, to keep the animation consistency (see :ref:`Animating Objects <animating_objects>` and :ref:`Editing FX Settings <editing_fx_settings>` ).
es: Cuando se inserta un fotograma, las celdas del fotograma actual serán duplicadas y todas las celdas siguientes serán desplazadas hacia abajo (hacia la derecha en la Línea de tiempo). Si hubiera claves definidos para las transformaciones de los objetos o parámetros de efectos, también serán desplazados, para mantener la consistencia de la animación (ver :ref:`Animación de objetos <animating_objects>` y :ref:`Edición de opciones de efectos <editing_fx_settings>` ).

source: When a frame is removed, the current frame cells are deleted, and the following cells are shifted up (or left in the Timeline). If animation keys for object transformations and FX parameters are defined in the removed frame, they will be deleted and following keys will be shifted up (or left in the Timeline) (see :ref:`Animating Objects <animating_objects>` and :ref:`Editing FX Settings <editing_fx_settings>` ).
es: Al eliminar un fotograma, las celdas del fotograma actual serán borradas y las siguientes serán desplazadas hacia arriba (hacia la izquierda en la Línea de tiempo). Si hubiera claves de animación definidos en el fotograma actual para las transformaciones de objetos y parámetros de efectos, serán borrados y los siguientes claves serán desplazados (ver :ref:`Animación de objetos <animating_objects>` y :ref:`Edición de opciones de efectos <editing_fx_settings>` ).

source: **To insert a frame:**
es: **Para insertar un fotograma:**

source: Select the frame before which you want to insert a new frame.
es: Seleccionar el fotograma anterior adonde se desee insertar uno nuevo.

source: Choose Xsheet → **Insert Frame**.
es: Elegir Planilla → **Insertar fotograma**.

source: **To remove a frame:**
es: **Para eliminar un fotograma:**

source: Select the frame you want to delete.
es: Seleccionar el fotograma que se desee eliminar.

source: Choose Xsheet → **Remove Frame**.
es: Elegir Planilla → **Eliminar fotograma**.

source: Using Sub-Xsheets
es: Uso de sub-planillas

source: A Sub-Xsheet is a scene exposed in a single Xsheet column or Timeline layer. It can contain as many columns/layers as you want, and other Sub-Xsheets as well.
es: Una sub-planilla es una escena expuesta en una única columna de la Planilla o capa de la Línea de tiempo. Puede contener tantas columnas/capas como sea necesario e inclusive contener a otras sub-planillas.

source: When it's opened, the Sub-Xsheet contents are displayed in the Xsheet/Timeline pane. When it is closed, it's displayed in the Xsheet/Timeline as a violet column/layer, with its icon displaying a render of its content. The column/layer cells display the name of the Sub-Xsheet, and the cell number is a reference to the frame of the Sub-Xsheet content, i.e. cell 4 is a reference to frame 4 of the Sub-Xsheet.
es: Cuando una sub-planilla se encuentra abierta, su contenido es mostrado en el panel de Planilla/Línea de tiempo. Cuando se encuentre cerrada, se mostrará en la Planilla/Línea de tiempo como una columna/capa de color *violeta* y su ícono mostrará un fotograma de su contenido. Las celdas de la columna/capa mostrarán el nombre de la sub-planilla, el número de *dibujo* expuesto en cada celda será una referencia a los fotogramas en la sub-planilla, p.ej: una celda con el número 4 hará referencia al contenido del fotograma 4 de la sub-planilla.

source: The closed Sub-Xsheet level length depends on how many frames its content lasts at the time you create it, and it is not affected when you edit the Sub-Xsheet content.
es: La longitud de un nivel de sub-planilla cerrado dependerá de la extensión de su contenido en el momento de su creación y *no* se modificará automáticamente al editar el contenido de la sub-planilla.

source: Sub-Xsheet levels can be animated like any other animation level, and FX can be assigned to it, affecting all the Sub-Xsheet content as a whole.
es: Es posible animar los niveles de sub-planillas como a cualquier otro tipo de nivel, también es posible asignarles efectos, que aplicarán al contenido completo de la sub-planilla.

source: Sub-Xsheet level cells can be edited, for example to create a cycle, or cut, copied and pasted like any other exposed level (see :ref:`Working with Xsheet Cells <working_with_xsheet_cells>` ). Like any other level, if some editing is performed in its frames, all the cells in the main Xsheet/Timeline referring to that Sub-Xsheet frame will consequently change their content. In case you want to create a copy of a Sub-Xsheet that refers to the same animation level database, but whose content can be edited independently, you can choose to **Clone** it.
es: Es posible editar las celdas de los niveles de sub-planillas, por ejemplo para crear un ciclo o para cortarlas, copiarlas y pegarlas como cualquier otro tipo de nivel expuesto (ver :ref:`Trabajo con celdas <working_with_xsheet_cells>` ). También, como en cualquier otro tipo de nivel, cuando se realiza alguna edición en los fotogramas de la sub-planilla, las celdas en la Planilla/Línea de tiempo principal que hagan referencia a esos fotogramas, cambiarán consecuentemente su contenido. En caso de que se necesitara crear una copia de una sub-planilla, que hiciera referencia al mismo contenido de animación, pero con la posibilidad de ser editada de forma independiente, será posible usar el comando Planilla → **Clonar sub-planilla**.

source: If you want to reset the editing of a Sub-Xsheet level, you can **Resequence** it, by resetting it to the original length and order of its contents.
es: Si se deseara restablecer la edición de un nivel de sub-planilla, será posible usar el comando Planilla → **Resecuenciar**, restableciéndola a su longitud actual y al orden original de sus dibujos.

source: You can load a scene previously created with OpenToonz as a level of the current scene. You can also collapse selected columns/layers to form a new Sub-Xsheet to better manage the scene, for example you can collapse into a Sub-Xsheet all the columns/layers used to define a character, or explode a Sub-Xsheet to automatically bring all of its contents into the Xsheet/Timeline where it is exposed.
es: Es posible cargar una escena, creada con anterioridad con OpenToonz, como un nivel de la escena actual. También es posible colapsar las columnas/capas seleccionadas para formar una nueva sub-planilla, con el propósito de administrar mejor la escena, por ejemplo será posible colapsar en una sub-planilla todas las columnas/capas usadas para definir a un personaje, o explotar una sub-planilla para traer automáticamente todo su contenido hacia la Planilla/Línea de tiempo donde se encuentra expuesta.

source: As Sub-Xsheets can be loaded and saved, they can also be used for importing or exporting sections of an Xsheet/Timeline from one scene to another. For example, if you create a scene where several levels compose a character (head, body, shadow, etc.), you can save it and import it later in a different scene as a Sub-Xsheet.
es: Debido a que es posible cargar y guardar sub-planillas, también podrán ser usadas como un medio para importar y exportar secciones de una Planilla/Línea de tiempo, de una escena a otra. Por ejemplo, si se creara una escena en donde varios niveles conformaran un personaje completo (cabeza, cuerpo, sombra, etc.), será posible guardarla y, más adelante, importarla en una escena distinta como una sub-planilla.

source: When working inside a Sub-Xsheet, by default only its own contents are displayed in the viewer. If you need to edit the Sub-Xsheet contents while looking at the whole scene contents, you can activate the **Edit in Place** mode.
es: Al trabajar dentro de una sub-planilla, de forma predefinida sólo se visualizará su contenido en el Visor. Si fuera necesario visualizar todo el contenido de la Planilla/Línea de tiempo principal, mientras se edita el contenido de una sub-planilla, se deberá activar el modo **Editar en contexto**.

source: Like standard Xsheets/Timelines, Sub-Xsheets can also contain audio files to be used for synchronizing a soundtrack with the animation. However, audio files loaded inside Sub-Xsheets are ignored when an output file supporting audio is rendered, because the possibility to edit the Sub-Xsheet columns/layers frame order could make the resulting soundtrack inconsistent (see :ref:`Creating a Soundtrack <creating_a_soundtrack>` ).
es: Al igual que cualquier Planilla/Línea de tiempo normal, las sub-planillas también pueden contener archivos de sonido, usados para sincronizar la animación con una banda de sonido. Sin embargo, los sonidos cargados dentro de sub-planillas serán ignorados fuera de las mismas., ya que la posibilidad de editar el orden de los fotogramas de una sub-planilla en la Planilla/Línea de tiempo principal podría causar que dichos sonidos resultaran totalmente inconsistentes (ver :ref:`Creación de una banda de sonido <creating_a_soundtrack>` ).

source: Creating Sub-Xsheets
es: Creación de sub-planillas

source: Sub-Xsheets are managed by the Xsheet menu commands, and by buttons in the Xsheet Toolbar.
es: Es posible administrar las sub-planillas mediante los comandos del menú **Planilla** y los botones de la **Barra de herramientas de la planilla**.

source: You can create a Sub-Xsheet by collapsing one or several columns/layers where levels are exposed, choosing to include when needed the pegbars to which the columns are linked; or you can cut or copy columns/layers and drawings outside of the Sub-Xsheet, then paste them inside of it.
es: Es posible crear una sub-planilla colapsando una o más columnas/capas donde estén expuestos los niveles deseados, siendo posible elegir si incluir, de ser necesario, las barras de sujeción a las cuales se encuentren subordinadas dichas columnas/capas; también es posible cortar o copiar columnas/capas fuera de la sub-planilla y luego pegarlas dentro de la misma.

source: The main Xsheet/Timeline will share with its Sub-Xsheets the animation level database, so if the same level is exposed in the main Xsheet/Timeline and in one of its Sub-Xsheets, the level and its properties will be shared.
es: La Planilla/Línea de tiempo principal comparte con sus sub-planillas el acceso a los mismos niveles de animación, por lo tanto si un nivel se encuentra expuesto en la Planilla/Línea de tiempo principal y en una de sus sub-planillas, dicho nivel y sus propiedades serán compartidos.

source: When copying Sub-Xsheet columns/layers and cells, their copies refer always to the same Sub-Xsheet contents: if changes are made in the Sub-Xsheet, all the cells in the main Xsheet/Timeline referring to that Sub-Xsheet will consequently change their content. If you want to create a copy of a Sub-Xsheet whose contents can be changed independently as concerning internal level exposure, object animation and applied FX, it is possible to **Clone** it.
es: Al copiar columnas y celdas de una sub-planilla, estas copias se referirán siempre al mismo contenido de la sub-planilla: si se realizaran cambios en la sub-planilla, las celdas en la Planilla/Línea de tiempo principal que hicieran referencia a dicha sub-planilla, cambiarán consecuentemente su contenido. En caso de que se necesitara crear una copia de una sub-planilla, que hiciera referencia al mismo contenido de animación, pero con la posibilidad de ser editada de forma independiente, será posible usar el comando Planilla → **Clonar sub-planilla**.

source: **To create a Sub-Xsheet by collapsing one or several columns:**
es: **Para crear una sub-planilla colapsando una o más columnas/capas:**

source: Select the columns you want to be part of the Sub-Xsheet in the Xsheet/Timeline or in the Schematic.
es: Seleccionar, en la Planilla/Línea de tiempo principal o en el Diagrama de escenario, las columnas/capas o nodos que se desee pasen a formar parte de una sub-planilla.

source: Choose Xsheet → **Collapse**.
es: Elegir Planilla → **Colapsar a sub-planilla**.

source: Click the **Collapse** button in the Xsheet Toolbar.
es: Hacer clic en el botón **Colapsar a sub-planilla** en la Barra de herramientas de la planilla.

source: Right-click any column header and choose **Collapse** from the menu that opens.
es: Hacer clic derecho sobre algún encabezado de columna y elegir **Colapsar a sub-planilla**.

source: Choose whether to include relevant pegbars in the Sub-Xsheet or collapse selected columns only, then click the OK button.
es: Elegir si incluir las barras de sujeción relevantes en la nueva sub-planilla o si sólo colapsar las columnas/capas, luego presionar el botón **Aplicar**.

source: **To exit a Sub-Xsheet:**
es: **Para salir de una sub-planilla:**

source: Do one of the following
es: Hacer una de las siguientes cosas:

source: Choose Xsheet → **Close Sub-Xsheet**.
es: Elegir Planilla → **Salir de sub-planilla**.

source: Click the **Close Sub-Xsheet** button in the Xsheet Toolbar.
es: Hacer clic en el botón **Salir de sub-planilla** en la Barra de herramientas de la planilla.

source: **To open a closed Sub-Xsheet:**
es: **Para entrar en una sub-planilla:**

source: Select the Sub-Xsheet column in the Xsheet/Timeline, or the Sub-Xsheet node in the Schematic.
es: Seleccionar la columna/capa donde se encuentran las celdas de la sub-planilla o su nodo correspondiente en el Diagrama de escenario.

source: Choose Xsheet → **Open Sub-Xsheet**.
es: Elegir Planilla → **Entrar en sub-planilla**.

source: Click the **Open Sub-Xsheet** button in the Xsheet/Timeline Toolbar.
es: Hacer clic en el botón **Entrar en sub-planilla** en la Barra de herramientas de la planilla.

source: Right-click the column header and choose **Open Sub-Xsheet** from the menu that opens.
es: Hacer clic derecho sobre el encabezado de la columna/capa y elegir **Entrar en sub-planilla** en el menú.

source: **To clone a Sub-Xsheet:**
es: **Para clonar una sub-planilla:**

source: Select the Xsheet column (or Timeline layer) where the Sub-Xsheet you want to clone is exposed.
es: Seleccionar la columna de la Planilla (o capa de la Línea de tiempo) donde se encuentre expuesta la sub-planilla que se desea clonar.

source: Choose Xsheet → **Clone Sub-Xsheet**.
es: Elegir Planilla → **Clonar sub-planilla**.

source: Right-click the column header and choose **Clone Sub-Xsheet** from the menu that opens.
es: Hacer clic derecho sobre el encabezado de la columna/capa y elegir **Clonar sub-planilla** en el menú.

source: **To toggle edit a Sub-Xsheet in its context:**
es: **Para alternar la edición en contexto de una sub-planilla:**

source: Choose Xsheet → **Toggle Edit in Place**.
es: Elegir Planilla → **Editar en contexto**.

source: Click the **Toggle Edit in Place** button in the Xsheet/Timeline Toolbar.
es: Hacer clic en el botón **Editar en contexto** en la Barra de herramientas de la planilla.

source: **To resequence a Sub-Xsheet:**
es: **Para Resecuenciar una sub-planilla:**
