Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: Copy and paste it into the *+scenes* folder to replace the version you want to scratch.
es: Copiar y pegar dicho archivo en la carpeta *+scenes* para reemplazar a la versión que se desee desechar.

source: Printing Xsheets
es: Impresión de Planillas

source: An Xsheet can be saved as HTML file in order to view it on any computer by using an Internet browser, and to print it on paper.
es: Es posible guardar una Planilla como un archivo HTML, para poder ser vista en cualquier computadora con un navegador de Internet, así como para poder ser impresa en papel.

source: The HTML file contains a header with general information, several tables, whose length and width you can decide, representing the Xsheet with exposed levels and objects movements, and a list of the levels exposed in the Xsheet with the related location on disk.
es: El archivo HTML contiene un encabezado con información general, varias tablas (cuya longitud y ancho es posible cambiar) que representan a la Planilla, con sus niveles expuestos y los movimientos de los objetos, así como una lista de los niveles expuestos en la Planilla y su correspondiente ubicación en el disco.

source: If any Sub-Xsheets are used in the scene, they are displayed after the main Xsheet where they are exposed.
es: Si hubiera sub-planillas en uso en la escena, éstas serán mostradas luego de la planilla principal donde estén expuestas.

source: The information displayed in the header and the appearance of the HTML table can be set by editing the following files located in the folder ``OpenToonz stuff\profiles\layouts\settings`` :
es: Es posible definir la información mostrada en el encabezado y la apariencia de la tabla HTML, editando los siguientes archivos ubicados en la carpeta ``OpenToonz stuff\profiles\layouts\settings`` :

source: ``xsheet_html.xml`` contains the information used for the HTML Xsheet header, and the size for the tables used to represent the Xsheet content.
es: ``xsheet_html.xml`` contiene la información usada para el encabezado HTML de la Planilla, así como el tamaño de las tablas usadas para representar el contenido de la Planilla.

source: ``xsheet.css`` is a Cascading Style Sheet file that is used to define the colors, layout, and other aspects of the HTML Xsheet file (see below ).
es: ``xsheet.css`` es un archivo de *Hojas de Estilo en Cascada* usado para definir los colores, disposición y otros aspectos del archivo HTML de la Planilla (ver abajo).

source: When using the Print Xsheet command, a dialog with information about the location and name of the generated HTML file is displayed; then the generated HTML file is displayed in your default browser.
es: Al usar el comando Archivo → **Imprimir planilla**, se mostrará un diálogo informando acerca de la ubicación y nombre del archivo HTML generado; luego de presionar el botón **Aceptar**, se mostrará el archivo HTML generado, usando el navegador predefinido del sistema operativo.

source: The HTML file is saved in the same location as the TNZ file; the CSS file used for its formatting is generated as well, by copying the one located in the folder ``OpenToonz stuff\profiles\layouts\settings`` . If a CSS file is already available in the location where the HTML Xsheet file is saved, it will be used instead of generating a new one.
es: El archivo HTML será guardado en la misma ubicación de la escena TNZ; el archivo CSS usado para definir su formato también será generado, copiando el archivo ubicado en la carpeta ``OpenToonz stuff\profiles\layouts\settings`` . Si ya existiera un archivo CSS en la ubicación donde se guardó el archivo HTML generado, el mismo será usado, en vez de crear uno nuevo.

source: If you want to move the HTML Xsheet file, you should move the CSS file as well, in order to preserve the HTML file appearance as defined by the CSS file.
es: Cuando fuera necesario mover el archivo HTML de la Planilla hacia otra ubicación, debería moverse también el archivo CSS correspondiente, para preservar la apariencia del archivo HTML, tal como fue definida en el archivo CSS.

source: Editing the HTML Xsheet Header and Table Size
es: Edición del encabezado y tamaño de columna de la planilla en HTML

source: The HTML Xsheet header and the size for the tables used to represent the Xsheet content can be defined by editing the`` xsheet_html.xml`` file available in the folder ``OpenToonz stuff\profiles\layouts\settings`` . It can be edited with any text editor software, e.g. Notepad or TextEdit.
es: Es posible definir el encabezado del archivo HTML de la Planilla, así como el tamaño de las tablas usadas para representar el contenido de la Planilla, mediante la edición del archivo `` xsheet_html.xml`` disponible en la carpeta ``OpenToonz stuff\profiles\layouts\settings`` . El mismo podrá ser editado usando cualquier editor de texto, p.ej: Bloc de notas o TextEdit.

source: The whole text is included in the tag ``xsheet_html`` , that contains the elements ``page`` and ``info`` , where the different users and roles are defined. The basic structure of the file is the following:
es: El texto completo se encuentra incluido bajo la etiqueta ``xsheet_html`` , que contiene los elementos ``page`` e ``info`` , donde se definen los distintos usuarios y roles. La estructura básica del archivo es la siguiente:

source: By editing the ``page row`` and ``page columns`` values you can set the size of the table used for splitting the Xsheet in sections. The size of the table allows you to fit each Xsheet section to the paper size you want to use to print the Xsheet on paper.
es: Mediante la edición de los valores ``page row`` y ``page columns`` es posible definir el tamaño de la tabla usada para dividir a la Planilla en secciones. El tamaño de la tabla permitirá ajustar cada sección de la Planilla al tamaño del papel que se desee usar para imprimir la Planilla.

source: The ``info`` lines allows you to set information to be displayed in the header, for example the production name.
es: Las líneas ``info`` permiten definir la información a ser mostrada en el encabezado, por ejemplo el nombre de la producción.

source: In the example file you can find the following lines:
es: En el archivo de ejemplo es posible encontrar las siguientes líneas:

source: These lines can be edited, and new lines, with the same syntax, can be appended, to provide all the information you want to appear in the header of the HTML Xsheet file.
es: Estas líneas podrán ser editadas, y otras nuevas usando la misma sintaxis agregadas, para proveer toda la información que se desee que aparezca en el encabezado del archivo HTML de la Planilla.

source: By default the header contains the Project and Scene names and the number of frames the scene consists of; this information cannot be edited, as they are retrieved automatically from the scene file.
es: De forma predefinida el encabezado contiene los nombres del Proyecto y la Escena, así como la cantidad de fotogramas del largo de la escena; no es posible editar esta esta información, ya que es obtenida automáticamente desde el archivo de la escena.

source: The ``xsheet_html.xml`` file has to be well-formed, and so it can not contain an opening tag without its related closing tag, otherwise OpenToonz will not run. If you decide to edit the ``xsheet_html.xml`` file, make a backup copy first in case you need to revert the file to the original version.
es: El archivo ``xsheet_html.xml`` deberá estar bien formado, y por lo tanto no podrá una etiqueta de apertura, sin su correspondiente etiqueta de cierre, en caso contrario OpenToonz no podrá ejecutarse. Si fuera necesario editar el archivo ``xsheet_html.xml`` , se sugiere realizar antes una copia de respaldo, en caso de que fuera necesario volver a usar la versión original.

source: **To edit the xsheet_html.xml file:**
es: **Para editar el archivo xsheet_html.xml:**

source: Open the ``xsheet_html.xml`` file available in the folder ``OpenToonz stuff\profiles\layouts\settings`` with a text editor application (e.g. Notepad or TextEdit).
es: Abrir el archivo ``xsheet_html.xml`` disponible en la carpeta ``OpenToonz stuff\profiles\layouts\settings`` con un editor de texto (p.ej: Bloc de notas o TextEdit).

source: **To change the size of the table used for splitting the Xsheet in sections:**
es: **Para cambiar el tamaño de la tabla usada para dividir la Planilla en secciones:**

source: Change the ``page row`` and ``page columns`` values in the ``xsheet_html.xml`` file.
es: Cambiar los valores ``page row`` y ``page columns`` en el archivo ``xsheet_html.xml`` .

source: **To edit the information displayed in the header:**
es: **Para editar la información mostrada en el encabezado:**

source: Edit the ``info`` lines available in the ``xsheet_html.xml`` file, and append new ones if needed.
es: Editar las líneas ``info`` disponibles en el archivo ``xsheet_html.xml`` , y agregar nuevas líneas si fuera necesario.

source: **To check if the xsheet_html.xml file is well-formed:**
es: **Para comprobar si el archivo xsheet_html.xml se encuentra bien formado:**

source: Open it with an Internet browser and check if all the elements are displayed in a nested list where they can be opened and closed to display or hide the related contents.
es: Abrirlo con un navegador de Internet y verificar que todos sus elementos se muestren listas anidadas, donde puedan ser abiertos y cerrados, para mostrar u ocultar su contenido.

source: Editing HTML Xsheet Appearance
es: Edición de la apariencia de la planilla en HTML

source: The HTML Xsheet appearance can be defined by editing thexsheet.css file available in the folder ``OpenToonz stuff\profiles\layouts\settings`` .
es: Es posible definir la apariencia del HTML de la Planilla, mediante la edición del archivo xsheet.css disponible en la carpeta ``OpenToonz stuff\profiles\layouts\settings`` .

source: The ``xsheet.css`` is a Cascading Style Sheet file that is used to define the colors, layout, and other aspects of the HTML Xsheet file. It can be edited with any text editor software, e.g. Notepad or TextEdit.
es: El archivo ``xsheet.css`` es un archivo de *Hojas de Estilo en Cascada* usado para definir los colores, disposición y otros aspectos del archivo HTML de la Planilla. El mismo podrá ser editado usando cualquier editor de texto, p.ej: Bloc de notas o TextEdit.

source: Editing the CSS file requires some skill in the CSS language, but some changes like table ruling thickness, or cell colors, can be easily done by expressing the thickness in pixels and colors as an RGB triplet in hexadecimal format.
es: La edición de un archivo CSS requiere tener algún conocimiento del lenguaje CSS, sin embargo será posible realizar algunos cambios, como el grosor de las líneas de la tabla o el color de las celdas, de forma relativamente sencilla, expresando el grosor en píxeles y los colores como un triplete RGB, en formato hexadecimal.

source: Elements defined in the CSS are the following:
es: Los elementos definidos en el archivo CSS son los siguientes:

source: ``header`` refers to the table used as header in the HTML Xsheet file.
es: ``header`` se refiere a la tabla usada como encabezado en el archivo HTML de la Planilla.

source: ``table`` refers to the table used for displaying the Xsheet sections.
es: ``table`` se refiere a la tabla usada para mostrar las secciones de la Planilla.

source: ``TH`` refers to the header cells of the tables.
es: ``TH`` se refiere a las celdas de título de las tablas.

source: ``first_numeric`` refers to the first numerical column of the Xsheet tables.
es: ``first_numeric`` se refiere a la primera columna numérica de las tablas de Planilla.

source: ``fxcell`` refers to the table cells belonging to special FX columns.
es: ``fxcell`` se refiere a las celdas de la tabla que representan a columnas de efectos.

source: ``subxsheetcell`` refers to the table cells belonging to Sub-Xsheet columns.
es: ``subxsheetcell`` se refiere a las celdas de la tabla que representan a columnas de sub-planillas.

source: ``TD`` refers to the generic table cells.
es: ``TD`` se refiere a las celdas genéricas de la tabla.

source: ``TH.frame`` refers to the frame column
es: ``TH.frame`` se refiere a la columna de fotogramas.

source: ``TD.levelcell`` refers to the table cells belonging to standard level columns.
es: ``TD.levelcell`` se refiere a las celdas de la tabla que representan columnas de niveles normales.

source: The CSS files have to be written according to a specific syntax. If you decide to edit the ``xsheet.css`` file, make a backup copy first in case you need to revert the file to the original version.
es: Los archivos CSS deben ser escritos de acuerdo a una sintaxis específica. Si fuera necesario editar el archivo ``xsheet.css`` , se sugiere realizar antes una copia de respaldo, en caso de que fuera necesario volver a usar la versión original.

source: **To edit the xsheet.css file:**
es: **Para editar el archivo xsheet.css:**

source: Open the ``xsheet.css`` file available in the folder ``OpenToonz stuff\profiles\layouts\settings`` with a text editor application (e.g. Notepad or TextEdit).
es: Abrir el archivo ``xsheet.css`` disponible en la carpeta ``OpenToonz stuff\profiles\layouts\settings`` con un editor de texto (p.ej: Bloc de notas o TextEdit).
