Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: Use the **Cut** command: to eliminate the selection from the scene and keep it in memory for further operations. The column/layer elimination causes the following columns to shift left (or the layers above to shift down).
es: Usar el comando **Cortar** para eliminar la selección de la escena y mantenerla en memoria para operaciones futuras. La eliminación de columnas/capas causará que las siguientes columnas sean movidas hacia la izquierda (o las siguientes capas movidas hacia abajo).

source: Use the **Paste** command to paste the selection kept in memory starting from the selected column/layer. The command causes following columns to shift right (or layers above to shift up).
es: Usar el comando **Pegar** para pegar la selección en memoria, a partir de la columna/capa seleccionada. El comando causará que las siguientes columnas sean movidas hacia la derecha (o las siguientes capas movidas hacia arriba).

source: Use the **Delete** command to delete the selection.
es: Usar el comando **Borrar** para borrar la selección.

source: Use the **Insert** command to insert empty columns before the selection; inserted columns/layers will be as many as the selected ones.
es: Usar el comando **Insertar** para insertar columnas/capas vacías antes de la selección; se insertarán tantas columnas/capas como las que estuvieran seleccionadas.

source: All of these commands are also available in the menu that opens when right-clicking the column/layer header.
es: Todos estos comandos también se encuentran disponibles en el menú contextual que se invoca al hacer clic derecho sobre el encabezado de las columnas/capas.

source: **To include or exclude a column/layer contents from the rendering:**
es: **Para incluir o excluir el contenido de una columna/capa en el procesamiento:**

source: Click the render toggle (|preview|) on the column/layer header. If you right-click the button you can select commands from a menu that opens, that let you affect several columns/layers at the same time.
es: Hacer clic sobre el interruptor **Visibilidad durante el procesamiento** (|preview|) en el encabezado de la columna/capa. Es posible seleccionar comandos adicionales, al hacer clic derecho sobre el mismo, para permitir afectar a varias columnas/capas a la vez.

source: **To show or hide a column/layer contents in the viewer:**
es: **Para incluir o excluir el contenido de una columna/capa en el Visor:**

source: Click the camera stand toggle (|camera_stand|) on the column/layer header. The icon is faded out in case a partial opacity is set (see below). If you right-click the button you can select commands from a menu that opens that let you affect several columns/layers at the same time.
es: Hacer clic sobre el interruptor **Visibilidad en mesa de trabajo** (|camera_stand|) en el encabezado de la columna/capa. Su ícono tendrá un desvanecimiento hacia la esquina inferior derecha, como forma de indicar una opacidad parcial (ver más abajo). Es posible seleccionar comandos adicionales, al hacer clic derecho sobre el mismo, para permitir afectar a varias columnas/capas a la vez.

source: Right-click the column/layer content in the viewer and choose the **Hide** or **Show** command related to the column/layer you want to hide or show.
es: Hacer clic derecho sobre el contenido de la columna/capa en el Visor y elegir el comando apropiado del sub-menú **Mostrar / Ocultar** para mostrar u ocultar dicha columna.

source: **To lock or unlock a column/layer contents:**
es: **Para bloquear o desbloquear el contenido de una columna/capa:**

source: Click the lock toggle (|lock|) on the column/layer header. If you right-click the button you can select commands from a menu that opens that let you lock or unlock several columns/layers at the same time.
es: Hacer clic sobre el interruptor de **Bloqueo** (|lock|) en el encabezado de la columna/capa. Es posible seleccionar comandos adicionales, al hacer clic derecho sobre el mismo, para permitir afectar a varias columnas/capas a la vez.

source: **To set Opacity for a column/layer content:**
es: **Para definir la Opacidad del contenido de una columna/capa:**

source: Click the triangle icon (|additional_settings|) on the column/layer header, and do one of the following:
es: Hacer clic sobre el interruptor de **Opciones adicionales** (|additional_settings|) en el encabezado de la columna/capa, y hacer una de las siguientes cosas:

source: Use the **Opacity** slider to set the column/layer opacity.
es: Usar el deslizador de **Opacidad:** para definir la opacidad de la columna/capa.

source: Input the desired **Opacity** value in the numeric field, to set the column/layer opacity.
es: Ingresar el valor de **Opacidad:** deseado en el campo numérico, para definir la opacidad de la columna/capa.

source: **To set a Color Filter for a column/layer content:**
es: **Para definir un Filtro de color para el contenido de una columna/capa:**

source: Click the triangle icon (|additional_settings|) on the column/layer header, and set the **Filter** parameter to one of its predefined colors.
es: Hacer clic sobre el interruptor de **Opciones adicionales** (|additional_settings|) en el encabezado de la columna/capa, y definir el parámetro **Filtro:** en uno de sus colores predefinidos.

source: You can make Opacity and Color Filter take effect at render time by activating the **Enable Column Color Filter and Transparency for Rendering** option in the Xsheet → Scene Settings... dialog.
es: Es posible hacer que las opciones de **Opacidad:** y **Filtro:** de color sean utilizadas durante el procesamiento, activando la opción **Habilitar Opacidad y Filtro de color de columnas durante el procesamiento** en el diálogo Planilla → Opciones de escena...

source: **To fold columns/layers:**
es: **Para plegar columnas/capas:**

source: Select the columns/layers you want to fold.
es: Seleccionar las columnas/capas que se desee plegar.

source: Right-click the selection and choose **Fold Column** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir **Plegar columna** en el menú.

source: **To unfold columns/layers:**
es: **Para desplegar columnas/capas:**

source: Click the fold visible between the column/layer headers.
es: Hacer clic sobre el encabezado de la columna/capa plegada que se desee desplegar.

source: Working with Cells
es: Trabajo con celdas

source: When a level is exposed in a column, each cell contains a reference to a particular image. You may empty some cells, repeat some of them or change their order without affecting the real drawings sequence, because you are operating on references. This means that when a scene contains several cells referring to a drawing of an animation level, they all refer to the same drawing. This implies that when you modify a drawing of an animation level, all the cells in the Xsheet/Timeline referring to that drawing will consequently change their content.
es: Cuando un nivel se encuentra expuesto en una columna/capa, cada celda contiene una referencia a una imagen particular del mismo. Es posible vaciar, repetir o cambiar el orden de algunas celdas, sin afectar la secuencia real de los dibujos en el nivel, debido a que se está operando sobre referencias. Esto significa que cuando una escena contiene varias celdas que se refieren a un mismo dibujo de un nivel de animación, todas ellas tomarán como fuente a ese único dibujo. Esto a su vez implica que al modificar ese dibujo en el nivel de animación, todas las celdas de la Planilla/Línea de tiempo que hagan referencia al mismo, cambiarán consecuentemente su contenido.

source: When the scene contains a reference to a drawing that is eliminated from the level, the drawing name and number in the cell turn red, to warn you that there is no drawing available for that cell anymore.
es: Cuando la escena contuviera una referencia a un dibujo que hubiera sido eliminado de un nivel, el nombre y número mostrados en la celda aparecerán en *rojo*, como forma de advertir acerca del dibujo faltante.

source: When you select a cell, you can work on the drawing it contains by using tools in the viewer.
es: Al seleccionar una celda, será posible trabajar en el dibujo al cual hace referencia, utilizando las herramientas en el Visor.

source: When one or more cells are selected you can perform standard cut, copy, paste, delete and insert operations in the Xsheet/Timeline. In this case you are not modifying the animation level frames but simply changing the way it is exposed in the Xsheet/Timeline.
es: Cuando haya seleccionada una o más celdas, será posible realizar operaciones estándar como: cortar, copiar, pegar, borrar e insertar, en la Planilla/Línea de tiempo. En este caso no se estará modificando a los dibujos del nivel de animación, en sí mismos, sino simplemente cambiando la forma en que éstos están expuestos en la Planilla/Línea de tiempo.

source: Selected cells can also be dragged to a new position in the Xsheet/Timeline, in duplicating, inserting or overwriting mode as well. When they are dragged to an empty column, it is possible to move along the data of the column/layer, i.e. the movement and special FX, where they were originally exposed.
es: Las celdas seleccionadas también podrán ser arrastradas a nuevas posiciones en la Planilla/Línea de tiempo, en modos que permitan su duplicación, inserción o sobrescritura. Al ser arrastradas sobre una columna/capa vacía, será posible mover, conjuntamente con el contenido, los datos de la columna/capa de origen, p.ej: sus transformaciones o los efectos aplicados a la misma.

source: **To modify a drawing exposed in a cell:**
es: **Para modificar un dibujo expuesto en una celda:**

source: Select the cell in the Xsheet/Timeline where the drawing is exposed.
es: Seleccionar la celda en la Planilla/Línea de tiempo, donde se encuentre expuesto el dibujo.

source: Use the tools to edit it in the Viewer.
es: Usar las herramientas para editarlo en el Visor.

source: **To select several cells:**
es: **Para seleccionar varias celdas:**

source: Click and drag to select a series of cells.
es: Hacer clic y arrastrar para seleccionar una serie de celdas.

source: Shift-click a cell to extend the selection up to that cell.
es: Hacer Mayúsculas-clic sobre una celda para extender la selección hasta dicha celda.

source: Press Ctrl and drag to include keys in the selection. A red frame will be shown around the selection.
es: Presionando la tecla Ctrl arrastrar para incluir fotogramas clave como parte de la selección. Se mostrará un marco *rojo* alrededor de la selección.

source: Click the vertical strip available on the left of the cells in the Xsheet, to select the continuous sequence of drawings belonging to the same animation level.
es: Hacer clic en la banda vertical disponible en la parte izquierda de las celdas en la Planilla, para seleccionar la secuencia continua de dibujos pertenecientes al mismo nivel de animación.

source: Click the horizontal strip available on thetop of the cells in the Timeline, to select the continuous sequence of drawings belonging to the same animation level.
es: Hacer clic en la banda horizontal disponible en la parte superior de las celdas en la Línea de tiempo, para seleccionar la secuencia continua de dibujos pertenecientes al mismo nivel de animación.

source: **To edit cells with the Edit menu commands:**
es: **Para editar las celdas usando los comandos del menú Editar:**

source: You can do the following:
es: Es posible hacer lo siguiente:

source: Use the **Cut** command to eliminate the selection from the Xsheet/Timeline and keep it in memory for further operations. The cell elimination causes the following cells in the Xsheet to shift up, or in the Timeline, to shift to the left.
es: Usar el comando **Cortar** para eliminar la selección de la escena y mantenerla en memoria para operaciones futuras. La eliminación de celdas causará que las celdas siguientes sean desplazadas hacia arriba en la Planilla (o hacia la izquierda, en la Línea de tiempo).

source: Use the **Paste** command to paste the selection kept in memory into the Xsheet/Timeline, starting from the selected insertion cell. The command causes the following cells in the Xsheet to shift down, or in the Timeline, to shift to the right.
es: Usar el comando **Pegar** para pegar la selección en memoria, a partir de la celda seleccionada. El comando causará que las celdas siguientes sean desplazadas hacia abajo en la Planilla (o hacia la derecha, en la Línea de tiempo).

source: Use the **Delete** command to empty the selected cells from any reference.
es: Usar el comando **Borrar** para vaciar las celdas seleccionadas.

source: Use the **Insert** command to insert blank cells before the selection; inserted cells will be as many as the selected ones.
es: Usar el comando **Insertar** para insertar celdas vacías antes de la selección; se insertarán tantas celdas como las que estuvieran seleccionadas.

source: All the Edit menu commands are also available in the menu that opens when right-clicking the Xsheet/Timeline cells.
es: Todos estos comandos también se encuentran disponibles en el menú contextual que se invoca al hacer clic derecho sobre las celdas en la Planilla/Línea de tiempo.

source: **To edit cells with the Cells menu commands:**
es: **Para editar celdas usando los comandos del menú Celdas:**

source: Use the **Reverse** command to invert the order of the selected cells.
es: Usar el comando **Invertir** para invertir el orden de las celdas seleccionadas.

source: Use the **Swing** command to append the selected cells, at the end of the selection, in a reversed order. The last cell of the selection will not be repeated.
es: Usar el comando **Oscilar** para anexar a las celdas seleccionadas, las propias celdas seleccionadas pero en un orden inverso. La última celda de la selección no será repetida.

source: Use the **Random** command to rearrange the selected cells in a random order. The order changes every time you use the command.
es: Usar el comando **Aleatorio** para reorganizar las celdas seleccionadas en un orden aleatorio. Dicho orden cambiará cada vez que se utilice el comando nuevamente.

source: Use the **Autoexpose** command to repeat the selected cells, as if filling the numbering gap between two subsequent drawings. For example if the command is applied to two cells where drawing 2 and 5 are exposed, the result will be four cells with drawings 2, 2, 2 and 5. The command works only if the selection is increasingly numbered.
es: Usar el comando **Exposición automática** para repetir las celdas seleccionadas, como si se estuviera rellenando un hueco en la numeración entre dos dibujos consecutivos. Por ejemplo, si el comando fuera aplicado a dos celdas donde se encuentran expuestos los dibujos 2 y 5, el resultado serán cuatro celdas con los dibujos 2, 2, 2 y 5. El comando sólo funcionará si la numeración en la selección de celdas es ascendente.

source: If the Autoexpose command is used on an level numbered 1, 3, 5, 7, etc., the level will be automatically exposed step 2.
es: Si el comando Exposición automática fuera usado en un nivel numerado 1, 3, 5, 7, etc. el nivel se expondrá automáticamente a cuadro doble.

source: Use the **Repeat** command to open a dialog that allows you to repeat cyclically the selected cells by specifying a number of times, or the frame number up to which the selection has to be repeated.
es: Usar el comando **Repetir...** para abrir un diálogo que permitirá la repetición cíclica de las celdas seleccionadas, especificando la cantidad de **Veces:** que deberán ser repetidas y, por medio del parámetro **Hasta fotograma:**, el fotograma hasta el cual deberá ser repetida la selección.

source: Use the **Reset Step** command to remove any animation step in the selected cells, preserving the order of the exposed drawings.
es: Usar el comando **Restablecer exposición** para eliminar cualquier exposición extra en las celdas seleccionadas, preservando el orden de exposición de los dibujos.

source: Use the **Increase Step** command to increase the animation step of the selected cells by one unit.
es: Usar el comando **Aumentar exposición** para aumentar la exposición de las celdas seleccionadas en una unidad.

source: Use the **Decrease Step** command to decrease the animation step of the selected cells by one unit; if a drawing is exposed in one cell only, it will be preserved.
es: Usar el comando **Disminuir exposición** para disminuir la exposición de las celdas seleccionadas en una unidad; si un dibujo estuviera expuesto sólo en una celda, éste será preservado.

source: Use the **Step 2**, **Step 3** or **Step 4** command to repeat the selected cells in order to have a step 2, step 3, or step 4 animation.
es: Usar el comando **Exposición x2**, **Exposición x3** o **Exposición x4** para repetir las celdas seleccionadas, de manera de obtener una animación a cuadro doble, triple o cuádruple.

source: Use the **Each 2**, **Each 3** or **Each 4** command to preserve only one cell each 2, each 3, or each 4 of the selection, and delete the others.
es: Usar el comando **Uno de cada 2**, **Uno de cada 3** o **Uno de cada 4** para conservar sólo una celda seleccionada de cada 2, 3 o 4, borrando el resto.

source: Use the **Roll Up** command to shift the content of selected cells up, with the top cell content replacing the bottom cell one.
es: Usar el comando **Desplazar hacia arriba** para desplazar hacia arriba el contenido de las celdas seleccionadas, haciendo que el contenido de la primera celda pase a reemplazar al de la última.

source: Use the **Roll Down** to shift the content of selected cells down, with the bottom cell content replacing the top cell one.
es: Usar el comando **Desplazar hacia abajo** para desplazar hacia abajo el contenido de las celdas seleccionadas, haciendo que el contenido de la última celda pase a reemplazar al de la primera.

source: All the Cells menu commands are also available in the menu that opens when right-clicking the Xsheet/Timeline cells.
es: Todos estos comandos también se encuentran disponibles en el menú contextual que se invoca al hacer clic derecho sobre las celdas en la Planilla/Línea de tiempo.

source: **To drag a cell selection in the Xsheet:**
es: **Para arrastrar una selección de celdas en la Planilla:**

source: **Click** the vertical strip available on the left of the cells, and drag to move them to a new position.
es: Hacer **clic** en la banda vertical a la izquierda de las celdas y arrastrar para moverlas hasta una nueva posición.

source: **Ctrl-click** (PC) or **Cmd-click** (Mac) the vertical strip available on the left of the cells, and drag them to the new position, duplicating them.
es: Hacer **Ctrl-clic** (PC) o **Cmd-clic** (macOS) en la banda vertical a la izquierda de las celdas y arrastrar para duplicarlas hasta una nueva posición.

source: **Shift-click** the vertical strip available on the left of the cells, and drag them to the new position, inserting them if other content is exposed in the destination cells.
es: Hacer **Mayúsculas-clic** en la banda vertical a la izquierda de las celdas y arrastrar para moverlas hasta una nueva posición, insertándolas si ya hubiera otro contenido expuesto en las celdas de destino.

source: **Alt-click** the vertical strip available on the left of the cells, and drag them to the new position, overwriting any other content previously exposed in the destination cells.
es: Hacer **Alt-clic** en la banda vertical a la izquierda de las celdas y arrastrar para moverlas hasta una nueva posición, sobrescribiendo cualquier otro contenido previamente expuesto en las celdas de destino.

source: When it's not possible to paste the selection, a red outline is displayed instead of the selection.
es: Cuando no fuera posible pegar la selección, se mostrará un contorno *rojo* en vez de la selección.

source: **To drag a cell selection in the Timeline:**
es: **Para arrastrar una selección de celdas en la Línea de tiempo:**

source: **Click** the horizontal strip available on the top of the cells, and drag to move them to a new position.
es: Hacer **Mayúsculas-clic** en la banda horizontal en la parte superior de las celdas y arrastrar para moverlas hasta una nueva posición, insertándolas si ya hubiera otro contenido expuesto en las celdas de destino.

source: **Ctrl-click** (PC) or **Cmd-click** (Mac) the horizontal strip available on the top of the cells, and drag them to the new position, duplicating them.
es: Hacer **Ctrl-clic** (PC) o **Cmd-clic** (macOS) en la banda horizontal en la parte superior de las celdas y arrastrar para duplicarlas hasta una nueva posición.

source: **Shift-click** the horizontal strip available on the top of the cells, and drag them to the new position, inserting them if other content is exposed in the destination cells.
es: Hacer **Mayúsculas-clic** en la banda horizontal en la parte superior de las celdas y arrastrar para moverlas hasta una nueva posición, insertándolas si ya hubiera otro contenido expuesto en las celdas de destino.

source: **Alt-click** the horizontal strip available on the top of the cells, and drag them to the new position, overwriting any other content previously exposed in the destination cells.
es: Hacer **Alt-clic** en la banda horizontal en la parte superior de las celdas y arrastrar para moverlas hasta una nueva posición, sobrescribiendo cualquier otro contenido previamente expuesto en las celdas de destino.

source: **To drag a cell selection moving along the column/layer data:**
es: **Para arrastrar una selección de celdas, moviendo también los datos de la columna/capa:**

source: Choose File → Preferences... → Xsheet.
es: Elegir Archivo → Preferencias... → Planilla.

source: Set the Cell-dragging Behaviour option to **Cells and Column Data**.
es: Definir **Comportamiento al arrastrar celdas:** en la opción **Celdas y datos de la columna**.

source: Column/layer data is moved along only when dragging the selected cells to an empty column/layer.
es: Los datos de la columna/capa serán movidos sólo cuando las celdas hayan sido arrastradas hasta una columna/capa vacía.

source: Column/layer data is moved along except for the linked columns/layers, because linked columns/layers can only have one parent column/layer.
es: Se moverán todos los datos de la columna/capa, excepto la lista de capas subordinadas a ella, ya que las columnas/capas sólo pueden estar vinculadas jerárquicamente a una única columna/capa superior.

source: Using the Smart Fill Handle
es: Uso del Asa de relleno inteligente

source: The Fill Handle allows you to edit cells directly from within the Xsheet/Timeline.
es: El **Asa de relleno inteligente** permite editar celdas directamente en la Planilla/Línea de tiempo.

source: It's the small tab appearing at the bottom of the cell selection in the Xsheet, or at the right of the cell selection in the Timeline. By dragging this handle you can repeat a cell or a group of cells, you can add cells, or you can delete the last cells of a sequence. The behavior of the handle is smart: this means that the way cells are repeated, added, or deleted depends on the selection content.
es: Se trata de la pequeña solapa que aparece en la parte inferior de la selección de celdas en la Planilla, o a la derecha de la misma en la Línea de tiempo. Mediante el arrastre de esta solapa será posible repetir una celda o un grupo de celdas, agregar celdas o borrar las últimas celdas de una secuencia. El comportamiento del asa es inteligente: esto significa que la forma en que las celdas serán repetidas, agregadas o borradas dependerá del contenido de la propia selección.
