Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: **Use Camera DPI** button applies to the level automatically the camera DPI. It is useful when the level has the same size of the camera but different DPI, and you want it to match perfectly the camera.
es: **Usar PPP de cámara**, permite aplicar al nivel los PPP de la cámara activa. Resulta útil cuando un nivel tiene el mismo tamaño de la cámara pero distintos PPP y se desea que éstos coincidan exactamente con los de la cámara.

source: Information about **Camera DPI**, **Image DPI** and image **Resolution** are displayed for reference purposes.
es: La información acerca de **PPP de la cámara:**, **PPP de la imagen:** y **Resolución:** de la imagen es mostrada como referencia.

source: **Premultiply** premultiplies the alpha channel of the level. Images which have a meaningful alpha channel come in two types: premultiplied or not. A non-premultiplied image can be recognized when it is loaded in OpenToonz because its edge, where there is a complete transparence on one side and opacity on the other, is not smooth, but displays a solid halo. With the premultiply operation it is possible to transform the image alpha-channel so that it is correctly displayed in OpenToonz camera stand, preview and rendering.
es: **Premultiplicar**, premultiplica el canal alfa del nivel. Las imágenes que cuentan con información de canal alfa, pueden contenerla en dos formatos distintos: premultiplicado o directo. Es posible reconocer a una imagen que contenga un canal alfa directo (no premultiplicado) por la apariencia de sus bordes, en los que se puede apreciar un pasaje abrupto entre opacidad y transparencia, así como un halo sólido; mediante la premultiplicación de su canal alfa es posible corregir este problema para que pueda componerse junto a otras imágenes en OpenToonz correctamente. Esta opción se encuentra disponible únicamente para niveles de Imagen.

source: **White As Transparent** sets the pure white color (i.e. with red, green and blue values to 255) as transparent and automatically adds some antialiasing to the level images. This option is meant for animation levels generated from third-party software (such as Retas) that do not have a transparent background but a solid white one, and whose lines do not have antialiasing.
es: **Blanco como transparente**, permite definir el color blanco puro (con los canales rojo, verde y azul en 255) como transparente y agregar un cierto suavizado de bordes a las imágenes del nivel. Esta opción está pensada para niveles de animación generados en otros programas (p.ej: Retas) que no generan un fondo transparente, sino sólido de color blanco y cuyas líneas no contienen suavizado de bordes.

source: **Add Antialiasing** gives the user the possibility to add antialiasing to the level. The antialiasing value has to be specified in the **Antialias Softness** field, which can range from 0 to 100. This option is available on Toonz Raster and Raster levels.
es: **Agregar suavizado de bordes**, permite agregar suavizado de bordes al nivel. El valor de suavizado de bordes debe ser especificado en el campo **Suavizado:**, que puede contener valores entre 0 y 100. Esta opción se encuentra disponible para niveles de Imagen de Toonz y de Imagen.

source: **Subsampling** sets the simplifying factor to be applied to animation levels, clips and images when displayed in the work area in order to have a faster visualization and playback; for example if it is 2, one pixel every two pixels is displayed. The default values are defined in Xsheet → Scene Settings dialog, where values for raster (Image) and toonz raster (TLV) level subsampling can be defined.
es: **Sub-muestreo**, permite definir el factor de simplificación, a ser aplicado a los niveles de animación, clips de video e imágenes al ser mostrados en el Visor, con el propósito de obtener un mejor rendimiento de visualización interactiva y reproducción en el programa; por ejemplo si el valor fuera 2, se mostrará un píxel de cada dos. En el diálogo Planilla → **Opciones de escena...**, es posible establecer los valores predefinidos para el sub-muestreo de los niveles de tipo Imagen de Toonz e Imagen.

source: The subsampling factor can also be applied to all the animation levels exposed in selected columns by right-clicking the header of any selected column and choosing one of the **Subsampling** commands from the menu that opens.
es: También es posible aplicar el factor de sub-muestreo a todos los niveles de animación expuestos en las columnas/capas seleccionadas, haciendo clic derecho en el encabezado de cualquiera de las columnas/capas seleccionadas y eligiendo uno de los comandos disponibles en el submenú **Sub-muestreo**.

source: **To open the Level Settings dialog:**
es: **Para abrir el diálogo Opciones de nivel:**

source: Select a level in the Xsheet/Timeline and choose Level → **Level Settings...**.
es: Seleccionar un nivel en la Planilla/Línea de tiempo y elegir Nivel → **Opciones de nivel...**

source: Right-click a level in the Xsheet/Timeline and choose **Level Settings...** from the menu that opens.
es: Hacer clic derecho sobre un nivel en la Planilla/Línea de tiempo y elegir **Opciones de nivel...** en el menú.

source: Right-click a level in the Scene Cast and choose **Level Settings...** from the menu that opens.
es: Hacer clic derecho sobre un nivel en el panel Componentes de la escena y elegir **Opciones de nivel...** en el menú.

source: Xsheet Toolbar
es: Barra de herramientas de la planilla

source: The Xsheet Toolbar, at the top of the Xsheet and Timeline panes, is a place where the user can display favorite OpenToonz tools and commands to have them readily available.
es: La Barra de herramientas de la planilla, disponible en la parte superior de la Planilla y la Línea de tiempo, es un lugar donde es posible ubicar botones de herramientas y comandos favoritos de OpenToonz, con el propósito de tenerlos a mano en todo momento.

source: The Xsheet Toolbar pane can be toggled depending on user preferences.
es: Es posible mostrar u ocultar la Barra de herramientas de la planilla, dependiendo de las preferencias del usuario.

source: If the Xsheet Toolbar is too short to display all the command buttons, a double-arrow symbol will appear at the right end of it, allowing to display a drop down menu with the rest of them.
es: Si la Barra de herramientas de la planilla fuera demasiado corta como para mostrar la totalidad de los botones de comandos y herramientas, aparecerá un símbolo con una doble flecha, en el extremo derecho de la misma, posibilitando el despliegue de un menú para mostrar el resto de los botones disponibles.

source: **To toggle the Xsheet Toolbar:**
es: **Para alternar la visualización de la Barra de herramientas de la planilla:**

source: Right click on any *column/layer header* and choose **Toggle Xsheet Toolbar** from the menu that opens.
es: Hacer clic derecho sobre el *encabezado de una columna* y elegir **Barra de herramientas de planilla** en el menú.

source: Activate the File → Preferences... → Xsheet → **Show Toolbar in the Xsheet** option.
es: Activar la opción Archivo → Preferencias... → Planilla → **Mostrar la barra de herramientas en la planilla**.

source: When the Xsheet Toolbar is shown, it's also possible to activate the **Expand Function Editor Header to Match Xsheet Toolbar Height** option to correctly match the *frame* rows in both editors, when put side by side.
es: Al estar visible la Barra de herramientas de la planilla, será posible activar la opción **También expandir la altura del editor de funciones**, para hacer que la fila de *fotogramas* de ambos editores coincida, al ponerlos lado a lado.

source: **To customize the Xsheet Toolbar buttons:**
es: **Para personalizar la Barra de herramientas de la planilla:**

source: Right click on it and select **Customize Xsheet Toolbar** from the menu that opens. The Customize Xsheet Toolbar window will open.
es: Hacer clic derecho sobre la Barra de herramientas de la planilla y seleccionar **Personalizar barra de herramientas de planilla**. Se abrirá la ventana Personalizar barra de herramientas de planilla.

source: To *add* a command: Search for a command in the **Toolbar Items** list (right) and drag it to the **Xsheet Toolbar** list (left).
es: Para *agregar* un comando: Buscar un comando en la lista **Elementos de la barra de herramientas** (derecha) y arrastrarlo a la lista **Barra de herramientas de planilla** (izquierda).

source: To *add* a separator: At the end of the **Toolbar Items** list (right), drag the **----Separator----** item to the **Xsheet Toolbar** list (left).
es: Para *agregar* un separador: Al final de la lista **Elementos de la barra de herramientas** (derecha), arrastrar el elemento **----separador----** a la lista **Barra de herramientas de planilla** (izquierda).

source: To *delete* a command: Locate the command in the **Xsheet Toolbar** list (left), right click on it and select **Remove** from the menu that opens.
es: Para *eliminar* un comando: Buscar el comando en la lista **Barra de herramientas de planilla** (izquierda), hacer clic derecho sobre él y seleccionar **Eliminar** en el menú.

source: Click **OK** to accept the changes or **Cancel** to discard them.
es: Hacer clic en el botón **Aceptar** para aceptar los cambios o en **Cancelar** para descartarlos.

source: Working with Columns/Layers
es: Trabajo con columnas/capas

source: When levels are exposed in the Xsheet they are placed in columns (layers, in the case of the Timeline). The column/layer stacking order sets which drawings and images are placed on top, or behind, other images. Its direction is from left to right in the Xsheet, and from bottom to top in the Timeline, so what is on the left/bottom is behind what is on the right/top. You can use the keyboard arrow keys to move between the columns/layers and time.
es: Cuando se exponen niveles en la Planilla, éstos se ubican en columnas (capas en el caso de la Línea de tiempo). El propio orden de las columnas/capas es el que establece qué dibujos e imágenes aparecerán por encima de otros. La dirección usada es de izquierda a derecha en la Planilla y de abajo a arriba en la Línea de tiempo, de manera que los que se encuentre a la izquierda/abajo aparecerá más abajo que lo que se encuentre a la derecha/arriba. Será posible usar las teclas de flechas del teclado para moverse a través de las distintas columnas/capas y el tiempo.

source: The Xsheet is divided into sections divided by horizontal markers (vertical, in case of the Timeline), whose interval can be customized; at each marker the name of the levels exposed can be displayed, when the option **Display Level Name on Each Marker** is active in the Preferences... → Interface dialog section.
es: La Planilla se encuentra dividida en secciones, demarcadas por líneas horizontales (verticales, en el caso de la Línea de tiempo), cuyos intervalos será posible personalizar; en cada uno de estos marcadores será posible mostrar el nombre de los niveles expuestos, cuando la opción **Mostrar nombre de niveles en cada marcador** se encuentra activada, en el diálogo Archivo → Preferencias... → Interfaz.

source: Column/layer cells may have different colors according to the type of level they contain. Toonz Vector levels are displayed in *dark yellow*; Toonz Raster levels in *green*; Raster levels in *light blue*; Sub-Xsheets in *violet* (see :ref:`Using Sub-Xsheets <using_sub-xsheets>` ); Effect levels generated by OpenToonz in *brown* (see :ref:`Using the FX Schematic <using_the_fx_schematic>` ); Audio levels in *pale green* (see :ref:`Creating a Soundtrack <creating_a_soundtrack>` ); and Note levels in *grey*.
es: Las celdas de las columnas/capas podrán tener distintos colores, de acuerdo al tipo de nivel que contengan. Los niveles de tipo Vectorial de Toonz se mostrarán en un color *amarillo oscuro*; los de Imagen de Toonz en *verde*; los de Imagen en *azul claro*; las sub-planillas en *violeta* (ver :ref:`Uso de sub-planillas <using_sub-xsheets>` ); los niveles creados por efectos en *marrón** (ver :ref:`Uso del Diagrama de efectos <using_the_fx_schematic>` ); los de sonido en *verde claro* (see :ref:`Creación de una banda de sonido <creating_a_soundtrack>` ); y los niveles de Notas en *gris*.

source: Each column/layer header contains information about its content. These are:
es: El encabezado de cada columna/capa contendrá información acerca de su contenido. A saber:

source: **Name**, by default is the name of the first exposed level. The area color indicates the type of level exposed in the column/layer.
es: **Nombre**, de forma predefinida será el número de la columna/capa. p.ej: Col5. Su color indicará el tipo de nivel expuesto en la misma.

source: **Render toggle** (|preview|) allowing you to include or not the column/layer contents in the rendering.
es: **Visibilidad durante el procesamiento** (|preview|), permite controlar si el contenido de la columna/capa será visible o no, durante el procesamiento.

source: **Camera stand toggle** (|camera_stand|) allowing you to hide or display the column/layer content in the viewer.
es: **Visibilidad en mesa de trabajo** (|camera_stand|), permite controlar si el contenido de la columna/capa será visible o no, en el Visor.

source: The render and camera stand toggles work linked to similar toggles available in the Schematic nodes of the column/layer (see :ref:`Using the Stage Schematic <using_the_stage_schematic>` and :ref:`Using the FX Schematic <using_the_fx_schematic>` ).
es: Los interruptores de **Visibilidad durante el procesamiento** y **Visibilidad en mesa de trabajo** funcionan de manera enlazada con interruptores similares, presentes en los nodos de columnas/capas accesibles desde el panel Diagrama (ver :ref:`Uso del Diagrama de escenario <using_the_stage_schematic>` y :ref:`Uso del Diagrama de efectos <using_the_fx_schematic>` ).

source: **Lock toggle** (|lock|) allowing you to prevent any editing in the column/layer.
es: **Bloqueo** (|lock|), permite impedir la edición de una columna/capa.

source: **Additional settings** button (|additional_settings|) allowing you to set an **Opacity** value or a **Color Filter** to the column/layer content, when displayed in the viewer. When a column/layer has a partial opacity, its **Camera stand toggle** changes to a faded icon to indicate it.
es: **Opciones adicionales** (|additional_settings|), permite definir un valor de **Opacidad:** o un **Filtro:** de color para el contenido de cada columna/capa, al ser visualizada en el Visor. Cuando una columna/capa tiene una opacidad parcial, su ícono de **Visibilidad en mesa de trabajo** tendrá un desvanecimiento hacia la esquina inferior derecha, como forma de indicarlo.

source: Optionally you can make these additional properties also take effect at render time by activating the **Enable Column Color Filter and Transparency for Rendering** option in the Xsheet → Scene Settings... dialog.
es: Opcionalmente, será posible hacer que estas opciones adicionales sean utilizadas durante el procesamiento, activando la opción **Habilitar Opacidad y Filtro de color de columnas durante el procesamiento** en el diálogo Planilla → Opciones de escena...

source: **Preview icon** of the first drawing or image exposed in the column/layer.
es: **Ícono de previsualización** del primer dibujo o imagen expuesta en la columna/capa.

source: The icons on the Xsheet column headers can either be displayed at once when the scene is opened, or on demand by clicking on the column header, according to the **Column Icon** option available in Preferences... → Xsheet dialog section.
es: Es posible visualizar las miniaturas de los encabezados de las columnas/capas de la Planilla/Línea de tiempo **De una vez**, en el momento en que una escena es abierta, o **A demanda**, al hacer clic en su encabezado, de acuerdo a la opción **Íconos de columna:** disponible en el diálogo Archivo → Preferencias... → Carga.

source: **Parent** information, is an area where the object (by default the Table) and center (by default center B) to which each column/layer is parented is displayed (see :ref:`Linking Objects <linking_objects>` ). Currently this is not shown in the Timeline header.
es: **Superior**, es un área donde se muestra el objeto (de forma predefinida la Mesa) y el centro (de forma predefinida B) al cual se encuentra subordinada la columna/capa (ver :ref:`Vinculación de objetos <linking_objects>` ). Actualmente esta información no se muestra en el encabezado de la Línea de tiempo.

source: In the Xsheet, the column on the far left displays the frame number, with the cursor indicating the current frame. The cursor can be used to set the current frame and allows you to activate the onion skin mode to better check the animation (see :ref:`Using Onion Skin <using_onion_skin>` ). In the Timeline, the same controls are placed in the time ruler at the top of the Timeline, having an equivalent functionality.
es: En la Planilla, la columna de más hacia la izquierda muestra los números de fotograma, junto con el cursor que indica el fotograma actual. Dicho cursor puede ser usado también para activar el modo Piel de cebolla, que permite comprobar la animación de una mejor forma (ver :ref:`Uso de piel de cebolla <using_onion_skin>` ). En la Línea de tiempo, los mismos controles se encuentran ubicados en la barra de tiempo, en la parte superior de la Línea de tiempo, teniendo una funcionalidad equivalente.

source: When the animation is played back, the Xsheet/Timeline scrolls according to the current frame cursor position, in order to display the current frame. To disable the scrolling deactivate the **Xsheet Autopan during Playback** option available in the Preferences... → Xsheet dialog section.
es: Cuando se está reproduciendo la animación, la Planilla/Línea de tiempo se desplaza para mantener visible la posición del cursor de tiempo. Es posible deshabilitar este comportamiento, desactivando la opción **Desplazar automáticamente la planilla durante la reproducción**, disponible en el diálogo Archivo → Preferencias... → Planilla.

source: Above the frame number column, there are buttons for creating and navigating Memos that can be posted in the Xsheet/Timeline (see :ref:`Using Memos <using_memos>` ).
es: En el extremo superior izquierdo de la Planilla/Línea de tiempo, existen botones para crear y recorrer Notas, que pueden ser colocadas en la Planilla/Línea de tiempo para dejar indicaciones, mientras se trabaja (ver :ref:`Uso de Notas <using_memos>` ).

source: The Xsheet/Timeline can be scrolled to examine its content, while the header area and the frame column are always visible; in this way it's easier to understand how the scene is built.
es: Es posible desplazar la Planilla/Línea de tiempo para examinar su contenido, mientras esto sucede el área de encabezado y fotogramas permanecerá siempre visible; de esta forma será más sencillo entender cómo está construida una escena.

source: Columns/layers you want to hide in the Xsheet/Timeline can be folded in order to save space in the interface. Once folded they can be unfold at any moment and be visible in their original position by clicking on the column/layer header area.
es: Es posible *plegar* columnas/capas que se desee ocultar en la Planilla/Línea de tiempo, para ahorrar espacio en la interfaz. Una vez plegadas pueden ser desplegadas en cualquier momento haciendo clic en el área de encabezado de la columna/capa, volviendo así a la visibilidad.

source: **To scroll the Xsheet/Timeline:**
es: **Para desplazar la Planilla/Línea de tiempo:**

source: Middle-click and drag to scroll in any direction.
es: Hacer clic central y arrastrar para desplazar en cualquier dirección.

source: Use the mouse wheel to scroll up or down.
es: Usar la rueda del ratón para desplazar hacia arriba o abajo.

source: Use the scrolling bars to scroll only within the exposed section of the Xsheet/Timeline.
es: Usar las barras de desplazamiento para desplazar la Planilla/Línea de tiempo, dentro de las zonas con celdas que contengan dibujos expuestos.

source: Use the Up Arrow and Down Arrow keys to move one frame backwards or forward in the Xsheet.
es: Usar las teclas con flechas hacia arriba o abajo para mover el tiempo de la Planilla, un fotograma hacia atrás o adelante.

source: Use the Left Arrow and Right Arrow keys to move one frame backwards or forward in the Timeline.
es: Usar las teclas con flechas hacia izquierda o derecha para mover el tiempo de la Línea de tiempo, un fotograma hacia atrás o adelante.

source: Use Shift+Up Arrow and Shift+Down Arrow keys to move to the previous or next drawing, either in the Xsheet or Timeline. Use this option if you want to skip the hold frames.
es: Usar Mayúsculas + las teclas con flechas hacia arriba o abajo para mover hacia el dibujo anterior o siguiente, en la Planilla/Línea de tiempo.

source: Use the Page Up and Page Down keys to scroll the visible frames up or down in the Xsheet.
es: Usar las teclas RePag y AvPag para desplazar los fotogramas visibles en la Planilla, hacia arriba o abajo.

source: Use the Home and End keys to scroll up to the beginning or the end of the Xsheet content.
es: Usar la teclas Inicio y Fin para desplazar hasta el comienzo o el final del contenido de la Planilla/Línea de tiempo.

source: **To set the marker interval:**
es: **Para definir el intervalo de marcadores:**

source: Choose Xsheet → Scene Settings...
es: Elegir Planilla → **Opciones de escena...**

source: In the dialog that opens use the **Marker Interval** to set the frame interval between two markers, and the **Start Frame** to set at which frame the first marker has to be displayed.
es: En el diálogo emergente usar la opción **Intervalo de marcadores:** para definir el intervalo entre dos marcadores, y el **Fotograma inicial:** en el cual deberá mostrarse el primer marcador.

source: **To name a column:**
es: **Para renombrar una columna/capa:**

source: Double-click the column/layer name in the header and type a new name.
es: Hacer doble clic sobre el nombre de la columna/capa, en su encabezado, e ingresar un nuevo nombre.

source: **To select columns/layers:**
es: **Para seleccionar columnas/capas:**

source: Click the column/layer header to select a column.
es: Hacer clic en el encabezado de la columna/capa para seleccionarla.

source: Click and drag in the column/layer icon to select contiguous columns.
es: Hacer clic y arrastrar en el ícono de la columna/capa para seleccionar otras columnas/capas contiguas.

source: Ctrl-click (PC) or Cmd-click (Mac) to add a column/layer to or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o quitar una columna/capa a la selección.

source: **To move a column/layer selection:**
es: **Para mover una selección de columnas/capas:**

source: Click any area displaying the name of columns in the header, and drag it to the new position.
es: Hacer clic en cualquier área del encabezado que muestre el nombre de una columna/capa y arrastrar hasta la nueva posición.

source: **To edit a column/layer selection:**
es: **Para editar una selección de columnas/capas:**

source: Select the columns/layers you want to edit.
es: Seleccionar las columnas/capas que se desee.

source: Use the **Copy** command to keep in memory the selection for further operations.
es: Usar el comando **Copiar** para mantener en memoria la selección para operaciones futuras.
