Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: Click the arrow buttons next to the Add New Memo button to check the previous or next memo: the Xsheet/Timeline automatically pans to show where the selected memo is posted.
es: Hacer clic en los botones con flechas a los lados del botón **Agregar nueva nota** para revisar las notas anteriores/siguientes: la Planilla/Línea de tiempo se desplazará automáticamente para mostrar el lugar donde se encuentre la nota seleccionada.

source: **To open a memo:**
es: **Para abrir una nota:**

source: Double-click it.
es: Hacer doble clic sobre ella.

source: Right-click it and choose **Open Memo** from the menu that opens.
es: Hacer clic derecho sobre ella y elegir **Abrir nota** en el menú.

source: **To delete a memo:**
es: **Para borrar una nota:**

source: Open it and click the **Discard** button.
es: Abrir la nota y hacer clic en el botón **Descartar**.

source: Right-click it and choose **Delete Memo** from the menu that opens.
es: Hacer clic derecho sobre la nota y elegir **Borrar nota** en el menú.

source: Saving and Loading Scenes
es: Guardado y carga de escenas

source: When working on a new scene the default name (untitled) followed by a progressive number is assigned to the scene until you save it with a different name. This name is also used in case the *$scenepath* variable is used in the project settings to store temporarily the material used in the scene.
es: Al trabajar en una nueva escena, su nombre predefinido (*untitled*), seguido de un número progresivo, será asignado a la misma hasta que ésta sea guardada con otro nombre. Este nombre también será usado (en caso de que la variable *$scenepath* esté siendo utilizada en las opciones del proyecto activo) para guardar temporalmente el material usado en la misma.

source: Untitled scenes and related material are stored in the ``OpenToonz stuff\projects\temp`` folder, and deleted when the scene is saved with a proper name or not saved at all. Check regularly the ``temp`` folder, and if there is some content, delete it to free disk space.
es: Las escenas sin nombre y su material relativo serán almacenadas en la carpeta ``OpenToonz stuff\projects\temp`` , y serán borrados de allí cuando la escena sea guardada con otro nombre o en caso de que ésta fuera finalmente descartada. Es conveniente revisar periódicamente la carpeta ``temp`` para, en caso de encontrarse algún contenido allí, poder borrarlo para liberar espacio en el disco.

source: Scene files can be saved and loaded as TNZ files using the related menu commands. Scenes have to be saved in the current project *+scenes* folder, or any of its sub-folders, in order to retrieve all the material when they are loaded back.
es: Es posible guardar y cargar archivos de escena en el formato TNZ, usando los comandos del menú Archivo. Las escenas deberán ser guardadas en la carpeta *+scenes* del proyecto activo o en alguna de sus subcarpetas, para poder acceder a todo el material necesario en el momento de volver a ser cargadas.

source: When you use the **Save As...** command, if the *$scenepath* is used in the default folders definition, all the material used in the scenes and located in project default folders will be duplicated in folders related to the new scene (see :ref:`Using the $scenepath Variable in Folder Definition <using_the_$scenepath_variable_in_folder_definition>` ).
es: Al usar el comando **Guardar como...**, si la variable *$scenepath* fue utilizada al establecer las carpetas predefinidas, todo el material usado en las escenas que se encontrara ubicado en las carpetas predefinidas del proyecto, será duplicado en carpetas relativas a la nueva escena (ver :ref:`Uso de la variable $scenepath en la definición de carpetas <using_the_$scenepath_variable_in_folder_definition>` ).

source: An option **Save Automatically** allows to save the scene every given number of minutes, and is available in the Preferences... → Saving dialog section. If the option is activated, during the saving operation a message is displayed to notify the process.
es: Existe una opción **Guardar automáticamente** que permite guardar la escena cada cierto tiempo y se encuentra disponible en el diálogo Archivo → Preferencias... → Guardado. Si la opción se encontrara activa, se mostrará un mensaje durante la operación de guardado, para notificar al respecto.

source: An asterisk to the right of the scene name in the Viewer and Xsheet/Timeline title bars, denotes that there are unsaved changes for the current scene.
es: Un asterisco a la derecha del nombre de la escena, en las barras de título de OpenToonz, el Visor y la Planilla/Línea de tiempo, indicará la existencia de cambios no guardados en la escena.

source: **To work on a new scene:**
es: **Para trabajar en una nueva escena:**

source: Choose File → **New Scene**.
es: Elegir Archivo → **Nueva escena**.

source: **To save a scene and all its related levels:**
es: **Para guardar una escena y todos sus niveles relacionados:**

source: Choose File → **Save All**.
es: Elegir Archivo → **Guardar todo**.

source: **To save a scene:**
es: **Para guardar una escena:**

source: Choose File → **Save Scene**.
es: Elegir Archivo → **Guardar escena**.

source: **To save the current scene with a different name:**
es: **Para guardar una escena con otro nombre:**

source: Choose File → **Save Scene As...**
es: Elegir Archivo → **Guardar escena como...**

source: In the browser that opens select the current project *+scenes* folder, or any of its sub-folders, where you want to save the scene.
es: En el Explorador de archivos emergente, seleccionar la carpeta *+scenes* del proyecto activo, o cualquiera de sus subcarpetas, donde se desee guardar la escena.

source: Assign a name to the scene and click the **Save** button.
es: Asignar un nombre a la escena y hacer clic en el botón **Guardar**.

source: **To load a scene from the Load Scene browser:**
es: **Para cargar una escena usando comando Cargar escena:**

source: Choose File → **Load Scene...**
es: Elegir Archivo → **Cargar escena...**

source: In the browser that opens retrieve, in the *+scenes* folder of the current project or any of its sub-folders, the scene you want to load and click the **Load** button.
es: Usando el Explorador de archivos emergente, buscar en la carpeta *+scenes* del proyecto activo (o alguna de sus subcarpetas), la escena que se desee cargar y hacer clic en el botón **Cargar**.

source: **To load a scene from the OpenToonz standard browser:**
es: **Para cargar una escena usando el Explorador de archivos de OpenToonz:**

source: Right-click the scene icon and choose **Load Scene...** from the menu that opens.
es: Hacer clic derecho sobre el ícono de la escena en el Explorador y elegir la opción **Cargar escena...** en el menú.

source: Drag and drop the scene icon to the clapboard icon in the scene cast pane.
es: Arrastrar y soltar el ícono de la escena sobre el ícono de claqueta del panel Componentes de la escena.

source: Scenes can also be loaded by dragging and dropping them from the Windows Explorer or Mac OS Finder to the clapboard icon in the scene cast.
es: Las escenas también pueden ser cargadas, usando el Explorador de Windows o el Finder de macOS para arrastrar y soltarlas sobre el ícono de claqueta del panel Componentes de la escena.

source: **To load back a recently loaded scene:**
es: **Para volver a cargar una escena recientemente usada:**

source: Choose File → **Open Recent Scene File**, then select the scene you want to load from the available submenu.
es: Elegir Archivo → **Abrir escena reciente** y seleccionar la escena que se desee cargar de la lista de escenas recientemente abiertas.

source: **To revert the current scene to the last saved version:**
es: **Para revertir la escena actual a su última versión guardada:**

source: Choose File → **Revert Scene**.
es: Elegir Archivo → **Revertir escena**.

source: **To automatically save a scene every given number of minutes:**
es: **Para guardar automáticamente una escena cada cierto tiempo:**

source: Choose File → Preferences... → Saving.
es: Elegir Archivo → Preferencias → Guardado.

source: Activate the **Save Automatically** option and enter the number of minutes that have to pass between each saving operation.
es: Activar la opción **Guardar automáticamente** e ingresar el **Intervalo:** en minutos que deberá pasar entre cada operación de guardado.

source: Choose to activate which file will be saved by this function, either or both of the Scene File and Non-Scene Files.
es: Elegir qué tipo de archivos deberán ser guardados al usar esta función, entre **Archivos de escena** y **Otros archivos**.

source: Importing and Exporting Scenes
es: Importación y exportación de escenas

source: In OpenToonz each scene file belongs to a specific project, so that the material created and used in the scene is located and can be retrieved from the project default folders.
es: En OpenToonz, cada archivo de escena pertenece a un proyecto específico, eso posibilita que todo el material creado y usado en la misma sea ubicado y obtenido desde las carpetas predefinidas del proyecto correspondiente.

source: If you need to copy the scene and the related material to a different project, it is possible either to import any scene file in the current project, or to export it to any other project available in the projectroot (see :ref:`Setting up Projects <setting_up_projects>` ).
es: Si fuera necesario copiar una escena y su material correspondiente a un proyecto distinto, será posible hacerlo importando la escena al proyecto activo o exportándola hacia cualquier otro proyecto, disponible en una de las carpetas principales de proyectos de OpenToonz (ver :ref:`Creación de proyectos <setting_up_projects>` ).

source: Importing Scenes from a Different Project
es: Importación de escenas desde otro proyecto

source: When trying to load a scene created in a different project, or not located in the current project *+scenes* folder or any of its sub-folders, you are prompted to decide whether you want to import the scene (**Import Scene**) or change the current project (**Change Project**) (see :ref:`Setting up Projects <setting_up_projects>` ).
es: Al intentar cargar una escena creada en otro proyecto o que no esté ubicada en la carpeta *+scenes* del proyecto activo, o una de sus subcarpetas, se solicitará decidir si se desea **Importar la escena** o **Cambiar el proyecto** activo (ver :ref:`Creación de proyectos <setting_up_projects>` ).

source: If you decide to import the scene, the scene will be loaded, and all the scene material will be imported in the following way:
es: Si se decide **Importar la escena**, la escena será cargada y todos los materiales usados en la misma serán importados de la siguiente manera:

source: All the files that were located in the original project default folders (i.e. the ones loaded in the scene by using relative paths) will be copied into the related default folders of the current project (see :ref:`Project Default Folders <project_default_folders>` ).
es: Todos los archivos que estuvieran ubicados en carpetas predefinidas del proyecto original (esto es, aquellos cargados en dicha escena, mediante rutas relativas) serán copiados a las correspondientes carpetas predefinidas del proyecto actual (ver :ref:`Carpetas predefinidas de proyectos <project_default_folders>` ).

source: All the files that were located in external folders (i.e. the ones loaded in the scene by using absolute paths), will remain where they are.
es: Todos los archivos que estuvieran ubicados en carpetas externas (esto es, aquellos cargados en dicha escena, mediante rutas absolutas) serán mantenidos en sus ubicaciones originales.

source: While the material is automatically imported and saved in the current project, the scene file will not be saved until you will save it by using the **Save Scene** or **Save Scene As...** commands.
es: Si bien el material es importado de forma automática y guardado en el proyecto actual, el archivo de escena no será guardado hasta que el usuario lo haga de forma manual, usando el comando **Guardar escena...** o **Guardar escena como...**.

source: It is also possible to import one or several scenes into the current project with no need to load and save them by using the **Import Scene** command.
es: También será posible importar una o más escenas en el proyecto actual, sin necesidad de cargar y guardarlas, mediante el uso del comando **Importar escena** en el Explorador de archivos.

source: In this case both the material files located in the original project default folders and the scene file will be copied in the related default folders of the current project.
es: En este caso, tanto los archivos de material ubicados en las carpetas predefinidas del proyecto original, como el propio archivo de la escena, serán copiados a las correspondientes carpetas predefinidas del proyecto activo.

source: If the scene you import contains a file whose name is the same as a file already existing in the destination default folder, you will prompted whether to keep the existing file, overwrite it with the new one, or rename it adding a suffix you can decide. In this way you can control if files you are importing were already imported previously, or manage files that share the same name.
es: Si la escena que se importa contuviera un archivo cuyo nombre colisionara con el de otro archivo ya presente en la carpeta predefinida de destino, se solicitará definir si se desea mantener el archivo allí existente, sobrescribirlo con el nuevo o renombrarlo agregando un sufijo personalizado. De esta forma, será posible controlar si los archivos que se están importando ya habían sido importados con anterioridad, así como administrar la colisión casual de nombres de archivo.

source: **To load and import a scene from a different project:**
es: **Para cargar e importar una escena desde otro proyecto:**

source: Load the scene you want to import by using the **Load Scene...** browser or the OpenToonz standard browser.
es: Cargar la escena que se desee importar, mediante el uso del comando **Cargar escena...** o del Explorador de archivos de OpenToonz.

source: Choose **Import Scene** in the dialog that opens: the scene is loaded and the related files will be copied into the default folders of the current project.
es: Elegir **Importar escena** en el diálogo emergente: la escena será cargada y los archivos correspondientes serán copiados a las carpetas predefinidas del proyecto activo.

source: Save the scene file in the current project *+scenes* folder
es: Guardar la escena en la carpeta *+scenes* del proyecto activo.

source: **To import one or several scenes from a different project, without loading them:**
es: **Para importar una o más escenas de otro proyecto, sin cargarlas:**

source: Select the scenes you want to import in the OpenToonz standard browser.
es: Seleccionar las escenas que se desee importar, usando el Explorador de archivos de OpenToonz.

source: Right-click the selection and choose **Import Scene** from the menu that opens: the scene and the related material files copied in the default folders of the current project.
es: Hacer clic derecho sobre la selección y elegir la opción **Importar escena** en el menú: la escena y el material correspondiente serán copiados a las carpetas predefinidas del proyecto activo.

source: Exporting Scenes to a Different Project
es: Exportación de escenas a otro proyecto

source: Scenes can be exported if you need either to copy them from a project to any other existing project, or to copy them to a new project that can be automatically created according to the current project settings.
es: Es posible exportar escenas cuando sea necesario copiarlas de un proyecto a otro o copiarlas a un nuevo proyecto que podrá ser automáticamente creado, de acuerdo a las opciones del proyecto activo.

source: In both cases the scenes files and the related assets will be automatically collected and copied in the related default folders of the destination project (see :ref:`Collecting Assets <collecting_assets>` ).
es: En ambos casos, las escenas y los recursos correspondientes serán automáticamente recolectados y copiados a las carpetas predefinidas del proyecto de destino (ver :ref:`Recolección de recursos <collecting_assets>` ).

source: If the scene you export contains any file whose name is the same of a file already existing in the destination default folder, you will prompted whether to keep the existing file, overwrite it with the new one, or rename it adding a suffix you can decide. In this way you can control if files you are exporting were already exported previously, or manage files that share the same name.
es: Si la escena que se exporta contuviera un archivo cuyo nombre colisionara con el de otro archivo ya presente en la carpeta predefinida de destino, se solicitará definir si se desea mantener el archivo allí existente, sobrescribirlo con el nuevo o renombrarlo agregando un sufijo personalizado. De esta forma, será posible controlar si los archivos que se están exportando ya habían sido exportados con anterioridad, así como administrar la colisión casual de nombres de archivo.

source: **To export one or several scenes to a different project:**
es: **Para exportar una o más escenas a otro proyecto:**

source: Select the scenes you want to export in the OpenToonz standard browser.
es: Seleccionar las escenas que se desee exportar en el Explorador de archivos de OpenToonz.

source: Right-click the selection and choose **Export Scene...** from the menu that opens: the Export Scene dialog opens.
es: Hacer clic derecho sobre la selección y elegir **Exportar escena...** en el menú: se abrirá el diálogo Exportar escena.

source: In the dialog do one of the following:
es: En el diálogo, realizar una de las siguientes acciones:

source: Select the **Choose Existing Project** option if you want to export the selected scenes to an existing project, then navigate the folder tree to choose the destination project.
es: Seleccionar la opción **Escoger proyecto existente** si se desea exportar las escenas seleccionadas a un proyecto existente, luego explorar el árbol de carpetas hasta elegir el proyecto de destino.

source: Choose the **Create New Project** option if you want to export the selected scenes to a new project based on the current one, then assign a name for the new project.
es: Elegir **Crear nuevo proyecto** si se desea exportar las escenas seleccionadas a un proyecto nuevo basado en el activo, luego asignar un nombre para el nuevo proyecto.

source: Click the **Export** button.
es: Hacer clic en el botón **Exportar**.

source: Collecting Assets
es: Recolección de recursos

source: Files used in a scene can be located in the default folders of the current project, or loaded from an external folder (see :ref:`Project Default Folders <project_default_folders>` and :ref:`Using the File Browser <using_the_file_browser>` ).
es: Los archivo usados en una escena pueden estar ubicados en las carpetas predefinidas del proyecto activo o ser cargadas desde carpetas externas al proyecto (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` y :ref:`Uso del Explorador de archivos <using_the_file_browser>` ).

source: This means that when a project has to change location for any reason (e.g. for a backup), moving all the default folders does not grant that all the files required for the project scenes are moved along, because files loaded from external folders will remain where they are.
es: Esto significa que cuando se deba cambiar la ubicación de un proyecto por cualquier motivo (p.ej: para respaldarlo), mover todas las carpetas predefinidas no garantizará que todos los archivos necesarios para las escenas de proyecto sean movidos, ya que los archivos cargados desde carpetas externas a las del proyecto permanecerán donde estén.

source: For this reason it's possible to collect all the files used in a scene, thus importing automatically to the project default folders all the files that were not imported at loading time. At the same time the scene file for which you are collecting assets will be automatically updated in order to correct all the loading paths of the newly imported files to keep consistency.
es: Por este motivo es posible *recolectar* todos los archivos usados en una escena, importando así automáticamente a las carpetas predefinidas del proyecto todos los archivos cargados desde ubicaciones externas al proyecto. Al mismo tiempo, se actualizarán automáticamente las referencias en la escena a dichos recursos, para mantener la consistencia.

source: **To collect the assets of one or several scenes:**
es: **Para recolectar los recursos de una o más escenas:**

source: Select the scenes for which you want to collect assets.
es: Seleccionar las escenas de las cuales se desee recolectar sus recursos.

source: Right-click the selection and choose **Collect Assets** from the menu that opens: all the scene files that were located in external folders are copied into the default folders of the project, and the related paths used in the scene files are updated.
es: Hacer clic derecho sobre la selección y elegir **Recolectar recursos** en el menú: todos los archivos usados por la escena, ubicados en rutas externas al proyecto, serán copiados a las carpetas predefinidas del mismo y las rutas de carga de dichos recursos en la escena serán actualizadas a las nuevas ubicaciones.

source: Scene Backup Files
es: Archivos de respaldo de escenas

source: When scenes are saved, backup files of previous versions are automatically stored in a folder named as the scene, that is located in ``+scenes\backups`` of the current project.
es: Cuando una escena es guardada, se guardará automáticamente un respaldo de la versión anterior, en una carpeta llamada igual que la escena, ubicada en la carpeta ``+scenes\backups`` del proyecto activo.

source: The four previous scene versions are retained, and they are named as the scene, with a progressive backup number: the highest the number, the more recent the backup.
es: Se mantendrán allí las cuatro últimas versiones de la escena, nombradas de igual manera que la escena original, con un número progresivo de respaldo: cuanto más alto sea el número, más reciente será el respaldo.

source: For example if you have saved seven times the scene named my_scene, 4 backup versions of the scene named ``my_scene_3`` , ``my_scene_4`` , ``my_scene_5`` and ``my_scene_6`` are available in the ``+scenes\backups\my_scene`` folder.
es: Por ejemplo, si se guardó siete veces una escena llamada *mi_escena*, habrá disponibles 4 versiones de respaldo de la misma: ``mi_escena_3`` , ``mi_escena_4`` , ``mi_escena_5`` y ``mi_escena_6`` , en la carpeta ``+scenes\backups\mi_escena`` .

source: If you want to recover a scene backup version of a scene, you have to remove the backup number so to have the correct scene name, and move the file into the *+scenes* folder.
es: Si se deseara recuperar una de las versiones de respaldo de una escena, habría que eliminar del nombre de archivo, su número de respaldo y moverlo a la carpeta *+scenes*.

source: **To recover a backup version of a scene:**
es: **Para recuperar una versión de respaldo de una escena:**

source: Retrieve in *+scenes\backups* the folder named as the scene whose backup you want to recover.
es: Acceder en *+scenes\backups* a la carpeta llamada igual que la escena cuyo respaldo se desee recuperar.

source: In the folder, retrieve the TNZ file related to the latest backup you want to recover, and rename it, removing the backup number so to have the correct scene name.
es: En dicha carpeta, recuperar el archivo TNZ del último respaldo y renombrarlo, removiendo el número de respaldo, para volver al nombre original de la escena.
