Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: Select the column/layer containing the Sub-Xsheet.
es: Seleccionar la columna/capa que contenga la sub-planilla que se desee resecuenciar.

source: Choose Xsheet → **Resequence**.
es: Elegir Planilla → **Resecuenciar**.

source: Right-click the column header and choose **Resequence** from the menu that opens.
es: Hacer clic derecho sobre el encabezado de la columna/planilla y elegir **Resecuenciar** en el menú.

source: Loading a Scene as a Sub-Xsheet
es: Cargar una escena como sub-planilla

source: Previously saved OpenToonz scenes can be loaded in a Xsheet/Timeline as Sub-Xsheets.
es: Es posible cargar escenas de OpenToonz, guardadas con anterioridad, como sub-planillas de una Planilla/Línea de tiempo.

source: Every time a scene is loaded as a Sub-Xsheet, its contents are imported into the current project database according to the project default folders, in the same way as it would be if every single level was imported (see :ref:`Using the File Browser <using_the_file_browser>` ).
es: Cada vez que una escena es cargada como sub-planilla, su contenido es importado en el proyecto activo y ubicado en las carpetas predefinidas del mismo, exactamente de la misma forma que si se hubiera importado cada uno de los niveles que la componen de manera individual (ver :ref:`Uso del Explorador de archivos <using_the_file_browser>` ).

source: This allows you to create a library of basic animations that can be loaded and edited in other Xsheets/Timelines to create more complex animations without affecting the original files or drawings. Even when the same Sub-Xsheet is loaded twice, it is handled as if two different Sub-Xsheets were loaded, whose contents and levels can be edited separately.
es: Esto posibilita la creación de una biblioteca de animaciones básicas, que podrán ser cargadas y editadas en otras Planillas/Líneas de tiempo, para crear animaciones más complejas sin afectar a los archivos o dibujos originales. Aún en el caso de que una misma escena sea cargada dos veces como sub-planilla, cada una de ellas será tratada como una sub-planilla distinta, cuyo contenido y niveles podrán ser editados de forma independiente.

source: To keep the database well-ordered you can also activate the **Create Sub-folder when Importing Sub-Xsheet** option in the Preferences → Loading dialog, that will automatically create, in the project default folder, a folder named as the Sub-Xsheet you are importing where the levels from the Sub-Xsheet will be copied.
es: Para mantener mejor organizada la base de datos de archivos, se encuentra activada de forma predefinida la opción **Crear sub-carpeta al importar sub-planilla** en el diálogo Archivo → Preferencias → Carga, que hará que se cree automáticamente (en la carpeta predefinida correspondiente del proyecto) una carpeta con el mismo nombre de la escena que se está cargando como sub-planilla, donde se copiarán los niveles usados en ella.

source: Once a Sub-Xsheet is loaded, its levels are available in the Scene Cast in a sub-folder named as the scene you loaded.
es: Una vez que una escena ha sido cargada como sub-planilla, sus niveles estarán disponibles en el panel Componentes de la escena, en una subcarpeta llamada igual que la escena importada.

source: If the camera settings of the scene you are loading as a Sub-Xsheet are different from those of your current scene, you will be prompted whether to keep the Sub-Xsheet original camera settings, or to apply the camera settings of the current scene to the Sub-Xsheet as well.
es: Si las **Opciones de cámara** de la escena cargada como sub-planilla fueran distintas a las de la escena actual, se solicitará definir si se deberán mantener las opciones originales de la sub-planilla o aplicar las opciones de la escena a la sub-planilla.

source: If the scene you import contains a file whose name is the same of a file already existing in the destination default folder, you will prompted whether to keep the existing file, overwrite it with the new one, or rename it adding a suffix you can decide. In this way you can control if files you are importing were already imported previously, or manage files that share the same name.
es: Si la escena importada contuviera un archivo cuyo nombre colisionara con alguno de los ya existentes en la carpeta de destino en el proyecto, se solicitará definir si se desea mantener el archivo existente en el proyecto, reemplazarlo con el nuevo o renombrarlo mediante un sufijo personalizado. De esta manera será posible controlar si los archivos que están siendo importados ya lo habían sido anteriormente o simplemente administrar archivos que tuvieran el mismo nombre de forma casual.

source: **To load a previously saved scene as a Sub-Xsheet:**
es: **Para cargar una escena guardada con anterioridad como una sub-planilla:**

source: Choose Level → **Load Level...** and use the browser to load a TNZ file.
es: Elegir Nivel → **Cargar nivel...** y usar el Explorador de archivos para cargar un archivo TNZ.

source: Choose File → **Load As Sub-Xsheet...** and use the browser to load a TNZ file.
es: Elegir Archivo → **Cargar como sub-planilla...** y usar el Explorador de archivos para cargar un archivo TNZ.

source: Use the OpenToonz standard browser to drag the scene icon to the Scene Cast pane, the Xsheet/Timeline or the Viewer.
es: Usar el Explorador de archivos estándar de OpenToonz para arrastrar el ícono de la escena hacia el panel Componentes de la escena, la Planilla, la Línea de tiempo o el Visor.

source: In the file browser right-click the scene icon and select **Load As Sub-Xsheet** in the menu that opens.
es: En el Explorador de archivos hacer clic derecho sobre el ícono de la escena y seleccionar **Cargar como sub-planilla** en el menú.

source: OpenToonz scene files can also be loaded by dragging and dropping them from the Windows Explorer or macOS Finder to the Scene Cast, Xsheet/Timeline, or the viewer.
es: También es posible cargar archivos de escena de OpenToonz al arrastrar y soltarlos hacia el panel Componentes de la escena, la Planilla, la Línea de tiempo o el Visor, usando el Explorador de Windows o el Finder de macOS.

source: Exploding Sub-Xsheets
es: Explosión de sub-planillas

source: Sub-Xsheets can be exploded to automatically bring their content into the Xsheet/Timeline where they are exposed. When exploding a Sub-Xsheet it's possible to choose to bring to the main Xsheet/Timeline, when needed, the pegbars to which columns are linked.
es: Es posible explotar una sub-planilla para traer su contenido hacia la Planilla/Línea de tiempo en donde se encuentra expuesta. Al explotar una sub-planilla, será posible elegir si también se desean traer las barras de sujeción a las que se encuentren subordinadas sus columnas/capas.

source: When a Sub-Xsheet is exploded, its columns/layers and the related FX nodes are displayed as a group in the FX Schematic, in order to better retrieve them (see :ref:`Using the FX Schematic <using_the_fx_schematic>` ).
es: Cuando una sub-planilla es explotada, sus columnas/capas y sus nodos de efectos relativos serán mostrados como un grupo en el Diagrama de efectos., como forma de ayudar a mantener una buena organización en la escena (ver :ref:`Uso del Diagrama de efectos <using_the_fx_schematic>` ).

source: If FXs are applied to the Sub-Xsheet column/layer, they will not be applied to the exploded columns, but the disconnected FX nodes will remain as reference in the FX Schematic.
es: Si hubiera efectos aplicados a la columna/capa de una sub-planilla, éstos no serán aplicados a las columnas/capas explotadas, pero sí se mantendrán los nodos de efectos, desconectados, como referencia en el Diagrama de efectos.

source: **To explode a Sub-Xsheet:**
es: **Para explotar una sub-planilla:**

source: Select the Sub-Xsheet column/layer in the Xsheet/Timeline or in the Schematic.
es: Seleccionar la columna/capa de la sub-planilla en la Planilla/Línea de tiempo o en el Diagrama.

source: Choose Xsheet → **Explode Sub-Xsheet**.
es: Elegir Planilla → **Explotar sub-planilla**.

source: Right-click the Sub-Xsheet *column header* and choose **Explode Sub-Xsheet** from the menu that opens.
es: Hacer clic derecho en el encabezado de la columna/capa de la sub-planilla y elegir **Explotar sub-planilla** en el menú.

source: Choose whether to bring relevant pegbars to the main Xsheet/Timeline, or to bring columns/layers only, then click the OK button.
es: Elegir si se desea traer las barras de sujeción relevantes hacia la Planilla/Línea de tiempo principal o si sólo traer las colunas/capas, luego presionar **Aplicar**.

source: Saving a Sub-Xsheet as a Scene
es: Guardado de sub-planillas como escenas

source: The content of a Sub-Xsheet can be saved as a standard scene, i.e. a TNZ file, in order to be loaded as a stand-alone scene or to be available for reuse in other scenes.
es: Es posible guardar el contenido de una sub-planilla como una escena normal (TNZ), para poder ser cargada como una escena independiente o quedar disponible para ser reutilizada en otras escenas.

source: The Sub-Xsheet content will be saved according to the current project settings for default folders, as if you were saving a scene file (see :ref:`Project Default Folders <project_default_folders>` ).
es: El contenido de la sub-planilla será guardado usando las opciones de carpetas predefinidas del proyecto activo, como si se estuviera guardando cualquier otra escena del proyecto (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).

source: **To save a Sub-Xsheet as a scene:**
es: **Para guardar una sub-planilla como una escena:**

source: Open the Sub-Xsheet you want to save, so that its contents are displayed in the Xsheet/Timeline.
es: Entrar en la sub-planilla que se desee guardar, para que su contenido sea mostrado en la Planilla/Línea de tiempo.

source: Choose Xsheet → **Save Sub-Xsheet As...** and use the browser to save the scene file (see :ref:`Saving and Loading Scenes <saving_and_loading_scenes>` ).
es: Elegir Planilla → **Guardar sub-planilla como...** y usar el Explorador de archivos para guardar el archivo de escena (ver :ref:`Guardado y carga de escenas <saving_and_loading_scenes>` ).

source: Creating a Soundtrack
es: Creación de una banda de sonido

source: Audio clips can be loaded and edited in order to create a soundtrack for the scene; natively supported file formats are non-compressed ``WAV`` and ``AIFF`` files at 8 and 16 bit. If FFmpeg is installed and configured in Preferences... → Import/Export dialog section, ``MP3`` audio files can be loaded too. There is no limit to the number of audio clips that can be loaded in a scene.
es: Es posible cargar y editar archivos de sonido para crear una banda de sonido para la escena; los formatos de archivo soportados de forma nativa son ``WAV`` y ``AIFF`` no comprimidos de 8 y 16 bits. Si FFmpeg se encontrara instalado y configurado en el diálogo Archivo → Preferencias... → Importación/Exportación, también será posible cargar archivos ``MP3``. No existe límite para la cantidad de archivos de sonido que es posible cargar en una escena.

source: To load an audio clip you can use the Browser room; if an audio clip is imported, it is saved in the *+extras* folder (see :ref:`Using the File Browser <using_the_file_browser>` ). Loaded audio clips are also stored in the Audio folder of the Scene Cast.
es: Para cargar un clip de sonido será posible usar el espacio de trabajo Browser; cuando un archivo de sonido fuera importado, será guardado en la carpeta *+extras* (ver :ref:`Uso del Explorador de archivos <using_the_file_browser>` ). Los clips de sonido cargados también serán almacenados en la carpeta **Audio** del panel Componentes de la escena.

source: Each loaded audio clip is exposed in a different Xsheet column or Timeline layer as a series of visible sound waves to make the editing job easier; the number of frames it spans depends on the length of the audio file and the frame rate set for the current scene. For example an audio clip 3 seconds long, imported into a scene whose frame rate is 12, will occupy 36 frames; if imported in a scene whose frame rate is 24 will occupy 72 frames (see :ref:`Setting the Frame Rate <setting_the_frame_rate>` ).
es: Cada clip de sonido será expuesto en una columna propia de la Planilla (o capa de la Línea de tiempo) como una serie de ondas de sonido visibles, para hacer más sencillo el trabajo de edición; la cantidad de fotogramas que abarque dependerá de su duración y de la velocidad de fotogramas de la escena actual. Por ejemplo, un clip de sonido de 3 segundos de duración, importado en una escena con una velocidad de 12 fps, ocupará 36 fotogramas; si fuera importado en una escena con una velocidad de 24 fps, ocupará 72 fotogramas (ver :ref:`Definición de la velocidad de una escena <setting_the_frame_rate>` ).

source: Audio columns/layers can be edited the way you edit any other column/layer. Its header contains the following information about the content:
es: Es posible editar las columnas/capas de sonido de la misma forma en que es posible editar otro tipo de columnas/capas. Su encabezado contendrá la siguiente información acerca de su contenido:

source: **Name**, by default is the number of the column/layer the audio is exposed in. e.g. Col5.
es: **Nombre**, de forma predefinida será el número de la columna/capa donde se encuentra expuesto. p.ej: Col5.

source: **Render toggle** (|preview|) allowing you to include or not the audio column/layer content in the rendering.
es: **Visibilidad durante el procesamiento** (|preview|), permite controlar si el contenido de la columna/capa será audible o no, durante el procesamiento.

source: **Camera stand toggle** (|camera_stand|) allowing you to include or not the column/layer content when scrubbing the audio with the current frame cursor (see below).
es: **Visibilidad en mesa de trabajo** (|camera_stand|), permite controlar si el contenido de la columna/capa será audible o no, al arrastrar el cursor de tiempo (ver más abajo).

source: **Additional settings** button (|additional_settings|) allowing you to set the volume.
es: **Opciones adicionales** (|additional_settings|), permite definir el **Volumen:**.

source: **Loudspeaker** icon that lets you play the contents back.
es: **Altavoz**, permite reproducir el contenido del clip de sonido.

source: The **Level Settings** dialog is available for audio clips as well, allowing you to check the location of the related file, or to update the loading path to a different location, or to a different file (see :ref:`Editing Level Settings <editing_level_settings>` ).
es: El diálogo **Opciones de nivel** también se encuentra disponible para los clips de sonido, permitiendo comprobar la ubicación del archivo de origen o actualizar su ruta o nombre de archivo a uno distinto (ver :ref:`Edición de Opciones de nivel <editing_level_settings>` ).

source: The soundtrack you define with audio clips will be created by merging all of the contents of audio columns/layers according to the volume you set for each of them. While it cannot be played back when using the playback controls in the viewer, it can be scrubbed with the current frame cursor in the Xsheet frame column, the Timeline frame ruler or in the viewer framebar, and played back when a scene is previewed (see :ref:`Editing Audio Clips <editing_audio_clips>` and :ref:`Previewing the Animation <previewing_the_animation>` ).
es: La banda de sonido, definida en base a clips de sonido, será creada mezclando el contenido de las columnas/capas de sonido, de acuerdo al volumen establecido en cada una de ellas. Si bien no podrá ser reproducida al usar los controles de reproducción del Visor, será posible escucharla al arrastrar el cursor de tiempo en la Planilla/Línea de tiempo o la barra de fotogramas del Visor, y ser escuchada al previsualizar una escena (ver :ref:`Edición de clips de sonido <editing_audio_clips>` y :ref:`Previsualización de una animación <previewing_the_animation>` ).

source: When a scene is rendered in a file format supporting audio, (MP4, MOV, WebM or AVI), the soundtrack will be included in the file (see :ref:`Rendering the Animation <rendering_the_animation>` ).
es: Cuando una escena es procesada a un formato de archivo con soporte para audio (como MP4, MOV, WebM o AVI), la banda de sonido será incluida en el archivo (ver :ref:`Procesamiento de una animación <rendering_the_animation>` ).

source: Audio clips loaded in Sub-Xsheets will not be included in the output soundtrack (see :ref:`Using Sub-Xsheets <using_sub-xsheets>` ).
es: Los clips de sonido cargados en sub-planillas no serán incluidos en la banda de sonido (ver :ref:`Uso de sub-planillas <using_sub-xsheets>` ).

source: As the soundtrack cannot be played back when viewing files in the OpenToonz flipbook, you can activate the **Use Default Viewer for Movie Formats** option in the Preferences... → General dialog section, in order to view files with their own default viewer, e.g. QuickTime for the MOV format, thus playing back the soundtrack as well.
es: Cuando la banda de sonido no pueda ser escuchada al ver archivos con el Reproductor de OpenToonz, será posible activar la opción **Usar visor predefinido para formatos de película** en el diálogo Archivo → Preferencias... → General, para poder visualizar los archivos con el reproductor predefinido para cada formato, p.ej: QuickTime para el formato MOV, pudiendo así ser capaz de reproducir también el sonido.

source: **To play the contents of an audio column/layer back:**
es: **Para reproducir el contenido de una columna/capa de sonido:**

source: Click the loudspeaker icon available in the header of the column/layer. Click it again to stop the playback.
es: Hacer clic en el ícono del Altavoz, disponible en el encabezado de la columna/capa. Hacer clic nuevamente para detener la reproducción.

source: **To set the volume of an audio column/layer:**
es: **Para definir el volumen de una columna/capa de sonido:**

source: Click the Additional settings button (|additional_settings|) and use the Volume slider in there.
es: Hacer clic en el botón de **Opciones adicionales** (|additional_settings|) y usar el deslizador de **Volumen:**.

source: **To include or exclude an audio when scrubbing the audio with the current frame cursor**
es: **Para incluir o excluir una columna/capa de sonido al arrastrar el cursor de tiempo en la Planilla/Línea de tiempo:**

source: Click the Camera stand toggle (|camera_stand|) on the column/layer header. If you right-click the toggle you can select commands from a menu that opens that let you affect several columns/layers at the same time.
es: Hacer clic en el interruptor de **Visibilidad en mesa de trabajo** (|camera_stand|) en el encabezado de la columna/capa. Al hacer clic derecho sobre el mismo será posible seleccionar comandos desde un menú emergente, para afectar varias columnas/capas a la vez.

source: **To include or exclude the audio column/layer contents from the rendering:**
es: **Para incluir o excluir una columna/capa de sonido al procesar la animación:**

source: Click the Render toggle (|preview|) on the column/layer header. If you right-click the toggle you can select commands from a menu that opens that let you affect several columns/layers at the same time.
es: Hacer clic en el interruptor de **Visibilidad durante el procesamiento** (|preview|) en el encabezado de la columna/capa. Al hacer clic derecho sobre el mismo será posible seleccionar comandos desde un menú emergente, para afectar varias columnas/capas a la vez.

source: Click the Lock toggle (|lock|) on the column/layer header. If you right-click the toggle you can select commands from a menu that opens that let you lock or unlock several columns/layers at the same time.
es: Hacer clic en el interruptor **Bloqueo** (|lock|) en el encabezado de la columna/capa. Al hacer clic derecho sobre el mismo será posible seleccionar comandos desde un menú emergente, para bloquear o desbloquear varias columnas/capas a la vez.

source: Editing Audio Clips
es: Edición de clips de sonido

source: Once loaded, audio clips can be moved up and down in a Xsheet column, left and right in a Timeline layer, or to a different column/layer, in order to be played starting from a certain frame of the animation. They can be trimmed to select a part of the whole clip and edited, by deleting or copying some sections, using standard edit commands the same way you use them on standard levels.
es: Una vez cargados, es posible mover los clips de sonido a una columna/capa distinta o hacia arriba/abajo en la Planilla (izquierda/derecha en la Línea de tiempo), para hacer coincidir su comienzo con un cierto punto de la animación. También será posible recortarlos, para seleccionar sólo una parte del clip y editarla, borrando o copiando algunas secciones mediante el uso de comandos normales de edición, de la misma forma en que se podría editar cualquier nivel de animación.

source: When a clip is trimmed, the trimmed part is not eliminated, but hidden, and it has a colored horizontal marker at its starting or ending, according to where it was trimmed: it is possible to retrieve the trimmed part by moving back the markers.
es: Cuando un clip sea recortado, la parte descartada no será eliminada, sino que permanecerá oculta y en los extremos del clip se mostrarán unos marcadores: será posible recuperar las partes recortadas, desplazando estos marcadores en el sentido apropiado.

source: When a clip is split into sections by deleting, cutting or moving operations, it is automatically duplicated and trimmed to create the right result.
es: Cuando un clip sea dividido en secciones, producto de operaciones de borrado, corte y desplazamiento, será automáticamente duplicado y recortado para crear el resultado buscado.

source: Audio clips can be moved and pasted only to empty columns/layers, or to other audio columns/layers.
es: Es posible mover y pegar clips de sonido únicamente a columnas/capas vacías o a otras columnas/capas de sonido.

source: All the editing does not affect the file on disk, as it refers only to the way the clip is used in the scene.
es: Ningún tipo de edición afectará al archivo almacenado en el disco, ya que siempre se referirán únicamente a la forma en que dicho clip es usado en la escena.

source: To find a particular section in an audio file, you can examine it by scrubbing it with the current frame cursor, either in the Xsheet frame column, the Timeline frame ruler, in the viewer framebar, or by selecting any section and automatically playing it back together with the animation. This allows you to easily spot and excerpt the sections you need from an audio file.
es: Para encontrar una sección específica de un archivo de sonido, será posible examinarlo al arrastrar el cursor de tiempo, tanto en la columna de fotogramas de la Planilla, como en la barra de tiempo de la Línea de tiempo, la barra de fotogramas del Visor o mediante la selección y posterior reproducción automática de una sección del propio clip de sonido. Esto permitirá ubicar las partes necesarias del clip de sonido de una forma sencilla.

source: **To select audio clips:**
es: **Para seleccionar clips de sonido:**

source: Click and drag to select a section of the clip.
es: Hacer clic y arrastrar para seleccionar una sección del clip.

source: Shift-click a clip cell to extend the selection up to that cell.
es: Hacer Mayúsculas-clic sobre un clip para extender la selección hasta una determinada celda.

source: In the Xsheet, click the vertical strip available on the left of the clip, to select the whole clip.
es: En la Planilla, hacer clic en la banda vertical a la izquierda del clip, para seleccionarlo por completo.
