Repository: opentoonz/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/working_*_xsheet.po
Languages: es

source: **Alpha Matting**, allows to better remove noisy backgrounds, while preserving subtle faint parts of the pencil's stroke at the sme time.
es: **Transparencia alfa**, permite eliminar fondos ruidosos de una mejor forma, preservando a la vez las partes más tenues de los trazos.

source: To be able to preview the Alpha Matting, the **Show Mask** option at the top of the preview area should be activated.
es: Para poder previsualizar la **Transparencia alfa**, se debe activar la opción **Mostrar máscara** en la parte superior del área de previsualización.

source: **Mask Threshold**, allows to make the noisy background pixels transparent.
es: **Umbral de máscara:**, permite transparentar los píxeles de fondos ruidosos.

source: The regions to become transparent background in the output image are shown in red or blue colors in the preview area.
es: Las regiones que se tornarán transparentes en la imagen producida, se mostrarán en color *rojo* (o *azul*, en el caso de la separación de tinta roja) en el área de previsualización.

source: **Mask Radius**, can create a solid *border area* around the detected colored strokes, to preserve subtle faint parts of them.
es: **Radio de máscara:**, permite crear un *área fronteriza* sólida alrededor de los trazos de color detectados, para preservar las partes más tenues de los mismos.

source: **Start:** and **End:**, when separating image sequences it allows to set a frame range for the color separation work to be done.
es: **Inicio:** y **Fin:**, al separar secuencias de imágenes, permite definir un rango de fotogramas para el trabajo de separación de color a ser realizado.

source: **Format:**, defines the file format to use for the new generated files. Available options are: **PNG** and **TIF**.
es: **Formato:**, permite definir el formato de archivo a ser usado para los nuevos archivos generados. Las opciones disponibles son: **PNG** y **TIF**.

source: **Save in:**, defines where the new generated files will be saved.
es: **Guardar en:**, permite definir dónde se guardarán los nuevos archivos generados.

source: **File Suffix:**, allows the definition of file suffixes for the **Main**, **Sub1**, **Sub2** and **Sub3** color generated image files.
es: **Sufijo de archivos:**, permite definir los sufijos para los archivos de imagen generados para los colores **Principal**, **Sub1**, **Sub2** y **Sub3**.

source: If **Sub3** is enabled the left preview area will change to accomodate the new separation color. Also, and additional **Sub Color3:** option will show in the right parameters area.
es: Si el sufijo **Sub3** se encontrara habilitado, el área de previsualización de la izquierda cambiará para acomodar al nuevo color de separación. También se mostrará una opción adicional **Sub color 3:** en el área de parámetros de la derecha.

source: **Auto**, toggles the automatic preview of the separation in the left preview area.
es: **Auto**, permite activar/desactivar la previsualización automática de la separación, en el área de previsualización de la izquierda.

source: **Preview**, allows to manually preview the separation in the left preview area. Only active when the **Auto** option is disabled.
es: **Previsualizar**, permite actualizar manualmente la previsualización del área de la izquierda. Sólo se encontrará habilitada cuando la opción **Auto** se encuentre desactivada.

source: **Separate**, executes the color separation operation on the selected files.
es: **Separar**, permite ejecutar la operación de separación de colores sobre los archivos seleccionados.

source: **To Separate Colors of an image into separate image files:**
es: **Para Separar los colores de una imagen en archivos de imagen independientes:**

source: Right-click the file you want and choose **Separate Colors...** from the menu that opens. The Separate Colors window shows, where you can select several options for the operation.
es: Hacer clic derecho sobre el archivo deseado y elegir **Separar colores...** en el menú. Se abrirá la ventana Separar colores, donde será posible usar varias opciones para realizar la operación.

source: Choose the appropriate preview and separation options for the desired result.
es: Elegir las opciones apropiadas de previsualización y separación para obtener el resultado deseado.

source: Press the **Separate** button to execute the color separation job.
es: Presionar el botón **Separar** para ejecutar la tarea de separación de colores.

source: Close the window by pressing the **Close** button.
es: Cerrar la ventana presionando el botón **Cerrar**.

source: Exposing Levels
es: Exposición de niveles

source: Toonz level files, images for backgrounds and overlays, audio files, video clips, and other OpenToonz scenes, have to be exposed in the Xsheet/Timeline columns in order to be part of the scene.
es: Los niveles de animación, imágenes de fondo y superpuestas, archivos de sonido, clips de video y otras escenas de OpenToonz, tienen que ser expuestas en columnas de la Planilla (o capas de la Línea de tiempo), para poder ser parte de la escena.

source: If the asset you want to use has already been loaded but not exposed, or it was removed from the scene, it can be retrieved from the Scene Cast window.
es: Si el recurso que se desea usar ya ha sido cargado pero no expuesto, o si fue eliminado de la escena, puede ser obtenido usando el panel Componentes de la escena.

source: In case you need to retrieve some specific drawings from an animation level, you can display it in the Level Strip, in order to select the drawings to expose.
es: En caso de ser necesario obtener algunos dibujos específicos de un nivel de animación, es posible visualizarlo en la Cinta de nivel, para poder seleccionar los dibujos a exponer.

source: Animation levels you define directly in the scene, for instance levels you scanned, or drew directly in OpenToonz, are automatically exposed in the Xsheet/Timeline.
es: Los niveles de animación que hayan sido definidos directamente en la escena, por ejemplo los dibujados directamente en OpenToonz, serán expuestos automáticamente en la Planilla/Línea de tiempo.

source: Using the Scene Cast
es: Uso del panel Componentes de la escena

source: All the animation levels you create or load in the scene are stored in the Scene Cast pane. Levels remain available in the Scene Cast even if they are not used in the scene anymore. From the Scene Cast, they can be exposed, edited, saved and removed.
es: Todos los niveles de animación creados o cargados en la escena estarán almacenados en el panel Componentes de la escena. Los niveles permanecerán disponibles en dicho panel, aunque ya no estén siendo usados en la escena. Desde el panel Componentes de la escena, será posible exponerlos, guardarlos y eliminarlos.

source: In the tree available on the left you can find the following:
es: En el árbol disponible en la parte izquierda del panel, es posible encontrar lo siguiente:

source: A clapboard icon referring to the current scene.
es: Un ícono de claqueta, que hace referencia a la escena actual.

source: The **Cast** folder containing all the animation levels you create or load.
es: La carpeta **Cast**, que contiene los niveles de animación creados o cargados.

source: The **Audio** folder containing all the audio files you load or create (see :ref:`Creating a Soundtrack <creating_a_soundtrack>` ).
es: La carpeta **Audio**, que contiene todos los archivos de sonido cargados o grabados (ver :ref:`Creación de una banda de sonido <creating_a_soundtrack>` ).

source: You can create new folders and sub-folders where animation levels can be arranged. The current location path in the cast tree is displayed in the cast top bar; folders can be renamed and new folders can be created. Levels can be displayed with related icons, or in a list displaying additional informations that can be also used to sort files.
es: Es posible crear nuevas carpetas y subcarpetas, donde será posible organizar los niveles de animación. La ruta hasta la ubicación actual, dentro del árbol de componentes, será mostrada en la parte superior del área de la derecha; es posible renombrar y crear nuevas carpetas. Los niveles pueden ser visualizados en forma de íconos o como una lista, capaz de mostrar información adicional, que también podrá ser usada para ordenar los archivos.

source: Animation levels that are no longer available at the defined path are identified by a red color.
es: Los niveles de animación que ya no estuvieran disponibles en la ruta conocida, serán identificados en color *rojo*.

source: **To display all the cast elements of a specific folder:**
es: **Para visualizar todos los elementos de una carpeta específica:**

source: Click the folder icon in the cast tree on the left of the pane.
es: Hacer clic en el ícono de la carpeta en el árbol de componentes en la sección izquierda del panel.

source: **To display all the cast elements:**
es: **Para visualizar todos los elementos de la escena:**

source: Click the clapboard icon at the top of the cast tree on the left of the pane.
es: Hacer clic sobre el ícono de claqueta en la parte superior del árbol de componentes a la izquierda del panel.

source: **To choose the cast display mode:**
es: **Para elegir el modo de visualización de los componentes:**

source: Click the **Icon** button (|thumbnails|) in the bottom bar of the cast to display levels with the related icons.
es: Hacer clic en el botón **Íconos** (|thumbnails|) en la barra inferior del panel, para mostrar los niveles en forma de íconos.

source: Click the **List** button (|list|) in the bottom bar of the cast to display levels in a list; click the labels at the top of the columns to sort files accordingly.
es: Hacer clic en el botón **Lista** (|list|) en la barra inferior del panel, para mostrar los niveles en forma de lista; es posible ordenar la lista, haciendo clic en la parte superior de las columnas.

source: **To resize the Scene Cast sections:**
es: **Para redimensionar las secciones del panel Componentes de la escena:**

source: Click and drag the separator collapsed to the window border towards the window center to display again the hidden section.
es: Arrastrar el separador colapsado hacia el centro del panel, para volver a mostrar la sección oculta.

source: Click the **New** button (|new_folder|) in the bottom bar of the cast.
es: Hacer clic en el botón **Nueva** (|new_folder|) en la barra inferior del panel.

source: **To move one folder up in the cast tree:**
es: **Para moverse hacia una carpeta superior en el árbol de componentes:**

source: Click the folder up button (|folder_up|) in the bottom bar of the cast.
es: Hacer clic en el botón **Arriba** (|folder_up|) en la barra inferior del panel.

source: **To perform a selection:**
es: **Para realizar una selección:**

source: Click to select a level.
es: Hacer clic para seleccionar un nivel.

source: Ctrl-click (PC) or Cmd-click (Mac) to add a level to or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o quitar un nivel a la selección.

source: **To move levels to a folder:**
es: **Para mover niveles a una carpeta:**

source: Select them and drag them to the folder in the cast tree.
es: Seleccionarlos y arrastrarlos hasta la carpeta apropiada en el árbol de componentes.

source: **To expose the selection:**
es: **Para exponer la selección:**

source: Choose Level → **Expose in Xsheet**.
es: Elegir Nivel → **Exponer en planilla**.

source: Right-click the selection in the Scene Cast and choose **Expose in Xsheet** from the menu that opens. In case of a multiple level selection, each level will be placed in a different column/layer, starting from the first empty one.
es: Hacer clic derecho sobre la selección en el panel Componentes de la escena y elegir **Exponer en planilla** en el menú. En caso de tener varios niveles seleccionados, cada uno será ubicado en una columna/capa distinta, comenzando desde la primera disponible.

source: Drag and drop the selection to the Xsheet/Timeline cell where you want to start exposing it. In case of a multiple level selection, each level will be placed in a different column/layer.
es: Arrastrar y soltar la selección sobre la celda de la Planilla/Línea de tiempo donde se desee comenzar a exponerla. En caso de tener varios niveles seleccionados, cada uno será ubicado en una columna/capa distinta.

source: **To display an animation level in the Level Strip:**
es: **Para visualizar un nivel de animación en la Cinta de nivel:**

source: Select it in the Scene Cast and choose Level → **Display in Level Strip**.
es: Seleccionarlo en el panel Componentes de la escena y elegir Nivel → **Mostrar en cinta de nivel**.

source: Right-click it in the Scene Cast and choose **Display in Level Strip** from the menu that opens.
es: Hacer clic derecho en el panel Componentes de la escena y elegir **Mostrar en cinta de nivel** en el menú.

source: **To remove the selected elements:**
es: **Para eliminar los elementos seleccionados:**

source: Right-click the selection in the Scene Cast and choose **Remove Level** from the menu that opens.
es: Hacer clic derecho sobre la selección en el panel Componentes de la escena y elegir **Eliminar nivel** en el menú.

source: Levels can be removed only if they are not used in the scene.
es: Los niveles sólo podrán ser eliminados si no se encuentran siendo usados en la escena.

source: **To remove all the unused elements:**
es: **Para eliminar todos los elementos no usados:**

source: Choose Level → **Remove All Unused Levels**.
es: Elegir Nivel → **Eliminar niveles no usados**.

source: Right-click in the Scene Cast and choose **Remove All Unused Levels** from the menu that opens.
es: Hacer clic derecho en el panel Componentes de la escena y elegir **Eliminar niveles no usados** en el menú.

source: Using the Level Strip
es: Uso de la Cinta de nivel

source: When an animation level is displayed in the Level Strip, you can select the specific drawings you want to expose in the Xsheet/Timeline. This feature may prove useful especially when you need to retrieve some drawings that belong to the level, but that are not available in the Xsheet/Timeline cells.
es: Cuando un nivel de animación es mostrado en la Cinta de nivel, es posible seleccionar los dibujos específicos que se desea exponer en la Planilla/Línea de tiempo. Es posible que esta característica resulte útil, especialmente cuando se necesite obtener algunos dibujos que no se encuentren expuestos en las celdas de la Planilla/Línea de tiempo.

source: **To display an animation level in the level strip:**
es: **Para visualizar un nivel en la Cinta de nivel:**

source: Select any level drawing exposed in the Xsheet/Timeline.
es: Seleccionar cualquier dibujo del nivel, expuesto en la Planilla/Línea de tiempo.

source: Right-click it the Scene Cast and choose **Display in Level Strip** from the menu that opens.
es: Hacer clic derecho en el panel Componentes de la escena y elegir **Mostrar en cinta de nivel** en el menú.

source: **To select drawings in the Level Strip:**
es: **Para seleccionar dibujos en la Cinta de nivel:**

source: Click to select a drawing.
es: Hacer clic sobre un dibujo para seleccionarlo.

source: Ctrl-click (PC) or Cmd-click (Mac) to add a drawing to or remove it from the selection.
es: Hacer Ctrl-clic (PC) o Cmd-clic (macOS) para agregar o quitar un dibujo a la selección.

source: Copy and paste the selection in the Xsheet/Timeline, into the cell you want.
es: Copiar y pegar la selección en la Planilla/Línea de tiempo, en la celda deseada.

source: Right-click in the Level Strip selection and choose **Expose in Xsheet** from the menu that opens. Drawings will be exposed at the beginning of the first empty column.
es: Hacer clic derecho en la Cinta de nivel y elegir **Exponer en planilla** en el menú. Los dibujos serán expuestos comenzando en la primera columna/capa vacía.

source: Drag and drop the selection to the Xsheet/Timeline cell where you want to start exposing it and keep the **Shift** key pressed, to insert them if other content is already exposed in the destination cells.
es: Arrastrar y soltar la selección sobre la celda de la Planilla/Línea de tiempo donde se desee comenzar a exponerla, mantener presionada la tecla **Mayúsculas** para insertar, si ya hubiera otro contenido expuesto en las celdas de destino.

source: Drag and drop the selection to the Xsheet/Timeline cell where you want to start exposing it and keep the **Alt** key pressed, to overwrite any other content previously exposed in the destination cells.
es: Arrastrar y soltar la selección sobre la celda de la Planilla/Línea de tiempo donde se desee comenzar a exponerla, mantener presionada la tecla **Alt** para sobrescribir el contenido ya expuesto en las celdas de destino.

source: When it is not possible to expose the selection, a red outline is displayed instead of the selection.
es: En caso de no ser posible exponer la selección, se mostrará un contorno *rojo* en vez de la selección.

source: Replacing Levels
es: Reemplazo de niveles

source: An animation level exposed in the Xsheet/Timeline can be easily replaced by another animation level, preserving any editing performed in the sequence of drawings exposed in the column/layer cells. In this way it is possible to reuse the same edited sequence for different levels. For example you can reuse the edited sequence of a character level for the related shadow level by copying and pasting the character sequence, then replacing the character level with the shadow one.
es: Es posible reemplazar de forma sencilla un nivel de animación expuesto en la Planilla/Línea de tiempo, preservando cualquier edición realizada en la secuencia de dibujos expuestos en las celdas de la columna/capa correspondiente. Siendo posible así, reutilizar la misma secuencia editada para distintos niveles. Por ejemplo, será posible reutilizar la secuencia editada del nivel de un personaje, para crear un nivel para su sombra, copiando y pegando la secuencia del personaje, y luego reemplazando el nivel del personaje con el de la sombra.

source: It is possible to replace the level as a whole, or limited only to selected cells. In both cases only the content of the selected cells will be replaced: if any drawing of the replaced level is exposed somewhere else in the Xsheet/Timeline, it will not be affected by the replacing operation.
es: Es posible reemplazar el nivel, tanto en forma completa, como limitándose a las celdas seleccionadas. En ambos casos, únicamente el contenido de las celdas seleccionadas será reemplazado; si cualquier dibujo del nivel reemplazado estuviera expuesto en algún otro lugar de la Planilla/Línea de tiempo, no se verá afectado por la operación de reemplazo.

source: In case the new level does not contain some of the frames you are going to replace, the level name and number in the cell turn red to warn you that there is no drawing available for that cell.
es: En caso de que el nuevo nivel carezca de alguno de los fotogramas que se desea reemplazar, el nombre del nivel y su número de fotograma en la celda se mostrarán en *rojo*, como advertencia de que no existe un dibujo disponible para esa celda.

source: The original level is preserved in the Scene Cast from where it can be retrieved, or removed (see :ref:`Using the Scene Cast <using_the_scene_cast>` ).
es: El nivel original permanecerá disponible en el panel Componentes de la escena, desde donde puede ser reutilizado o eliminado (ver :ref:`Uso del panel Componentes de la escena <using_the_scene_cast>` ).

source: **To replace a level in the Xsheet/Timeline:**
es: **Para reemplazar un nivel en la Planilla/Línea de tiempo:**

source: Select the cells where the level you want to replace is exposed.
es: Seleccionar las celdas donde se encuentra expuesto el nivel que se desee reemplazar.

source: Choose Level → **Replace Level...**.
es: Elegir Nivel → **Reemplazar nivel...**.

source: Right-click the selection and choose one of the options in the **Replace Level** submenu, from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir una de las opciones en el submenú **Reemplazar nivel**.

source: In the browser select the new level, and click the **OK** button (see :ref:`Using the File Browser <using_the_file_browser>` ).
es: En el Explorador de archivos seleccionar el nuevo nivel y hacer clic en el botón **Reemplazar** (ver :ref:`Uso del Explorador de archivos <using_the_file_browser>` ).

source: Editing Level Settings
es: Edición de Opciones de nivel

source: Once a level is exposed, its properties (path, DPI, subsampling, etc.), can be controlled in the Level Settings dialog. Settings are the following:
es: Una vez que un nivel ha sido expuesto, es posible controlar sus propiedades (ruta, PPP, sub-muestreo, etc.) por medio del diálogo Opciones de nivel. Las opciones disponibles son las siguientes:

source: **Name** is the name used to identify the level, by default it is the same name of the file.
es: **Nombre:**, es el nombre usado para identificar al nivel, de forma predefinida es igual que su nombre de archivo.

source: **Path** displays the location of the file, using default folder aliases if needed. By typing in this field, or using the browser button, you can update the path to a different location, or to different file.
es: **Ruta:**, muestra la ubicación del archivo usando, de ser necesario, referencias a las carpetas predefinidas. Ingresando manualmente texto en este campo o usando el botón del Explorador de archivos, será posible actualizar la ruta hasta una ubicación diferente o a un archivo distinto.

source: If in the browser you choose any project default folder, in the path field the full path will be replace by the related default folder alias (see :ref:`Project Default Folders <project_default_folders>` ).
es: Si en el Explorador se eligiera alguna de las carpetas predefinidas del proyecto, en el campo Ruta se utilizará una *referencia* a la misma (ver :ref:`Carpetas predefinidas de un proyecto <project_default_folders>` ).

source: **Scan Path** displays the location of the scanned images that were cleaned up to obtain the actual level (see :ref:`Cleaning-up Scanned Drawings <cleaning-up_scanned_drawings>` ). This is available only for Toonz raster levels.
es: **Ruta de escaneo:**, muestra la ubicación de las imágenes escaneadas, que fueron limpiadas para obtener el nivel actual (ver :ref:`Limpieza de imágenes escaneadas <cleaning-up_scanned_drawings>` ). Esta opción se encuentra disponible sólo para niveles de Imagen de Toonz.

source: **DPI** lets you change the level DPI, thus changing its size. To return to the original image DPI set the option menu above to Image DPI.
es: **PPP:**, permite cambiar los PPP (puntos por pulgada) del nivel, cambiando así su tamaño. Para regresar a los PPP originales de la imagen, definir el menú superior en **PPP de la imagen**.

source: **Forced Squared Pixel** forces a level that has a different horizontal and vertical DPI, and therefore is displayed stretched, to have the pixel shape squared, and thus to be displayed properly.
es: **Forzar píxel cuadrado**, fuerza la utilización de píxeles cuadrados para visualizar el nivel, corrigiendo así problemas de estiramiento, causados cuando los PPP horizontales y verticales de un nivel no coinciden.

source: **Width** and **Height** let you set a different size for the level, thus changing its DPI. The level maintains its A/R.
es: **Ancho:** y **Altura:**, permiten definir un tamaño distinto para el nivel, cambiando así sus PPP. El nivel mantendrá en todo momento su proporción.
